konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/usb.inc
#
# Derived from Raspberry Pi Pico SDK
#
# Copyright (c) 2024 Raspberry Pi Ltd.
#
# Redistribution and use permitted under BSD 3-Clause terms.
# See full license in THIRD_PARTY_LICENSES/PICO_SDK_LICENSE.txt
#
# =============================================================================
# Register block : USB
# Version        : 1
# Bus type       : ahbl
# Description    : USB FS/LS controller device registers
# =============================================================================
.ifndef	_HARDWARE_REGS_USB_H
.set	_HARDWARE_REGS_USB_H, 1
# =============================================================================
# Register    : USB_ADDR_ENDP
# Description : Device address and endpoint control
.equ	USB_ADDR_ENDP_OFFSET, 0x00000000
.equ	USB_ADDR_ENDP_BITS, 0x000f007f
.equ	USB_ADDR_ENDP_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP_ENDPOINT
# Description : Device endpoint to send data to. Only valid for HOST mode.
.equ	USB_ADDR_ENDP_ENDPOINT_RESET, 0x0
.equ	USB_ADDR_ENDP_ENDPOINT_BITS, 0x000f0000
.equ	USB_ADDR_ENDP_ENDPOINT_MSB, 19
.equ	USB_ADDR_ENDP_ENDPOINT_LSB, 16
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP_ADDRESS
# Description : In device mode, the address that the device should respond to.
#               Set in response to a SET_ADDR setup packet from the host. In
#               host mode set to the address of the device to communicate with.
.equ	USB_ADDR_ENDP_ADDRESS_RESET, 0x00
.equ	USB_ADDR_ENDP_ADDRESS_BITS, 0x0000007f
.equ	USB_ADDR_ENDP_ADDRESS_MSB, 6
.equ	USB_ADDR_ENDP_ADDRESS_LSB, 0
# =============================================================================
# Register    : USB_ADDR_ENDP1
# Description : Interrupt endpoint 1. Only valid for HOST mode.
.equ	USB_ADDR_ENDP1_OFFSET, 0x00000004
.equ	USB_ADDR_ENDP1_BITS, 0x060f007f
.equ	USB_ADDR_ENDP1_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP1_INTEP_PREAMBLE
# Description : Interrupt EP requires preamble (is a low speed device on a full
#               speed hub)
.equ	USB_ADDR_ENDP1_INTEP_PREAMBLE_RESET, 0x0
.equ	USB_ADDR_ENDP1_INTEP_PREAMBLE_BITS, 0x04000000
.equ	USB_ADDR_ENDP1_INTEP_PREAMBLE_MSB, 26
.equ	USB_ADDR_ENDP1_INTEP_PREAMBLE_LSB, 26
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP1_INTEP_DIR
# Description : Direction of the interrupt endpoint. In=0, Out=1
.equ	USB_ADDR_ENDP1_INTEP_DIR_RESET, 0x0
.equ	USB_ADDR_ENDP1_INTEP_DIR_BITS, 0x02000000
.equ	USB_ADDR_ENDP1_INTEP_DIR_MSB, 25
.equ	USB_ADDR_ENDP1_INTEP_DIR_LSB, 25
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP1_ENDPOINT
# Description : Endpoint number of the interrupt endpoint
.equ	USB_ADDR_ENDP1_ENDPOINT_RESET, 0x0
.equ	USB_ADDR_ENDP1_ENDPOINT_BITS, 0x000f0000
.equ	USB_ADDR_ENDP1_ENDPOINT_MSB, 19
.equ	USB_ADDR_ENDP1_ENDPOINT_LSB, 16
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP1_ADDRESS
# Description : Device address
.equ	USB_ADDR_ENDP1_ADDRESS_RESET, 0x00
.equ	USB_ADDR_ENDP1_ADDRESS_BITS, 0x0000007f
.equ	USB_ADDR_ENDP1_ADDRESS_MSB, 6
.equ	USB_ADDR_ENDP1_ADDRESS_LSB, 0
# =============================================================================
# Register    : USB_ADDR_ENDP2
# Description : Interrupt endpoint 2. Only valid for HOST mode.
.equ	USB_ADDR_ENDP2_OFFSET, 0x00000008
.equ	USB_ADDR_ENDP2_BITS, 0x060f007f
.equ	USB_ADDR_ENDP2_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP2_INTEP_PREAMBLE
# Description : Interrupt EP requires preamble (is a low speed device on a full
#               speed hub)
.equ	USB_ADDR_ENDP2_INTEP_PREAMBLE_RESET, 0x0
.equ	USB_ADDR_ENDP2_INTEP_PREAMBLE_BITS, 0x04000000
.equ	USB_ADDR_ENDP2_INTEP_PREAMBLE_MSB, 26
.equ	USB_ADDR_ENDP2_INTEP_PREAMBLE_LSB, 26
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP2_INTEP_DIR
# Description : Direction of the interrupt endpoint. In=0, Out=1
.equ	USB_ADDR_ENDP2_INTEP_DIR_RESET, 0x0
.equ	USB_ADDR_ENDP2_INTEP_DIR_BITS, 0x02000000
.equ	USB_ADDR_ENDP2_INTEP_DIR_MSB, 25
.equ	USB_ADDR_ENDP2_INTEP_DIR_LSB, 25
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP2_ENDPOINT
# Description : Endpoint number of the interrupt endpoint
.equ	USB_ADDR_ENDP2_ENDPOINT_RESET, 0x0
.equ	USB_ADDR_ENDP2_ENDPOINT_BITS, 0x000f0000
.equ	USB_ADDR_ENDP2_ENDPOINT_MSB, 19
.equ	USB_ADDR_ENDP2_ENDPOINT_LSB, 16
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP2_ADDRESS
# Description : Device address
.equ	USB_ADDR_ENDP2_ADDRESS_RESET, 0x00
.equ	USB_ADDR_ENDP2_ADDRESS_BITS, 0x0000007f
.equ	USB_ADDR_ENDP2_ADDRESS_MSB, 6
.equ	USB_ADDR_ENDP2_ADDRESS_LSB, 0
# =============================================================================
# Register    : USB_ADDR_ENDP3
# Description : Interrupt endpoint 3. Only valid for HOST mode.
.equ	USB_ADDR_ENDP3_OFFSET, 0x0000000c
.equ	USB_ADDR_ENDP3_BITS, 0x060f007f
.equ	USB_ADDR_ENDP3_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP3_INTEP_PREAMBLE
# Description : Interrupt EP requires preamble (is a low speed device on a full
#               speed hub)
.equ	USB_ADDR_ENDP3_INTEP_PREAMBLE_RESET, 0x0
.equ	USB_ADDR_ENDP3_INTEP_PREAMBLE_BITS, 0x04000000
.equ	USB_ADDR_ENDP3_INTEP_PREAMBLE_MSB, 26
.equ	USB_ADDR_ENDP3_INTEP_PREAMBLE_LSB, 26
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP3_INTEP_DIR
# Description : Direction of the interrupt endpoint. In=0, Out=1
.equ	USB_ADDR_ENDP3_INTEP_DIR_RESET, 0x0
.equ	USB_ADDR_ENDP3_INTEP_DIR_BITS, 0x02000000
.equ	USB_ADDR_ENDP3_INTEP_DIR_MSB, 25
.equ	USB_ADDR_ENDP3_INTEP_DIR_LSB, 25
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP3_ENDPOINT
# Description : Endpoint number of the interrupt endpoint
.equ	USB_ADDR_ENDP3_ENDPOINT_RESET, 0x0
.equ	USB_ADDR_ENDP3_ENDPOINT_BITS, 0x000f0000
.equ	USB_ADDR_ENDP3_ENDPOINT_MSB, 19
.equ	USB_ADDR_ENDP3_ENDPOINT_LSB, 16
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP3_ADDRESS
# Description : Device address
.equ	USB_ADDR_ENDP3_ADDRESS_RESET, 0x00
.equ	USB_ADDR_ENDP3_ADDRESS_BITS, 0x0000007f
.equ	USB_ADDR_ENDP3_ADDRESS_MSB, 6
.equ	USB_ADDR_ENDP3_ADDRESS_LSB, 0
# =============================================================================
# Register    : USB_ADDR_ENDP4
# Description : Interrupt endpoint 4. Only valid for HOST mode.
.equ	USB_ADDR_ENDP4_OFFSET, 0x00000010
.equ	USB_ADDR_ENDP4_BITS, 0x060f007f
.equ	USB_ADDR_ENDP4_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP4_INTEP_PREAMBLE
# Description : Interrupt EP requires preamble (is a low speed device on a full
#               speed hub)
.equ	USB_ADDR_ENDP4_INTEP_PREAMBLE_RESET, 0x0
.equ	USB_ADDR_ENDP4_INTEP_PREAMBLE_BITS, 0x04000000
.equ	USB_ADDR_ENDP4_INTEP_PREAMBLE_MSB, 26
.equ	USB_ADDR_ENDP4_INTEP_PREAMBLE_LSB, 26
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP4_INTEP_DIR
# Description : Direction of the interrupt endpoint. In=0, Out=1
.equ	USB_ADDR_ENDP4_INTEP_DIR_RESET, 0x0
.equ	USB_ADDR_ENDP4_INTEP_DIR_BITS, 0x02000000
.equ	USB_ADDR_ENDP4_INTEP_DIR_MSB, 25
.equ	USB_ADDR_ENDP4_INTEP_DIR_LSB, 25
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP4_ENDPOINT
# Description : Endpoint number of the interrupt endpoint
.equ	USB_ADDR_ENDP4_ENDPOINT_RESET, 0x0
.equ	USB_ADDR_ENDP4_ENDPOINT_BITS, 0x000f0000
.equ	USB_ADDR_ENDP4_ENDPOINT_MSB, 19
.equ	USB_ADDR_ENDP4_ENDPOINT_LSB, 16
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP4_ADDRESS
# Description : Device address
.equ	USB_ADDR_ENDP4_ADDRESS_RESET, 0x00
.equ	USB_ADDR_ENDP4_ADDRESS_BITS, 0x0000007f
.equ	USB_ADDR_ENDP4_ADDRESS_MSB, 6
.equ	USB_ADDR_ENDP4_ADDRESS_LSB, 0
# =============================================================================
# Register    : USB_ADDR_ENDP5
# Description : Interrupt endpoint 5. Only valid for HOST mode.
.equ	USB_ADDR_ENDP5_OFFSET, 0x00000014
.equ	USB_ADDR_ENDP5_BITS, 0x060f007f
.equ	USB_ADDR_ENDP5_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP5_INTEP_PREAMBLE
# Description : Interrupt EP requires preamble (is a low speed device on a full
#               speed hub)
.equ	USB_ADDR_ENDP5_INTEP_PREAMBLE_RESET, 0x0
.equ	USB_ADDR_ENDP5_INTEP_PREAMBLE_BITS, 0x04000000
.equ	USB_ADDR_ENDP5_INTEP_PREAMBLE_MSB, 26
.equ	USB_ADDR_ENDP5_INTEP_PREAMBLE_LSB, 26
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP5_INTEP_DIR
# Description : Direction of the interrupt endpoint. In=0, Out=1
.equ	USB_ADDR_ENDP5_INTEP_DIR_RESET, 0x0
.equ	USB_ADDR_ENDP5_INTEP_DIR_BITS, 0x02000000
.equ	USB_ADDR_ENDP5_INTEP_DIR_MSB, 25
.equ	USB_ADDR_ENDP5_INTEP_DIR_LSB, 25
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP5_ENDPOINT
# Description : Endpoint number of the interrupt endpoint
.equ	USB_ADDR_ENDP5_ENDPOINT_RESET, 0x0
.equ	USB_ADDR_ENDP5_ENDPOINT_BITS, 0x000f0000
.equ	USB_ADDR_ENDP5_ENDPOINT_MSB, 19
.equ	USB_ADDR_ENDP5_ENDPOINT_LSB, 16
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP5_ADDRESS
# Description : Device address
.equ	USB_ADDR_ENDP5_ADDRESS_RESET, 0x00
.equ	USB_ADDR_ENDP5_ADDRESS_BITS, 0x0000007f
.equ	USB_ADDR_ENDP5_ADDRESS_MSB, 6
.equ	USB_ADDR_ENDP5_ADDRESS_LSB, 0
# =============================================================================
# Register    : USB_ADDR_ENDP6
# Description : Interrupt endpoint 6. Only valid for HOST mode.
.equ	USB_ADDR_ENDP6_OFFSET, 0x00000018
.equ	USB_ADDR_ENDP6_BITS, 0x060f007f
.equ	USB_ADDR_ENDP6_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP6_INTEP_PREAMBLE
# Description : Interrupt EP requires preamble (is a low speed device on a full
#               speed hub)
.equ	USB_ADDR_ENDP6_INTEP_PREAMBLE_RESET, 0x0
.equ	USB_ADDR_ENDP6_INTEP_PREAMBLE_BITS, 0x04000000
.equ	USB_ADDR_ENDP6_INTEP_PREAMBLE_MSB, 26
.equ	USB_ADDR_ENDP6_INTEP_PREAMBLE_LSB, 26
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP6_INTEP_DIR
# Description : Direction of the interrupt endpoint. In=0, Out=1
.equ	USB_ADDR_ENDP6_INTEP_DIR_RESET, 0x0
.equ	USB_ADDR_ENDP6_INTEP_DIR_BITS, 0x02000000
.equ	USB_ADDR_ENDP6_INTEP_DIR_MSB, 25
.equ	USB_ADDR_ENDP6_INTEP_DIR_LSB, 25
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP6_ENDPOINT
# Description : Endpoint number of the interrupt endpoint
.equ	USB_ADDR_ENDP6_ENDPOINT_RESET, 0x0
.equ	USB_ADDR_ENDP6_ENDPOINT_BITS, 0x000f0000
.equ	USB_ADDR_ENDP6_ENDPOINT_MSB, 19
.equ	USB_ADDR_ENDP6_ENDPOINT_LSB, 16
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP6_ADDRESS
# Description : Device address
.equ	USB_ADDR_ENDP6_ADDRESS_RESET, 0x00
.equ	USB_ADDR_ENDP6_ADDRESS_BITS, 0x0000007f
.equ	USB_ADDR_ENDP6_ADDRESS_MSB, 6
.equ	USB_ADDR_ENDP6_ADDRESS_LSB, 0
# =============================================================================
# Register    : USB_ADDR_ENDP7
# Description : Interrupt endpoint 7. Only valid for HOST mode.
.equ	USB_ADDR_ENDP7_OFFSET, 0x0000001c
.equ	USB_ADDR_ENDP7_BITS, 0x060f007f
.equ	USB_ADDR_ENDP7_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP7_INTEP_PREAMBLE
# Description : Interrupt EP requires preamble (is a low speed device on a full
#               speed hub)
.equ	USB_ADDR_ENDP7_INTEP_PREAMBLE_RESET, 0x0
.equ	USB_ADDR_ENDP7_INTEP_PREAMBLE_BITS, 0x04000000
.equ	USB_ADDR_ENDP7_INTEP_PREAMBLE_MSB, 26
.equ	USB_ADDR_ENDP7_INTEP_PREAMBLE_LSB, 26
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP7_INTEP_DIR
# Description : Direction of the interrupt endpoint. In=0, Out=1
.equ	USB_ADDR_ENDP7_INTEP_DIR_RESET, 0x0
.equ	USB_ADDR_ENDP7_INTEP_DIR_BITS, 0x02000000
.equ	USB_ADDR_ENDP7_INTEP_DIR_MSB, 25
.equ	USB_ADDR_ENDP7_INTEP_DIR_LSB, 25
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP7_ENDPOINT
# Description : Endpoint number of the interrupt endpoint
.equ	USB_ADDR_ENDP7_ENDPOINT_RESET, 0x0
.equ	USB_ADDR_ENDP7_ENDPOINT_BITS, 0x000f0000
.equ	USB_ADDR_ENDP7_ENDPOINT_MSB, 19
.equ	USB_ADDR_ENDP7_ENDPOINT_LSB, 16
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP7_ADDRESS
# Description : Device address
.equ	USB_ADDR_ENDP7_ADDRESS_RESET, 0x00
.equ	USB_ADDR_ENDP7_ADDRESS_BITS, 0x0000007f
.equ	USB_ADDR_ENDP7_ADDRESS_MSB, 6
.equ	USB_ADDR_ENDP7_ADDRESS_LSB, 0
# =============================================================================
# Register    : USB_ADDR_ENDP8
# Description : Interrupt endpoint 8. Only valid for HOST mode.
.equ	USB_ADDR_ENDP8_OFFSET, 0x00000020
.equ	USB_ADDR_ENDP8_BITS, 0x060f007f
.equ	USB_ADDR_ENDP8_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP8_INTEP_PREAMBLE
# Description : Interrupt EP requires preamble (is a low speed device on a full
#               speed hub)
.equ	USB_ADDR_ENDP8_INTEP_PREAMBLE_RESET, 0x0
.equ	USB_ADDR_ENDP8_INTEP_PREAMBLE_BITS, 0x04000000
.equ	USB_ADDR_ENDP8_INTEP_PREAMBLE_MSB, 26
.equ	USB_ADDR_ENDP8_INTEP_PREAMBLE_LSB, 26
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP8_INTEP_DIR
# Description : Direction of the interrupt endpoint. In=0, Out=1
.equ	USB_ADDR_ENDP8_INTEP_DIR_RESET, 0x0
.equ	USB_ADDR_ENDP8_INTEP_DIR_BITS, 0x02000000
.equ	USB_ADDR_ENDP8_INTEP_DIR_MSB, 25
.equ	USB_ADDR_ENDP8_INTEP_DIR_LSB, 25
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP8_ENDPOINT
# Description : Endpoint number of the interrupt endpoint
.equ	USB_ADDR_ENDP8_ENDPOINT_RESET, 0x0
.equ	USB_ADDR_ENDP8_ENDPOINT_BITS, 0x000f0000
.equ	USB_ADDR_ENDP8_ENDPOINT_MSB, 19
.equ	USB_ADDR_ENDP8_ENDPOINT_LSB, 16
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP8_ADDRESS
# Description : Device address
.equ	USB_ADDR_ENDP8_ADDRESS_RESET, 0x00
.equ	USB_ADDR_ENDP8_ADDRESS_BITS, 0x0000007f
.equ	USB_ADDR_ENDP8_ADDRESS_MSB, 6
.equ	USB_ADDR_ENDP8_ADDRESS_LSB, 0
# =============================================================================
# Register    : USB_ADDR_ENDP9
# Description : Interrupt endpoint 9. Only valid for HOST mode.
.equ	USB_ADDR_ENDP9_OFFSET, 0x00000024
.equ	USB_ADDR_ENDP9_BITS, 0x060f007f
.equ	USB_ADDR_ENDP9_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP9_INTEP_PREAMBLE
# Description : Interrupt EP requires preamble (is a low speed device on a full
#               speed hub)
.equ	USB_ADDR_ENDP9_INTEP_PREAMBLE_RESET, 0x0
.equ	USB_ADDR_ENDP9_INTEP_PREAMBLE_BITS, 0x04000000
.equ	USB_ADDR_ENDP9_INTEP_PREAMBLE_MSB, 26
.equ	USB_ADDR_ENDP9_INTEP_PREAMBLE_LSB, 26
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP9_INTEP_DIR
# Description : Direction of the interrupt endpoint. In=0, Out=1
.equ	USB_ADDR_ENDP9_INTEP_DIR_RESET, 0x0
.equ	USB_ADDR_ENDP9_INTEP_DIR_BITS, 0x02000000
.equ	USB_ADDR_ENDP9_INTEP_DIR_MSB, 25
.equ	USB_ADDR_ENDP9_INTEP_DIR_LSB, 25
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP9_ENDPOINT
# Description : Endpoint number of the interrupt endpoint
.equ	USB_ADDR_ENDP9_ENDPOINT_RESET, 0x0
.equ	USB_ADDR_ENDP9_ENDPOINT_BITS, 0x000f0000
.equ	USB_ADDR_ENDP9_ENDPOINT_MSB, 19
.equ	USB_ADDR_ENDP9_ENDPOINT_LSB, 16
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP9_ADDRESS
# Description : Device address
.equ	USB_ADDR_ENDP9_ADDRESS_RESET, 0x00
.equ	USB_ADDR_ENDP9_ADDRESS_BITS, 0x0000007f
.equ	USB_ADDR_ENDP9_ADDRESS_MSB, 6
.equ	USB_ADDR_ENDP9_ADDRESS_LSB, 0
# =============================================================================
# Register    : USB_ADDR_ENDP10
# Description : Interrupt endpoint 10. Only valid for HOST mode.
.equ	USB_ADDR_ENDP10_OFFSET, 0x00000028
.equ	USB_ADDR_ENDP10_BITS, 0x060f007f
.equ	USB_ADDR_ENDP10_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP10_INTEP_PREAMBLE
# Description : Interrupt EP requires preamble (is a low speed device on a full
#               speed hub)
.equ	USB_ADDR_ENDP10_INTEP_PREAMBLE_RESET, 0x0
.equ	USB_ADDR_ENDP10_INTEP_PREAMBLE_BITS, 0x04000000
.equ	USB_ADDR_ENDP10_INTEP_PREAMBLE_MSB, 26
.equ	USB_ADDR_ENDP10_INTEP_PREAMBLE_LSB, 26
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP10_INTEP_DIR
# Description : Direction of the interrupt endpoint. In=0, Out=1
.equ	USB_ADDR_ENDP10_INTEP_DIR_RESET, 0x0
.equ	USB_ADDR_ENDP10_INTEP_DIR_BITS, 0x02000000
.equ	USB_ADDR_ENDP10_INTEP_DIR_MSB, 25
.equ	USB_ADDR_ENDP10_INTEP_DIR_LSB, 25
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP10_ENDPOINT
# Description : Endpoint number of the interrupt endpoint
.equ	USB_ADDR_ENDP10_ENDPOINT_RESET, 0x0
.equ	USB_ADDR_ENDP10_ENDPOINT_BITS, 0x000f0000
.equ	USB_ADDR_ENDP10_ENDPOINT_MSB, 19
.equ	USB_ADDR_ENDP10_ENDPOINT_LSB, 16
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP10_ADDRESS
# Description : Device address
.equ	USB_ADDR_ENDP10_ADDRESS_RESET, 0x00
.equ	USB_ADDR_ENDP10_ADDRESS_BITS, 0x0000007f
.equ	USB_ADDR_ENDP10_ADDRESS_MSB, 6
.equ	USB_ADDR_ENDP10_ADDRESS_LSB, 0
# =============================================================================
# Register    : USB_ADDR_ENDP11
# Description : Interrupt endpoint 11. Only valid for HOST mode.
.equ	USB_ADDR_ENDP11_OFFSET, 0x0000002c
.equ	USB_ADDR_ENDP11_BITS, 0x060f007f
.equ	USB_ADDR_ENDP11_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP11_INTEP_PREAMBLE
# Description : Interrupt EP requires preamble (is a low speed device on a full
#               speed hub)
.equ	USB_ADDR_ENDP11_INTEP_PREAMBLE_RESET, 0x0
.equ	USB_ADDR_ENDP11_INTEP_PREAMBLE_BITS, 0x04000000
.equ	USB_ADDR_ENDP11_INTEP_PREAMBLE_MSB, 26
.equ	USB_ADDR_ENDP11_INTEP_PREAMBLE_LSB, 26
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP11_INTEP_DIR
# Description : Direction of the interrupt endpoint. In=0, Out=1
.equ	USB_ADDR_ENDP11_INTEP_DIR_RESET, 0x0
.equ	USB_ADDR_ENDP11_INTEP_DIR_BITS, 0x02000000
.equ	USB_ADDR_ENDP11_INTEP_DIR_MSB, 25
.equ	USB_ADDR_ENDP11_INTEP_DIR_LSB, 25
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP11_ENDPOINT
# Description : Endpoint number of the interrupt endpoint
.equ	USB_ADDR_ENDP11_ENDPOINT_RESET, 0x0
.equ	USB_ADDR_ENDP11_ENDPOINT_BITS, 0x000f0000
.equ	USB_ADDR_ENDP11_ENDPOINT_MSB, 19
.equ	USB_ADDR_ENDP11_ENDPOINT_LSB, 16
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP11_ADDRESS
# Description : Device address
.equ	USB_ADDR_ENDP11_ADDRESS_RESET, 0x00
.equ	USB_ADDR_ENDP11_ADDRESS_BITS, 0x0000007f
.equ	USB_ADDR_ENDP11_ADDRESS_MSB, 6
.equ	USB_ADDR_ENDP11_ADDRESS_LSB, 0
# =============================================================================
# Register    : USB_ADDR_ENDP12
# Description : Interrupt endpoint 12. Only valid for HOST mode.
.equ	USB_ADDR_ENDP12_OFFSET, 0x00000030
.equ	USB_ADDR_ENDP12_BITS, 0x060f007f
.equ	USB_ADDR_ENDP12_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP12_INTEP_PREAMBLE
# Description : Interrupt EP requires preamble (is a low speed device on a full
#               speed hub)
.equ	USB_ADDR_ENDP12_INTEP_PREAMBLE_RESET, 0x0
.equ	USB_ADDR_ENDP12_INTEP_PREAMBLE_BITS, 0x04000000
.equ	USB_ADDR_ENDP12_INTEP_PREAMBLE_MSB, 26
.equ	USB_ADDR_ENDP12_INTEP_PREAMBLE_LSB, 26
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP12_INTEP_DIR
# Description : Direction of the interrupt endpoint. In=0, Out=1
.equ	USB_ADDR_ENDP12_INTEP_DIR_RESET, 0x0
.equ	USB_ADDR_ENDP12_INTEP_DIR_BITS, 0x02000000
.equ	USB_ADDR_ENDP12_INTEP_DIR_MSB, 25
.equ	USB_ADDR_ENDP12_INTEP_DIR_LSB, 25
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP12_ENDPOINT
# Description : Endpoint number of the interrupt endpoint
.equ	USB_ADDR_ENDP12_ENDPOINT_RESET, 0x0
.equ	USB_ADDR_ENDP12_ENDPOINT_BITS, 0x000f0000
.equ	USB_ADDR_ENDP12_ENDPOINT_MSB, 19
.equ	USB_ADDR_ENDP12_ENDPOINT_LSB, 16
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP12_ADDRESS
# Description : Device address
.equ	USB_ADDR_ENDP12_ADDRESS_RESET, 0x00
.equ	USB_ADDR_ENDP12_ADDRESS_BITS, 0x0000007f
.equ	USB_ADDR_ENDP12_ADDRESS_MSB, 6
.equ	USB_ADDR_ENDP12_ADDRESS_LSB, 0
# =============================================================================
# Register    : USB_ADDR_ENDP13
# Description : Interrupt endpoint 13. Only valid for HOST mode.
.equ	USB_ADDR_ENDP13_OFFSET, 0x00000034
.equ	USB_ADDR_ENDP13_BITS, 0x060f007f
.equ	USB_ADDR_ENDP13_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP13_INTEP_PREAMBLE
# Description : Interrupt EP requires preamble (is a low speed device on a full
#               speed hub)
.equ	USB_ADDR_ENDP13_INTEP_PREAMBLE_RESET, 0x0
.equ	USB_ADDR_ENDP13_INTEP_PREAMBLE_BITS, 0x04000000
.equ	USB_ADDR_ENDP13_INTEP_PREAMBLE_MSB, 26
.equ	USB_ADDR_ENDP13_INTEP_PREAMBLE_LSB, 26
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP13_INTEP_DIR
# Description : Direction of the interrupt endpoint. In=0, Out=1
.equ	USB_ADDR_ENDP13_INTEP_DIR_RESET, 0x0
.equ	USB_ADDR_ENDP13_INTEP_DIR_BITS, 0x02000000
.equ	USB_ADDR_ENDP13_INTEP_DIR_MSB, 25
.equ	USB_ADDR_ENDP13_INTEP_DIR_LSB, 25
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP13_ENDPOINT
# Description : Endpoint number of the interrupt endpoint
.equ	USB_ADDR_ENDP13_ENDPOINT_RESET, 0x0
.equ	USB_ADDR_ENDP13_ENDPOINT_BITS, 0x000f0000
.equ	USB_ADDR_ENDP13_ENDPOINT_MSB, 19
.equ	USB_ADDR_ENDP13_ENDPOINT_LSB, 16
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP13_ADDRESS
# Description : Device address
.equ	USB_ADDR_ENDP13_ADDRESS_RESET, 0x00
.equ	USB_ADDR_ENDP13_ADDRESS_BITS, 0x0000007f
.equ	USB_ADDR_ENDP13_ADDRESS_MSB, 6
.equ	USB_ADDR_ENDP13_ADDRESS_LSB, 0
# =============================================================================
# Register    : USB_ADDR_ENDP14
