konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/usb.inc
# Description : Interrupt endpoint 14. Only valid for HOST mode.
.equ	USB_ADDR_ENDP14_OFFSET, 0x00000038
.equ	USB_ADDR_ENDP14_BITS, 0x060f007f
.equ	USB_ADDR_ENDP14_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP14_INTEP_PREAMBLE
# Description : Interrupt EP requires preamble (is a low speed device on a full
#               speed hub)
.equ	USB_ADDR_ENDP14_INTEP_PREAMBLE_RESET, 0x0
.equ	USB_ADDR_ENDP14_INTEP_PREAMBLE_BITS, 0x04000000
.equ	USB_ADDR_ENDP14_INTEP_PREAMBLE_MSB, 26
.equ	USB_ADDR_ENDP14_INTEP_PREAMBLE_LSB, 26
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP14_INTEP_DIR
# Description : Direction of the interrupt endpoint. In=0, Out=1
.equ	USB_ADDR_ENDP14_INTEP_DIR_RESET, 0x0
.equ	USB_ADDR_ENDP14_INTEP_DIR_BITS, 0x02000000
.equ	USB_ADDR_ENDP14_INTEP_DIR_MSB, 25
.equ	USB_ADDR_ENDP14_INTEP_DIR_LSB, 25
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP14_ENDPOINT
# Description : Endpoint number of the interrupt endpoint
.equ	USB_ADDR_ENDP14_ENDPOINT_RESET, 0x0
.equ	USB_ADDR_ENDP14_ENDPOINT_BITS, 0x000f0000
.equ	USB_ADDR_ENDP14_ENDPOINT_MSB, 19
.equ	USB_ADDR_ENDP14_ENDPOINT_LSB, 16
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP14_ADDRESS
# Description : Device address
.equ	USB_ADDR_ENDP14_ADDRESS_RESET, 0x00
.equ	USB_ADDR_ENDP14_ADDRESS_BITS, 0x0000007f
.equ	USB_ADDR_ENDP14_ADDRESS_MSB, 6
.equ	USB_ADDR_ENDP14_ADDRESS_LSB, 0
# =============================================================================
# Register    : USB_ADDR_ENDP15
# Description : Interrupt endpoint 15. Only valid for HOST mode.
.equ	USB_ADDR_ENDP15_OFFSET, 0x0000003c
.equ	USB_ADDR_ENDP15_BITS, 0x060f007f
.equ	USB_ADDR_ENDP15_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP15_INTEP_PREAMBLE
# Description : Interrupt EP requires preamble (is a low speed device on a full
#               speed hub)
.equ	USB_ADDR_ENDP15_INTEP_PREAMBLE_RESET, 0x0
.equ	USB_ADDR_ENDP15_INTEP_PREAMBLE_BITS, 0x04000000
.equ	USB_ADDR_ENDP15_INTEP_PREAMBLE_MSB, 26
.equ	USB_ADDR_ENDP15_INTEP_PREAMBLE_LSB, 26
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP15_INTEP_DIR
# Description : Direction of the interrupt endpoint. In=0, Out=1
.equ	USB_ADDR_ENDP15_INTEP_DIR_RESET, 0x0
.equ	USB_ADDR_ENDP15_INTEP_DIR_BITS, 0x02000000
.equ	USB_ADDR_ENDP15_INTEP_DIR_MSB, 25
.equ	USB_ADDR_ENDP15_INTEP_DIR_LSB, 25
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP15_ENDPOINT
# Description : Endpoint number of the interrupt endpoint
.equ	USB_ADDR_ENDP15_ENDPOINT_RESET, 0x0
.equ	USB_ADDR_ENDP15_ENDPOINT_BITS, 0x000f0000
.equ	USB_ADDR_ENDP15_ENDPOINT_MSB, 19
.equ	USB_ADDR_ENDP15_ENDPOINT_LSB, 16
# -----------------------------------------------------------------------------
# Field       : USB_ADDR_ENDP15_ADDRESS
# Description : Device address
.equ	USB_ADDR_ENDP15_ADDRESS_RESET, 0x00
.equ	USB_ADDR_ENDP15_ADDRESS_BITS, 0x0000007f
.equ	USB_ADDR_ENDP15_ADDRESS_MSB, 6
.equ	USB_ADDR_ENDP15_ADDRESS_LSB, 0
# =============================================================================
# Register    : USB_MAIN_CTRL
# Description : Main control register
.equ	USB_MAIN_CTRL_OFFSET, 0x00000040
.equ	USB_MAIN_CTRL_BITS, 0x80000007
.equ	USB_MAIN_CTRL_RESET, 0x00000004
# -----------------------------------------------------------------------------
# Field       : USB_MAIN_CTRL_SIM_TIMING
# Description : Reduced timings for simulation
.equ	USB_MAIN_CTRL_SIM_TIMING_RESET, 0x0
.equ	USB_MAIN_CTRL_SIM_TIMING_BITS, 0x80000000
.equ	USB_MAIN_CTRL_SIM_TIMING_MSB, 31
.equ	USB_MAIN_CTRL_SIM_TIMING_LSB, 31
# -----------------------------------------------------------------------------
# Field       : USB_MAIN_CTRL_PHY_ISO
# Description : Isolates USB phy after controller power-up
#               Remove isolation once software has configured the controller
#               Not isolated = 0, Isolated = 1
.equ	USB_MAIN_CTRL_PHY_ISO_RESET, 0x1
.equ	USB_MAIN_CTRL_PHY_ISO_BITS, 0x00000004
.equ	USB_MAIN_CTRL_PHY_ISO_MSB, 2
.equ	USB_MAIN_CTRL_PHY_ISO_LSB, 2
# -----------------------------------------------------------------------------
# Field       : USB_MAIN_CTRL_HOST_NDEVICE
# Description : Device mode = 0, Host mode = 1
.equ	USB_MAIN_CTRL_HOST_NDEVICE_RESET, 0x0
.equ	USB_MAIN_CTRL_HOST_NDEVICE_BITS, 0x00000002
.equ	USB_MAIN_CTRL_HOST_NDEVICE_MSB, 1
.equ	USB_MAIN_CTRL_HOST_NDEVICE_LSB, 1
# -----------------------------------------------------------------------------
# Field       : USB_MAIN_CTRL_CONTROLLER_EN
# Description : Enable controller
.equ	USB_MAIN_CTRL_CONTROLLER_EN_RESET, 0x0
.equ	USB_MAIN_CTRL_CONTROLLER_EN_BITS, 0x00000001
.equ	USB_MAIN_CTRL_CONTROLLER_EN_MSB, 0
.equ	USB_MAIN_CTRL_CONTROLLER_EN_LSB, 0
# =============================================================================
# Register    : USB_SOF_WR
# Description : Set the SOF (Start of Frame) frame number in the host
#               controller. The SOF packet is sent every 1ms and the host will
#               increment the frame number by 1 each time.
.equ	USB_SOF_WR_OFFSET, 0x00000044
.equ	USB_SOF_WR_BITS, 0x000007ff
.equ	USB_SOF_WR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_SOF_WR_COUNT
.equ	USB_SOF_WR_COUNT_RESET, 0x000
.equ	USB_SOF_WR_COUNT_BITS, 0x000007ff
.equ	USB_SOF_WR_COUNT_MSB, 10
.equ	USB_SOF_WR_COUNT_LSB, 0
# =============================================================================
# Register    : USB_SOF_RD
# Description : Read the last SOF (Start of Frame) frame number seen. In device
#               mode the last SOF received from the host. In host mode the last
#               SOF sent by the host.
.equ	USB_SOF_RD_OFFSET, 0x00000048
.equ	USB_SOF_RD_BITS, 0x000007ff
.equ	USB_SOF_RD_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_SOF_RD_COUNT
.equ	USB_SOF_RD_COUNT_RESET, 0x000
.equ	USB_SOF_RD_COUNT_BITS, 0x000007ff
.equ	USB_SOF_RD_COUNT_MSB, 10
.equ	USB_SOF_RD_COUNT_LSB, 0
# =============================================================================
# Register    : USB_SIE_CTRL
# Description : SIE control register
.equ	USB_SIE_CTRL_OFFSET, 0x0000004c
.equ	USB_SIE_CTRL_BITS, 0xff0fbf5f
.equ	USB_SIE_CTRL_RESET, 0x00008000
# -----------------------------------------------------------------------------
# Field       : USB_SIE_CTRL_EP0_INT_STALL
# Description : Device: Set bit in EP_STATUS_STALL_NAK when EP0 sends a STALL
.equ	USB_SIE_CTRL_EP0_INT_STALL_RESET, 0x0
.equ	USB_SIE_CTRL_EP0_INT_STALL_BITS, 0x80000000
.equ	USB_SIE_CTRL_EP0_INT_STALL_MSB, 31
.equ	USB_SIE_CTRL_EP0_INT_STALL_LSB, 31
# -----------------------------------------------------------------------------
# Field       : USB_SIE_CTRL_EP0_DOUBLE_BUF
# Description : Device: EP0 single buffered = 0, double buffered = 1
.equ	USB_SIE_CTRL_EP0_DOUBLE_BUF_RESET, 0x0
.equ	USB_SIE_CTRL_EP0_DOUBLE_BUF_BITS, 0x40000000
.equ	USB_SIE_CTRL_EP0_DOUBLE_BUF_MSB, 30
.equ	USB_SIE_CTRL_EP0_DOUBLE_BUF_LSB, 30
# -----------------------------------------------------------------------------
# Field       : USB_SIE_CTRL_EP0_INT_1BUF
# Description : Device: Set bit in BUFF_STATUS for every buffer completed on
#               EP0
.equ	USB_SIE_CTRL_EP0_INT_1BUF_RESET, 0x0
.equ	USB_SIE_CTRL_EP0_INT_1BUF_BITS, 0x20000000
.equ	USB_SIE_CTRL_EP0_INT_1BUF_MSB, 29
.equ	USB_SIE_CTRL_EP0_INT_1BUF_LSB, 29
# -----------------------------------------------------------------------------
# Field       : USB_SIE_CTRL_EP0_INT_2BUF
# Description : Device: Set bit in BUFF_STATUS for every 2 buffers completed on
#               EP0
.equ	USB_SIE_CTRL_EP0_INT_2BUF_RESET, 0x0
.equ	USB_SIE_CTRL_EP0_INT_2BUF_BITS, 0x10000000
.equ	USB_SIE_CTRL_EP0_INT_2BUF_MSB, 28
.equ	USB_SIE_CTRL_EP0_INT_2BUF_LSB, 28
# -----------------------------------------------------------------------------
# Field       : USB_SIE_CTRL_EP0_INT_NAK
# Description : Device: Set bit in EP_STATUS_STALL_NAK when EP0 sends a NAK
.equ	USB_SIE_CTRL_EP0_INT_NAK_RESET, 0x0
.equ	USB_SIE_CTRL_EP0_INT_NAK_BITS, 0x08000000
.equ	USB_SIE_CTRL_EP0_INT_NAK_MSB, 27
.equ	USB_SIE_CTRL_EP0_INT_NAK_LSB, 27
# -----------------------------------------------------------------------------
# Field       : USB_SIE_CTRL_DIRECT_EN
# Description : Direct bus drive enable
.equ	USB_SIE_CTRL_DIRECT_EN_RESET, 0x0
.equ	USB_SIE_CTRL_DIRECT_EN_BITS, 0x04000000
.equ	USB_SIE_CTRL_DIRECT_EN_MSB, 26
.equ	USB_SIE_CTRL_DIRECT_EN_LSB, 26
# -----------------------------------------------------------------------------
# Field       : USB_SIE_CTRL_DIRECT_DP
# Description : Direct control of DP
.equ	USB_SIE_CTRL_DIRECT_DP_RESET, 0x0
.equ	USB_SIE_CTRL_DIRECT_DP_BITS, 0x02000000
.equ	USB_SIE_CTRL_DIRECT_DP_MSB, 25
.equ	USB_SIE_CTRL_DIRECT_DP_LSB, 25
# -----------------------------------------------------------------------------
# Field       : USB_SIE_CTRL_DIRECT_DM
# Description : Direct control of DM
.equ	USB_SIE_CTRL_DIRECT_DM_RESET, 0x0
.equ	USB_SIE_CTRL_DIRECT_DM_BITS, 0x01000000
.equ	USB_SIE_CTRL_DIRECT_DM_MSB, 24
.equ	USB_SIE_CTRL_DIRECT_DM_LSB, 24
# -----------------------------------------------------------------------------
# Field       : USB_SIE_CTRL_EP0_STOP_ON_SHORT_PACKET
# Description : Device: Stop EP0 on a short packet.
.equ	USB_SIE_CTRL_EP0_STOP_ON_SHORT_PACKET_RESET, 0x0
.equ	USB_SIE_CTRL_EP0_STOP_ON_SHORT_PACKET_BITS, 0x00080000
.equ	USB_SIE_CTRL_EP0_STOP_ON_SHORT_PACKET_MSB, 19
.equ	USB_SIE_CTRL_EP0_STOP_ON_SHORT_PACKET_LSB, 19
# -----------------------------------------------------------------------------
# Field       : USB_SIE_CTRL_TRANSCEIVER_PD
# Description : Power down bus transceiver
.equ	USB_SIE_CTRL_TRANSCEIVER_PD_RESET, 0x0
.equ	USB_SIE_CTRL_TRANSCEIVER_PD_BITS, 0x00040000
.equ	USB_SIE_CTRL_TRANSCEIVER_PD_MSB, 18
.equ	USB_SIE_CTRL_TRANSCEIVER_PD_LSB, 18
# -----------------------------------------------------------------------------
# Field       : USB_SIE_CTRL_RPU_OPT
# Description : Device: Pull-up strength (0=1K2, 1=2k3)
.equ	USB_SIE_CTRL_RPU_OPT_RESET, 0x0
.equ	USB_SIE_CTRL_RPU_OPT_BITS, 0x00020000
.equ	USB_SIE_CTRL_RPU_OPT_MSB, 17
.equ	USB_SIE_CTRL_RPU_OPT_LSB, 17
# -----------------------------------------------------------------------------
# Field       : USB_SIE_CTRL_PULLUP_EN
# Description : Device: Enable pull up resistor
.equ	USB_SIE_CTRL_PULLUP_EN_RESET, 0x0
.equ	USB_SIE_CTRL_PULLUP_EN_BITS, 0x00010000
.equ	USB_SIE_CTRL_PULLUP_EN_MSB, 16
.equ	USB_SIE_CTRL_PULLUP_EN_LSB, 16
# -----------------------------------------------------------------------------
# Field       : USB_SIE_CTRL_PULLDOWN_EN
# Description : Host: Enable pull down resistors
.equ	USB_SIE_CTRL_PULLDOWN_EN_RESET, 0x1
.equ	USB_SIE_CTRL_PULLDOWN_EN_BITS, 0x00008000
.equ	USB_SIE_CTRL_PULLDOWN_EN_MSB, 15
.equ	USB_SIE_CTRL_PULLDOWN_EN_LSB, 15
# -----------------------------------------------------------------------------
# Field       : USB_SIE_CTRL_RESET_BUS
# Description : Host: Reset bus
.equ	USB_SIE_CTRL_RESET_BUS_RESET, 0x0
.equ	USB_SIE_CTRL_RESET_BUS_BITS, 0x00002000
.equ	USB_SIE_CTRL_RESET_BUS_MSB, 13
.equ	USB_SIE_CTRL_RESET_BUS_LSB, 13
# -----------------------------------------------------------------------------
# Field       : USB_SIE_CTRL_RESUME
# Description : Device: Remote wakeup. Device can initiate its own resume after
#               suspend.
.equ	USB_SIE_CTRL_RESUME_RESET, 0x0
.equ	USB_SIE_CTRL_RESUME_BITS, 0x00001000
.equ	USB_SIE_CTRL_RESUME_MSB, 12
.equ	USB_SIE_CTRL_RESUME_LSB, 12
# -----------------------------------------------------------------------------
# Field       : USB_SIE_CTRL_VBUS_EN
# Description : Host: Enable VBUS
.equ	USB_SIE_CTRL_VBUS_EN_RESET, 0x0
.equ	USB_SIE_CTRL_VBUS_EN_BITS, 0x00000800
.equ	USB_SIE_CTRL_VBUS_EN_MSB, 11
.equ	USB_SIE_CTRL_VBUS_EN_LSB, 11
# -----------------------------------------------------------------------------
# Field       : USB_SIE_CTRL_KEEP_ALIVE_EN
# Description : Host: Enable keep alive packet (for low speed bus)
.equ	USB_SIE_CTRL_KEEP_ALIVE_EN_RESET, 0x0
.equ	USB_SIE_CTRL_KEEP_ALIVE_EN_BITS, 0x00000400
.equ	USB_SIE_CTRL_KEEP_ALIVE_EN_MSB, 10
.equ	USB_SIE_CTRL_KEEP_ALIVE_EN_LSB, 10
# -----------------------------------------------------------------------------
# Field       : USB_SIE_CTRL_SOF_EN
# Description : Host: Enable SOF generation (for full speed bus)
.equ	USB_SIE_CTRL_SOF_EN_RESET, 0x0
.equ	USB_SIE_CTRL_SOF_EN_BITS, 0x00000200
.equ	USB_SIE_CTRL_SOF_EN_MSB, 9
.equ	USB_SIE_CTRL_SOF_EN_LSB, 9
# -----------------------------------------------------------------------------
# Field       : USB_SIE_CTRL_SOF_SYNC
# Description : Host: Delay packet(s) until after SOF
.equ	USB_SIE_CTRL_SOF_SYNC_RESET, 0x0
.equ	USB_SIE_CTRL_SOF_SYNC_BITS, 0x00000100
.equ	USB_SIE_CTRL_SOF_SYNC_MSB, 8
.equ	USB_SIE_CTRL_SOF_SYNC_LSB, 8
# -----------------------------------------------------------------------------
# Field       : USB_SIE_CTRL_PREAMBLE_EN
# Description : Host: Preable enable for LS device on FS hub
.equ	USB_SIE_CTRL_PREAMBLE_EN_RESET, 0x0
.equ	USB_SIE_CTRL_PREAMBLE_EN_BITS, 0x00000040
.equ	USB_SIE_CTRL_PREAMBLE_EN_MSB, 6
.equ	USB_SIE_CTRL_PREAMBLE_EN_LSB, 6
# -----------------------------------------------------------------------------
# Field       : USB_SIE_CTRL_STOP_TRANS
# Description : Host: Stop transaction
.equ	USB_SIE_CTRL_STOP_TRANS_RESET, 0x0
.equ	USB_SIE_CTRL_STOP_TRANS_BITS, 0x00000010
.equ	USB_SIE_CTRL_STOP_TRANS_MSB, 4
.equ	USB_SIE_CTRL_STOP_TRANS_LSB, 4
# -----------------------------------------------------------------------------
# Field       : USB_SIE_CTRL_RECEIVE_DATA
# Description : Host: Receive transaction (IN to host)
.equ	USB_SIE_CTRL_RECEIVE_DATA_RESET, 0x0
.equ	USB_SIE_CTRL_RECEIVE_DATA_BITS, 0x00000008
.equ	USB_SIE_CTRL_RECEIVE_DATA_MSB, 3
.equ	USB_SIE_CTRL_RECEIVE_DATA_LSB, 3
# -----------------------------------------------------------------------------
# Field       : USB_SIE_CTRL_SEND_DATA
# Description : Host: Send transaction (OUT from host)
.equ	USB_SIE_CTRL_SEND_DATA_RESET, 0x0
.equ	USB_SIE_CTRL_SEND_DATA_BITS, 0x00000004
.equ	USB_SIE_CTRL_SEND_DATA_MSB, 2
.equ	USB_SIE_CTRL_SEND_DATA_LSB, 2
# -----------------------------------------------------------------------------
# Field       : USB_SIE_CTRL_SEND_SETUP
# Description : Host: Send Setup packet
.equ	USB_SIE_CTRL_SEND_SETUP_RESET, 0x0
.equ	USB_SIE_CTRL_SEND_SETUP_BITS, 0x00000002
.equ	USB_SIE_CTRL_SEND_SETUP_MSB, 1
.equ	USB_SIE_CTRL_SEND_SETUP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : USB_SIE_CTRL_START_TRANS
# Description : Host: Start transaction
.equ	USB_SIE_CTRL_START_TRANS_RESET, 0x0
.equ	USB_SIE_CTRL_START_TRANS_BITS, 0x00000001
.equ	USB_SIE_CTRL_START_TRANS_MSB, 0
.equ	USB_SIE_CTRL_START_TRANS_LSB, 0
# =============================================================================
# Register    : USB_SIE_STATUS
# Description : SIE status register
.equ	USB_SIE_STATUS_OFFSET, 0x00000050
.equ	USB_SIE_STATUS_BITS, 0xff8f1f1d
.equ	USB_SIE_STATUS_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_SIE_STATUS_DATA_SEQ_ERROR
# Description : Data Sequence Error.
#
#               The device can raise a sequence error in the following
#               conditions:
#
#               * A SETUP packet is received followed by a DATA1 packet (data
#               phase should always be DATA0) * An OUT packet is received from
#               the host but doesn't match the data pid in the buffer control
#               register read from DPSRAM
#
#               The host can raise a data sequence error in the following
#               conditions:
#
#               * An IN packet from the device has the wrong data PID
.equ	USB_SIE_STATUS_DATA_SEQ_ERROR_RESET, 0x0
.equ	USB_SIE_STATUS_DATA_SEQ_ERROR_BITS, 0x80000000
.equ	USB_SIE_STATUS_DATA_SEQ_ERROR_MSB, 31
.equ	USB_SIE_STATUS_DATA_SEQ_ERROR_LSB, 31
# -----------------------------------------------------------------------------
# Field       : USB_SIE_STATUS_ACK_REC
# Description : ACK received. Raised by both host and device.
.equ	USB_SIE_STATUS_ACK_REC_RESET, 0x0
.equ	USB_SIE_STATUS_ACK_REC_BITS, 0x40000000
.equ	USB_SIE_STATUS_ACK_REC_MSB, 30
.equ	USB_SIE_STATUS_ACK_REC_LSB, 30
# -----------------------------------------------------------------------------
# Field       : USB_SIE_STATUS_STALL_REC
# Description : Host: STALL received
.equ	USB_SIE_STATUS_STALL_REC_RESET, 0x0
.equ	USB_SIE_STATUS_STALL_REC_BITS, 0x20000000
.equ	USB_SIE_STATUS_STALL_REC_MSB, 29
.equ	USB_SIE_STATUS_STALL_REC_LSB, 29
# -----------------------------------------------------------------------------
# Field       : USB_SIE_STATUS_NAK_REC
# Description : Host: NAK received
.equ	USB_SIE_STATUS_NAK_REC_RESET, 0x0
.equ	USB_SIE_STATUS_NAK_REC_BITS, 0x10000000
.equ	USB_SIE_STATUS_NAK_REC_MSB, 28
.equ	USB_SIE_STATUS_NAK_REC_LSB, 28
# -----------------------------------------------------------------------------
# Field       : USB_SIE_STATUS_RX_TIMEOUT
# Description : RX timeout is raised by both the host and device if an ACK is
#               not received in the maximum time specified by the USB spec.
.equ	USB_SIE_STATUS_RX_TIMEOUT_RESET, 0x0
.equ	USB_SIE_STATUS_RX_TIMEOUT_BITS, 0x08000000
.equ	USB_SIE_STATUS_RX_TIMEOUT_MSB, 27
.equ	USB_SIE_STATUS_RX_TIMEOUT_LSB, 27
# -----------------------------------------------------------------------------
# Field       : USB_SIE_STATUS_RX_OVERFLOW
# Description : RX overflow is raised by the Serial RX engine if the incoming
#               data is too fast.
.equ	USB_SIE_STATUS_RX_OVERFLOW_RESET, 0x0
.equ	USB_SIE_STATUS_RX_OVERFLOW_BITS, 0x04000000
.equ	USB_SIE_STATUS_RX_OVERFLOW_MSB, 26
.equ	USB_SIE_STATUS_RX_OVERFLOW_LSB, 26
# -----------------------------------------------------------------------------
# Field       : USB_SIE_STATUS_BIT_STUFF_ERROR
# Description : Bit Stuff Error. Raised by the Serial RX engine.
.equ	USB_SIE_STATUS_BIT_STUFF_ERROR_RESET, 0x0
.equ	USB_SIE_STATUS_BIT_STUFF_ERROR_BITS, 0x02000000
.equ	USB_SIE_STATUS_BIT_STUFF_ERROR_MSB, 25
.equ	USB_SIE_STATUS_BIT_STUFF_ERROR_LSB, 25
# -----------------------------------------------------------------------------
# Field       : USB_SIE_STATUS_CRC_ERROR
# Description : CRC Error. Raised by the Serial RX engine.
.equ	USB_SIE_STATUS_CRC_ERROR_RESET, 0x0
.equ	USB_SIE_STATUS_CRC_ERROR_BITS, 0x01000000
.equ	USB_SIE_STATUS_CRC_ERROR_MSB, 24
.equ	USB_SIE_STATUS_CRC_ERROR_LSB, 24
# -----------------------------------------------------------------------------
# Field       : USB_SIE_STATUS_ENDPOINT_ERROR
# Description : An endpoint has encountered an error. Read the ep_rx_error and
#               ep_tx_error registers to find out which endpoint had an error.
.equ	USB_SIE_STATUS_ENDPOINT_ERROR_RESET, 0x0
.equ	USB_SIE_STATUS_ENDPOINT_ERROR_BITS, 0x00800000
.equ	USB_SIE_STATUS_ENDPOINT_ERROR_MSB, 23
.equ	USB_SIE_STATUS_ENDPOINT_ERROR_LSB, 23
# -----------------------------------------------------------------------------
# Field       : USB_SIE_STATUS_BUS_RESET
# Description : Device: bus reset received
.equ	USB_SIE_STATUS_BUS_RESET_RESET, 0x0
.equ	USB_SIE_STATUS_BUS_RESET_BITS, 0x00080000
.equ	USB_SIE_STATUS_BUS_RESET_MSB, 19
.equ	USB_SIE_STATUS_BUS_RESET_LSB, 19
# -----------------------------------------------------------------------------
# Field       : USB_SIE_STATUS_TRANS_COMPLETE
# Description : Transaction complete.
#
#               Raised by device if:
#
#               * An IN or OUT packet is sent with the `LAST_BUFF` bit set in
#               the buffer control register
#
#               Raised by host if:
#
#               * A setup packet is sent when no data in or data out
#               transaction follows * An IN packet is received and the
#               `LAST_BUFF` bit is set in the buffer control register * An IN
#               packet is received with zero length * An OUT packet is sent and
#               the `LAST_BUFF` bit is set
.equ	USB_SIE_STATUS_TRANS_COMPLETE_RESET, 0x0
.equ	USB_SIE_STATUS_TRANS_COMPLETE_BITS, 0x00040000
.equ	USB_SIE_STATUS_TRANS_COMPLETE_MSB, 18
.equ	USB_SIE_STATUS_TRANS_COMPLETE_LSB, 18
# -----------------------------------------------------------------------------
# Field       : USB_SIE_STATUS_SETUP_REC
# Description : Device: Setup packet received
.equ	USB_SIE_STATUS_SETUP_REC_RESET, 0x0
.equ	USB_SIE_STATUS_SETUP_REC_BITS, 0x00020000
.equ	USB_SIE_STATUS_SETUP_REC_MSB, 17
.equ	USB_SIE_STATUS_SETUP_REC_LSB, 17
# -----------------------------------------------------------------------------
# Field       : USB_SIE_STATUS_CONNECTED
# Description : Device: connected
.equ	USB_SIE_STATUS_CONNECTED_RESET, 0x0
.equ	USB_SIE_STATUS_CONNECTED_BITS, 0x00010000
.equ	USB_SIE_STATUS_CONNECTED_MSB, 16
.equ	USB_SIE_STATUS_CONNECTED_LSB, 16
# -----------------------------------------------------------------------------
# Field       : USB_SIE_STATUS_RX_SHORT_PACKET
# Description : Device or Host has received a short packet. This is when the
#               data received is less than configured in the buffer control
#               register. Device: If using double buffered mode on device the
#               buffer select will not be toggled after writing status back to
#               the buffer control register. This is to prevent any further
#               transactions on that endpoint until the user has reset the
#               buffer control registers. Host: the current transfer will be
#               stopped early.
.equ	USB_SIE_STATUS_RX_SHORT_PACKET_RESET, 0x0
.equ	USB_SIE_STATUS_RX_SHORT_PACKET_BITS, 0x00001000
.equ	USB_SIE_STATUS_RX_SHORT_PACKET_MSB, 12
.equ	USB_SIE_STATUS_RX_SHORT_PACKET_LSB, 12
# -----------------------------------------------------------------------------
# Field       : USB_SIE_STATUS_RESUME
# Description : Host: Device has initiated a remote resume. Device: host has
#               initiated a resume.
.equ	USB_SIE_STATUS_RESUME_RESET, 0x0
.equ	USB_SIE_STATUS_RESUME_BITS, 0x00000800
.equ	USB_SIE_STATUS_RESUME_MSB, 11
.equ	USB_SIE_STATUS_RESUME_LSB, 11
# -----------------------------------------------------------------------------
# Field       : USB_SIE_STATUS_VBUS_OVER_CURR
# Description : VBUS over current detected
.equ	USB_SIE_STATUS_VBUS_OVER_CURR_RESET, 0x0
.equ	USB_SIE_STATUS_VBUS_OVER_CURR_BITS, 0x00000400
.equ	USB_SIE_STATUS_VBUS_OVER_CURR_MSB, 10
.equ	USB_SIE_STATUS_VBUS_OVER_CURR_LSB, 10
# -----------------------------------------------------------------------------
# Field       : USB_SIE_STATUS_SPEED
# Description : Host: device speed. Disconnected = 00, LS = 01, FS = 10
.equ	USB_SIE_STATUS_SPEED_RESET, 0x0
.equ	USB_SIE_STATUS_SPEED_BITS, 0x00000300
.equ	USB_SIE_STATUS_SPEED_MSB, 9
.equ	USB_SIE_STATUS_SPEED_LSB, 8
# -----------------------------------------------------------------------------
# Field       : USB_SIE_STATUS_SUSPENDED
# Description : Bus in suspended state. Valid for device. Device will go into
#               suspend if neither Keep Alive / SOF frames are enabled.
.equ	USB_SIE_STATUS_SUSPENDED_RESET, 0x0
.equ	USB_SIE_STATUS_SUSPENDED_BITS, 0x00000010
.equ	USB_SIE_STATUS_SUSPENDED_MSB, 4
.equ	USB_SIE_STATUS_SUSPENDED_LSB, 4
# -----------------------------------------------------------------------------
# Field       : USB_SIE_STATUS_LINE_STATE
# Description : USB bus line state
.equ	USB_SIE_STATUS_LINE_STATE_RESET, 0x0
.equ	USB_SIE_STATUS_LINE_STATE_BITS, 0x0000000c
.equ	USB_SIE_STATUS_LINE_STATE_MSB, 3
.equ	USB_SIE_STATUS_LINE_STATE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : USB_SIE_STATUS_VBUS_DETECTED
