konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/usb.inc
# Description : Device: VBUS Detected
.equ	USB_SIE_STATUS_VBUS_DETECTED_RESET, 0x0
.equ	USB_SIE_STATUS_VBUS_DETECTED_BITS, 0x00000001
.equ	USB_SIE_STATUS_VBUS_DETECTED_MSB, 0
.equ	USB_SIE_STATUS_VBUS_DETECTED_LSB, 0
# =============================================================================
# Register    : USB_INT_EP_CTRL
# Description : interrupt endpoint control register
.equ	USB_INT_EP_CTRL_OFFSET, 0x00000054
.equ	USB_INT_EP_CTRL_BITS, 0x0000fffe
.equ	USB_INT_EP_CTRL_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_INT_EP_CTRL_INT_EP_ACTIVE
# Description : Host: Enable interrupt endpoint 1 -> 15
.equ	USB_INT_EP_CTRL_INT_EP_ACTIVE_RESET, 0x0000
.equ	USB_INT_EP_CTRL_INT_EP_ACTIVE_BITS, 0x0000fffe
.equ	USB_INT_EP_CTRL_INT_EP_ACTIVE_MSB, 15
.equ	USB_INT_EP_CTRL_INT_EP_ACTIVE_LSB, 1
# =============================================================================
# Register    : USB_BUFF_STATUS
# Description : Buffer status register. A bit set here indicates that a buffer
#               has completed on the endpoint (if the buffer interrupt is
#               enabled). It is possible for 2 buffers to be completed, so
#               clearing the buffer status bit may instantly re set it on the
#               next clock cycle.
.equ	USB_BUFF_STATUS_OFFSET, 0x00000058
.equ	USB_BUFF_STATUS_BITS, 0xffffffff
.equ	USB_BUFF_STATUS_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_STATUS_EP15_OUT
.equ	USB_BUFF_STATUS_EP15_OUT_RESET, 0x0
.equ	USB_BUFF_STATUS_EP15_OUT_BITS, 0x80000000
.equ	USB_BUFF_STATUS_EP15_OUT_MSB, 31
.equ	USB_BUFF_STATUS_EP15_OUT_LSB, 31
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_STATUS_EP15_IN
.equ	USB_BUFF_STATUS_EP15_IN_RESET, 0x0
.equ	USB_BUFF_STATUS_EP15_IN_BITS, 0x40000000
.equ	USB_BUFF_STATUS_EP15_IN_MSB, 30
.equ	USB_BUFF_STATUS_EP15_IN_LSB, 30
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_STATUS_EP14_OUT
.equ	USB_BUFF_STATUS_EP14_OUT_RESET, 0x0
.equ	USB_BUFF_STATUS_EP14_OUT_BITS, 0x20000000
.equ	USB_BUFF_STATUS_EP14_OUT_MSB, 29
.equ	USB_BUFF_STATUS_EP14_OUT_LSB, 29
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_STATUS_EP14_IN
.equ	USB_BUFF_STATUS_EP14_IN_RESET, 0x0
.equ	USB_BUFF_STATUS_EP14_IN_BITS, 0x10000000
.equ	USB_BUFF_STATUS_EP14_IN_MSB, 28
.equ	USB_BUFF_STATUS_EP14_IN_LSB, 28
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_STATUS_EP13_OUT
.equ	USB_BUFF_STATUS_EP13_OUT_RESET, 0x0
.equ	USB_BUFF_STATUS_EP13_OUT_BITS, 0x08000000
.equ	USB_BUFF_STATUS_EP13_OUT_MSB, 27
.equ	USB_BUFF_STATUS_EP13_OUT_LSB, 27
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_STATUS_EP13_IN
.equ	USB_BUFF_STATUS_EP13_IN_RESET, 0x0
.equ	USB_BUFF_STATUS_EP13_IN_BITS, 0x04000000
.equ	USB_BUFF_STATUS_EP13_IN_MSB, 26
.equ	USB_BUFF_STATUS_EP13_IN_LSB, 26
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_STATUS_EP12_OUT
.equ	USB_BUFF_STATUS_EP12_OUT_RESET, 0x0
.equ	USB_BUFF_STATUS_EP12_OUT_BITS, 0x02000000
.equ	USB_BUFF_STATUS_EP12_OUT_MSB, 25
.equ	USB_BUFF_STATUS_EP12_OUT_LSB, 25
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_STATUS_EP12_IN
.equ	USB_BUFF_STATUS_EP12_IN_RESET, 0x0
.equ	USB_BUFF_STATUS_EP12_IN_BITS, 0x01000000
.equ	USB_BUFF_STATUS_EP12_IN_MSB, 24
.equ	USB_BUFF_STATUS_EP12_IN_LSB, 24
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_STATUS_EP11_OUT
.equ	USB_BUFF_STATUS_EP11_OUT_RESET, 0x0
.equ	USB_BUFF_STATUS_EP11_OUT_BITS, 0x00800000
.equ	USB_BUFF_STATUS_EP11_OUT_MSB, 23
.equ	USB_BUFF_STATUS_EP11_OUT_LSB, 23
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_STATUS_EP11_IN
.equ	USB_BUFF_STATUS_EP11_IN_RESET, 0x0
.equ	USB_BUFF_STATUS_EP11_IN_BITS, 0x00400000
.equ	USB_BUFF_STATUS_EP11_IN_MSB, 22
.equ	USB_BUFF_STATUS_EP11_IN_LSB, 22
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_STATUS_EP10_OUT
.equ	USB_BUFF_STATUS_EP10_OUT_RESET, 0x0
.equ	USB_BUFF_STATUS_EP10_OUT_BITS, 0x00200000
.equ	USB_BUFF_STATUS_EP10_OUT_MSB, 21
.equ	USB_BUFF_STATUS_EP10_OUT_LSB, 21
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_STATUS_EP10_IN
.equ	USB_BUFF_STATUS_EP10_IN_RESET, 0x0
.equ	USB_BUFF_STATUS_EP10_IN_BITS, 0x00100000
.equ	USB_BUFF_STATUS_EP10_IN_MSB, 20
.equ	USB_BUFF_STATUS_EP10_IN_LSB, 20
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_STATUS_EP9_OUT
.equ	USB_BUFF_STATUS_EP9_OUT_RESET, 0x0
.equ	USB_BUFF_STATUS_EP9_OUT_BITS, 0x00080000
.equ	USB_BUFF_STATUS_EP9_OUT_MSB, 19
.equ	USB_BUFF_STATUS_EP9_OUT_LSB, 19
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_STATUS_EP9_IN
.equ	USB_BUFF_STATUS_EP9_IN_RESET, 0x0
.equ	USB_BUFF_STATUS_EP9_IN_BITS, 0x00040000
.equ	USB_BUFF_STATUS_EP9_IN_MSB, 18
.equ	USB_BUFF_STATUS_EP9_IN_LSB, 18
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_STATUS_EP8_OUT
.equ	USB_BUFF_STATUS_EP8_OUT_RESET, 0x0
.equ	USB_BUFF_STATUS_EP8_OUT_BITS, 0x00020000
.equ	USB_BUFF_STATUS_EP8_OUT_MSB, 17
.equ	USB_BUFF_STATUS_EP8_OUT_LSB, 17
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_STATUS_EP8_IN
.equ	USB_BUFF_STATUS_EP8_IN_RESET, 0x0
.equ	USB_BUFF_STATUS_EP8_IN_BITS, 0x00010000
.equ	USB_BUFF_STATUS_EP8_IN_MSB, 16
.equ	USB_BUFF_STATUS_EP8_IN_LSB, 16
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_STATUS_EP7_OUT
.equ	USB_BUFF_STATUS_EP7_OUT_RESET, 0x0
.equ	USB_BUFF_STATUS_EP7_OUT_BITS, 0x00008000
.equ	USB_BUFF_STATUS_EP7_OUT_MSB, 15
.equ	USB_BUFF_STATUS_EP7_OUT_LSB, 15
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_STATUS_EP7_IN
.equ	USB_BUFF_STATUS_EP7_IN_RESET, 0x0
.equ	USB_BUFF_STATUS_EP7_IN_BITS, 0x00004000
.equ	USB_BUFF_STATUS_EP7_IN_MSB, 14
.equ	USB_BUFF_STATUS_EP7_IN_LSB, 14
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_STATUS_EP6_OUT
.equ	USB_BUFF_STATUS_EP6_OUT_RESET, 0x0
.equ	USB_BUFF_STATUS_EP6_OUT_BITS, 0x00002000
.equ	USB_BUFF_STATUS_EP6_OUT_MSB, 13
.equ	USB_BUFF_STATUS_EP6_OUT_LSB, 13
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_STATUS_EP6_IN
.equ	USB_BUFF_STATUS_EP6_IN_RESET, 0x0
.equ	USB_BUFF_STATUS_EP6_IN_BITS, 0x00001000
.equ	USB_BUFF_STATUS_EP6_IN_MSB, 12
.equ	USB_BUFF_STATUS_EP6_IN_LSB, 12
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_STATUS_EP5_OUT
.equ	USB_BUFF_STATUS_EP5_OUT_RESET, 0x0
.equ	USB_BUFF_STATUS_EP5_OUT_BITS, 0x00000800
.equ	USB_BUFF_STATUS_EP5_OUT_MSB, 11
.equ	USB_BUFF_STATUS_EP5_OUT_LSB, 11
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_STATUS_EP5_IN
.equ	USB_BUFF_STATUS_EP5_IN_RESET, 0x0
.equ	USB_BUFF_STATUS_EP5_IN_BITS, 0x00000400
.equ	USB_BUFF_STATUS_EP5_IN_MSB, 10
.equ	USB_BUFF_STATUS_EP5_IN_LSB, 10
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_STATUS_EP4_OUT
.equ	USB_BUFF_STATUS_EP4_OUT_RESET, 0x0
.equ	USB_BUFF_STATUS_EP4_OUT_BITS, 0x00000200
.equ	USB_BUFF_STATUS_EP4_OUT_MSB, 9
.equ	USB_BUFF_STATUS_EP4_OUT_LSB, 9
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_STATUS_EP4_IN
.equ	USB_BUFF_STATUS_EP4_IN_RESET, 0x0
.equ	USB_BUFF_STATUS_EP4_IN_BITS, 0x00000100
.equ	USB_BUFF_STATUS_EP4_IN_MSB, 8
.equ	USB_BUFF_STATUS_EP4_IN_LSB, 8
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_STATUS_EP3_OUT
.equ	USB_BUFF_STATUS_EP3_OUT_RESET, 0x0
.equ	USB_BUFF_STATUS_EP3_OUT_BITS, 0x00000080
.equ	USB_BUFF_STATUS_EP3_OUT_MSB, 7
.equ	USB_BUFF_STATUS_EP3_OUT_LSB, 7
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_STATUS_EP3_IN
.equ	USB_BUFF_STATUS_EP3_IN_RESET, 0x0
.equ	USB_BUFF_STATUS_EP3_IN_BITS, 0x00000040
.equ	USB_BUFF_STATUS_EP3_IN_MSB, 6
.equ	USB_BUFF_STATUS_EP3_IN_LSB, 6
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_STATUS_EP2_OUT
.equ	USB_BUFF_STATUS_EP2_OUT_RESET, 0x0
.equ	USB_BUFF_STATUS_EP2_OUT_BITS, 0x00000020
.equ	USB_BUFF_STATUS_EP2_OUT_MSB, 5
.equ	USB_BUFF_STATUS_EP2_OUT_LSB, 5
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_STATUS_EP2_IN
.equ	USB_BUFF_STATUS_EP2_IN_RESET, 0x0
.equ	USB_BUFF_STATUS_EP2_IN_BITS, 0x00000010
.equ	USB_BUFF_STATUS_EP2_IN_MSB, 4
.equ	USB_BUFF_STATUS_EP2_IN_LSB, 4
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_STATUS_EP1_OUT
.equ	USB_BUFF_STATUS_EP1_OUT_RESET, 0x0
.equ	USB_BUFF_STATUS_EP1_OUT_BITS, 0x00000008
.equ	USB_BUFF_STATUS_EP1_OUT_MSB, 3
.equ	USB_BUFF_STATUS_EP1_OUT_LSB, 3
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_STATUS_EP1_IN
.equ	USB_BUFF_STATUS_EP1_IN_RESET, 0x0
.equ	USB_BUFF_STATUS_EP1_IN_BITS, 0x00000004
.equ	USB_BUFF_STATUS_EP1_IN_MSB, 2
.equ	USB_BUFF_STATUS_EP1_IN_LSB, 2
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_STATUS_EP0_OUT
.equ	USB_BUFF_STATUS_EP0_OUT_RESET, 0x0
.equ	USB_BUFF_STATUS_EP0_OUT_BITS, 0x00000002
.equ	USB_BUFF_STATUS_EP0_OUT_MSB, 1
.equ	USB_BUFF_STATUS_EP0_OUT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_STATUS_EP0_IN
.equ	USB_BUFF_STATUS_EP0_IN_RESET, 0x0
.equ	USB_BUFF_STATUS_EP0_IN_BITS, 0x00000001
.equ	USB_BUFF_STATUS_EP0_IN_MSB, 0
.equ	USB_BUFF_STATUS_EP0_IN_LSB, 0
# =============================================================================
# Register    : USB_BUFF_CPU_SHOULD_HANDLE
# Description : Which of the double buffers should be handled. Only valid if
#               using an interrupt per buffer (i.e. not per 2 buffers). Not
#               valid for host interrupt endpoint polling because they are only
#               single buffered.
.equ	USB_BUFF_CPU_SHOULD_HANDLE_OFFSET, 0x0000005c
.equ	USB_BUFF_CPU_SHOULD_HANDLE_BITS, 0xffffffff
.equ	USB_BUFF_CPU_SHOULD_HANDLE_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP15_OUT
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP15_OUT_RESET, 0x0
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP15_OUT_BITS, 0x80000000
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP15_OUT_MSB, 31
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP15_OUT_LSB, 31
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP15_IN
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP15_IN_RESET, 0x0
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP15_IN_BITS, 0x40000000
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP15_IN_MSB, 30
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP15_IN_LSB, 30
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP14_OUT
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP14_OUT_RESET, 0x0
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP14_OUT_BITS, 0x20000000
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP14_OUT_MSB, 29
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP14_OUT_LSB, 29
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP14_IN
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP14_IN_RESET, 0x0
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP14_IN_BITS, 0x10000000
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP14_IN_MSB, 28
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP14_IN_LSB, 28
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP13_OUT
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP13_OUT_RESET, 0x0
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP13_OUT_BITS, 0x08000000
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP13_OUT_MSB, 27
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP13_OUT_LSB, 27
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP13_IN
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP13_IN_RESET, 0x0
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP13_IN_BITS, 0x04000000
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP13_IN_MSB, 26
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP13_IN_LSB, 26
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP12_OUT
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP12_OUT_RESET, 0x0
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP12_OUT_BITS, 0x02000000
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP12_OUT_MSB, 25
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP12_OUT_LSB, 25
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP12_IN
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP12_IN_RESET, 0x0
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP12_IN_BITS, 0x01000000
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP12_IN_MSB, 24
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP12_IN_LSB, 24
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP11_OUT
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP11_OUT_RESET, 0x0
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP11_OUT_BITS, 0x00800000
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP11_OUT_MSB, 23
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP11_OUT_LSB, 23
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP11_IN
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP11_IN_RESET, 0x0
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP11_IN_BITS, 0x00400000
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP11_IN_MSB, 22
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP11_IN_LSB, 22
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP10_OUT
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP10_OUT_RESET, 0x0
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP10_OUT_BITS, 0x00200000
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP10_OUT_MSB, 21
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP10_OUT_LSB, 21
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP10_IN
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP10_IN_RESET, 0x0
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP10_IN_BITS, 0x00100000
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP10_IN_MSB, 20
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP10_IN_LSB, 20
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP9_OUT
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP9_OUT_RESET, 0x0
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP9_OUT_BITS, 0x00080000
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP9_OUT_MSB, 19
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP9_OUT_LSB, 19
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP9_IN
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP9_IN_RESET, 0x0
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP9_IN_BITS, 0x00040000
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP9_IN_MSB, 18
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP9_IN_LSB, 18
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP8_OUT
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP8_OUT_RESET, 0x0
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP8_OUT_BITS, 0x00020000
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP8_OUT_MSB, 17
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP8_OUT_LSB, 17
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP8_IN
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP8_IN_RESET, 0x0
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP8_IN_BITS, 0x00010000
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP8_IN_MSB, 16
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP8_IN_LSB, 16
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP7_OUT
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP7_OUT_RESET, 0x0
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP7_OUT_BITS, 0x00008000
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP7_OUT_MSB, 15
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP7_OUT_LSB, 15
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP7_IN
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP7_IN_RESET, 0x0
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP7_IN_BITS, 0x00004000
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP7_IN_MSB, 14
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP7_IN_LSB, 14
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP6_OUT
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP6_OUT_RESET, 0x0
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP6_OUT_BITS, 0x00002000
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP6_OUT_MSB, 13
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP6_OUT_LSB, 13
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP6_IN
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP6_IN_RESET, 0x0
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP6_IN_BITS, 0x00001000
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP6_IN_MSB, 12
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP6_IN_LSB, 12
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP5_OUT
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP5_OUT_RESET, 0x0
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP5_OUT_BITS, 0x00000800
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP5_OUT_MSB, 11
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP5_OUT_LSB, 11
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP5_IN
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP5_IN_RESET, 0x0
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP5_IN_BITS, 0x00000400
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP5_IN_MSB, 10
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP5_IN_LSB, 10
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP4_OUT
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP4_OUT_RESET, 0x0
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP4_OUT_BITS, 0x00000200
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP4_OUT_MSB, 9
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP4_OUT_LSB, 9
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP4_IN
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP4_IN_RESET, 0x0
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP4_IN_BITS, 0x00000100
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP4_IN_MSB, 8
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP4_IN_LSB, 8
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP3_OUT
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP3_OUT_RESET, 0x0
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP3_OUT_BITS, 0x00000080
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP3_OUT_MSB, 7
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP3_OUT_LSB, 7
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP3_IN
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP3_IN_RESET, 0x0
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP3_IN_BITS, 0x00000040
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP3_IN_MSB, 6
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP3_IN_LSB, 6
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP2_OUT
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP2_OUT_RESET, 0x0
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP2_OUT_BITS, 0x00000020
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP2_OUT_MSB, 5
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP2_OUT_LSB, 5
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP2_IN
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP2_IN_RESET, 0x0
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP2_IN_BITS, 0x00000010
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP2_IN_MSB, 4
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP2_IN_LSB, 4
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP1_OUT
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP1_OUT_RESET, 0x0
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP1_OUT_BITS, 0x00000008
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP1_OUT_MSB, 3
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP1_OUT_LSB, 3
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP1_IN
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP1_IN_RESET, 0x0
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP1_IN_BITS, 0x00000004
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP1_IN_MSB, 2
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP1_IN_LSB, 2
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP0_OUT
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP0_OUT_RESET, 0x0
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP0_OUT_BITS, 0x00000002
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP0_OUT_MSB, 1
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP0_OUT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : USB_BUFF_CPU_SHOULD_HANDLE_EP0_IN
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP0_IN_RESET, 0x0
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP0_IN_BITS, 0x00000001
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP0_IN_MSB, 0
.equ	USB_BUFF_CPU_SHOULD_HANDLE_EP0_IN_LSB, 0
# =============================================================================
# Register    : USB_EP_ABORT
# Description : Device only: Can be set to ignore the buffer control register
#               for this endpoint in case you would like to revoke a buffer. A
#               NAK will be sent for every access to the endpoint until this
#               bit is cleared. A corresponding bit in `EP_ABORT_DONE` is set
#               when it is safe to modify the buffer control register.
.equ	USB_EP_ABORT_OFFSET, 0x00000060
.equ	USB_EP_ABORT_BITS, 0xffffffff
.equ	USB_EP_ABORT_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_EP15_OUT
.equ	USB_EP_ABORT_EP15_OUT_RESET, 0x0
.equ	USB_EP_ABORT_EP15_OUT_BITS, 0x80000000
.equ	USB_EP_ABORT_EP15_OUT_MSB, 31
.equ	USB_EP_ABORT_EP15_OUT_LSB, 31
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_EP15_IN
.equ	USB_EP_ABORT_EP15_IN_RESET, 0x0
.equ	USB_EP_ABORT_EP15_IN_BITS, 0x40000000
.equ	USB_EP_ABORT_EP15_IN_MSB, 30
.equ	USB_EP_ABORT_EP15_IN_LSB, 30
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_EP14_OUT
.equ	USB_EP_ABORT_EP14_OUT_RESET, 0x0
.equ	USB_EP_ABORT_EP14_OUT_BITS, 0x20000000
.equ	USB_EP_ABORT_EP14_OUT_MSB, 29
.equ	USB_EP_ABORT_EP14_OUT_LSB, 29
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_EP14_IN
.equ	USB_EP_ABORT_EP14_IN_RESET, 0x0
.equ	USB_EP_ABORT_EP14_IN_BITS, 0x10000000
.equ	USB_EP_ABORT_EP14_IN_MSB, 28
.equ	USB_EP_ABORT_EP14_IN_LSB, 28
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_EP13_OUT
.equ	USB_EP_ABORT_EP13_OUT_RESET, 0x0
.equ	USB_EP_ABORT_EP13_OUT_BITS, 0x08000000
.equ	USB_EP_ABORT_EP13_OUT_MSB, 27
.equ	USB_EP_ABORT_EP13_OUT_LSB, 27
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_EP13_IN
.equ	USB_EP_ABORT_EP13_IN_RESET, 0x0
.equ	USB_EP_ABORT_EP13_IN_BITS, 0x04000000
.equ	USB_EP_ABORT_EP13_IN_MSB, 26
.equ	USB_EP_ABORT_EP13_IN_LSB, 26
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_EP12_OUT
.equ	USB_EP_ABORT_EP12_OUT_RESET, 0x0
.equ	USB_EP_ABORT_EP12_OUT_BITS, 0x02000000
