konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/usb.inc
.equ	USB_EP_ABORT_EP12_OUT_MSB, 25
.equ	USB_EP_ABORT_EP12_OUT_LSB, 25
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_EP12_IN
.equ	USB_EP_ABORT_EP12_IN_RESET, 0x0
.equ	USB_EP_ABORT_EP12_IN_BITS, 0x01000000
.equ	USB_EP_ABORT_EP12_IN_MSB, 24
.equ	USB_EP_ABORT_EP12_IN_LSB, 24
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_EP11_OUT
.equ	USB_EP_ABORT_EP11_OUT_RESET, 0x0
.equ	USB_EP_ABORT_EP11_OUT_BITS, 0x00800000
.equ	USB_EP_ABORT_EP11_OUT_MSB, 23
.equ	USB_EP_ABORT_EP11_OUT_LSB, 23
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_EP11_IN
.equ	USB_EP_ABORT_EP11_IN_RESET, 0x0
.equ	USB_EP_ABORT_EP11_IN_BITS, 0x00400000
.equ	USB_EP_ABORT_EP11_IN_MSB, 22
.equ	USB_EP_ABORT_EP11_IN_LSB, 22
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_EP10_OUT
.equ	USB_EP_ABORT_EP10_OUT_RESET, 0x0
.equ	USB_EP_ABORT_EP10_OUT_BITS, 0x00200000
.equ	USB_EP_ABORT_EP10_OUT_MSB, 21
.equ	USB_EP_ABORT_EP10_OUT_LSB, 21
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_EP10_IN
.equ	USB_EP_ABORT_EP10_IN_RESET, 0x0
.equ	USB_EP_ABORT_EP10_IN_BITS, 0x00100000
.equ	USB_EP_ABORT_EP10_IN_MSB, 20
.equ	USB_EP_ABORT_EP10_IN_LSB, 20
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_EP9_OUT
.equ	USB_EP_ABORT_EP9_OUT_RESET, 0x0
.equ	USB_EP_ABORT_EP9_OUT_BITS, 0x00080000
.equ	USB_EP_ABORT_EP9_OUT_MSB, 19
.equ	USB_EP_ABORT_EP9_OUT_LSB, 19
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_EP9_IN
.equ	USB_EP_ABORT_EP9_IN_RESET, 0x0
.equ	USB_EP_ABORT_EP9_IN_BITS, 0x00040000
.equ	USB_EP_ABORT_EP9_IN_MSB, 18
.equ	USB_EP_ABORT_EP9_IN_LSB, 18
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_EP8_OUT
.equ	USB_EP_ABORT_EP8_OUT_RESET, 0x0
.equ	USB_EP_ABORT_EP8_OUT_BITS, 0x00020000
.equ	USB_EP_ABORT_EP8_OUT_MSB, 17
.equ	USB_EP_ABORT_EP8_OUT_LSB, 17
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_EP8_IN
.equ	USB_EP_ABORT_EP8_IN_RESET, 0x0
.equ	USB_EP_ABORT_EP8_IN_BITS, 0x00010000
.equ	USB_EP_ABORT_EP8_IN_MSB, 16
.equ	USB_EP_ABORT_EP8_IN_LSB, 16
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_EP7_OUT
.equ	USB_EP_ABORT_EP7_OUT_RESET, 0x0
.equ	USB_EP_ABORT_EP7_OUT_BITS, 0x00008000
.equ	USB_EP_ABORT_EP7_OUT_MSB, 15
.equ	USB_EP_ABORT_EP7_OUT_LSB, 15
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_EP7_IN
.equ	USB_EP_ABORT_EP7_IN_RESET, 0x0
.equ	USB_EP_ABORT_EP7_IN_BITS, 0x00004000
.equ	USB_EP_ABORT_EP7_IN_MSB, 14
.equ	USB_EP_ABORT_EP7_IN_LSB, 14
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_EP6_OUT
.equ	USB_EP_ABORT_EP6_OUT_RESET, 0x0
.equ	USB_EP_ABORT_EP6_OUT_BITS, 0x00002000
.equ	USB_EP_ABORT_EP6_OUT_MSB, 13
.equ	USB_EP_ABORT_EP6_OUT_LSB, 13
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_EP6_IN
.equ	USB_EP_ABORT_EP6_IN_RESET, 0x0
.equ	USB_EP_ABORT_EP6_IN_BITS, 0x00001000
.equ	USB_EP_ABORT_EP6_IN_MSB, 12
.equ	USB_EP_ABORT_EP6_IN_LSB, 12
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_EP5_OUT
.equ	USB_EP_ABORT_EP5_OUT_RESET, 0x0
.equ	USB_EP_ABORT_EP5_OUT_BITS, 0x00000800
.equ	USB_EP_ABORT_EP5_OUT_MSB, 11
.equ	USB_EP_ABORT_EP5_OUT_LSB, 11
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_EP5_IN
.equ	USB_EP_ABORT_EP5_IN_RESET, 0x0
.equ	USB_EP_ABORT_EP5_IN_BITS, 0x00000400
.equ	USB_EP_ABORT_EP5_IN_MSB, 10
.equ	USB_EP_ABORT_EP5_IN_LSB, 10
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_EP4_OUT
.equ	USB_EP_ABORT_EP4_OUT_RESET, 0x0
.equ	USB_EP_ABORT_EP4_OUT_BITS, 0x00000200
.equ	USB_EP_ABORT_EP4_OUT_MSB, 9
.equ	USB_EP_ABORT_EP4_OUT_LSB, 9
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_EP4_IN
.equ	USB_EP_ABORT_EP4_IN_RESET, 0x0
.equ	USB_EP_ABORT_EP4_IN_BITS, 0x00000100
.equ	USB_EP_ABORT_EP4_IN_MSB, 8
.equ	USB_EP_ABORT_EP4_IN_LSB, 8
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_EP3_OUT
.equ	USB_EP_ABORT_EP3_OUT_RESET, 0x0
.equ	USB_EP_ABORT_EP3_OUT_BITS, 0x00000080
.equ	USB_EP_ABORT_EP3_OUT_MSB, 7
.equ	USB_EP_ABORT_EP3_OUT_LSB, 7
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_EP3_IN
.equ	USB_EP_ABORT_EP3_IN_RESET, 0x0
.equ	USB_EP_ABORT_EP3_IN_BITS, 0x00000040
.equ	USB_EP_ABORT_EP3_IN_MSB, 6
.equ	USB_EP_ABORT_EP3_IN_LSB, 6
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_EP2_OUT
.equ	USB_EP_ABORT_EP2_OUT_RESET, 0x0
.equ	USB_EP_ABORT_EP2_OUT_BITS, 0x00000020
.equ	USB_EP_ABORT_EP2_OUT_MSB, 5
.equ	USB_EP_ABORT_EP2_OUT_LSB, 5
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_EP2_IN
.equ	USB_EP_ABORT_EP2_IN_RESET, 0x0
.equ	USB_EP_ABORT_EP2_IN_BITS, 0x00000010
.equ	USB_EP_ABORT_EP2_IN_MSB, 4
.equ	USB_EP_ABORT_EP2_IN_LSB, 4
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_EP1_OUT
.equ	USB_EP_ABORT_EP1_OUT_RESET, 0x0
.equ	USB_EP_ABORT_EP1_OUT_BITS, 0x00000008
.equ	USB_EP_ABORT_EP1_OUT_MSB, 3
.equ	USB_EP_ABORT_EP1_OUT_LSB, 3
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_EP1_IN
.equ	USB_EP_ABORT_EP1_IN_RESET, 0x0
.equ	USB_EP_ABORT_EP1_IN_BITS, 0x00000004
.equ	USB_EP_ABORT_EP1_IN_MSB, 2
.equ	USB_EP_ABORT_EP1_IN_LSB, 2
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_EP0_OUT
.equ	USB_EP_ABORT_EP0_OUT_RESET, 0x0
.equ	USB_EP_ABORT_EP0_OUT_BITS, 0x00000002
.equ	USB_EP_ABORT_EP0_OUT_MSB, 1
.equ	USB_EP_ABORT_EP0_OUT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_EP0_IN
.equ	USB_EP_ABORT_EP0_IN_RESET, 0x0
.equ	USB_EP_ABORT_EP0_IN_BITS, 0x00000001
.equ	USB_EP_ABORT_EP0_IN_MSB, 0
.equ	USB_EP_ABORT_EP0_IN_LSB, 0
# =============================================================================
# Register    : USB_EP_ABORT_DONE
# Description : Device only: Used in conjunction with `EP_ABORT`. Set once an
#               endpoint is idle so the programmer knows it is safe to modify
#               the buffer control register.
.equ	USB_EP_ABORT_DONE_OFFSET, 0x00000064
.equ	USB_EP_ABORT_DONE_BITS, 0xffffffff
.equ	USB_EP_ABORT_DONE_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_DONE_EP15_OUT
.equ	USB_EP_ABORT_DONE_EP15_OUT_RESET, 0x0
.equ	USB_EP_ABORT_DONE_EP15_OUT_BITS, 0x80000000
.equ	USB_EP_ABORT_DONE_EP15_OUT_MSB, 31
.equ	USB_EP_ABORT_DONE_EP15_OUT_LSB, 31
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_DONE_EP15_IN
.equ	USB_EP_ABORT_DONE_EP15_IN_RESET, 0x0
.equ	USB_EP_ABORT_DONE_EP15_IN_BITS, 0x40000000
.equ	USB_EP_ABORT_DONE_EP15_IN_MSB, 30
.equ	USB_EP_ABORT_DONE_EP15_IN_LSB, 30
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_DONE_EP14_OUT
.equ	USB_EP_ABORT_DONE_EP14_OUT_RESET, 0x0
.equ	USB_EP_ABORT_DONE_EP14_OUT_BITS, 0x20000000
.equ	USB_EP_ABORT_DONE_EP14_OUT_MSB, 29
.equ	USB_EP_ABORT_DONE_EP14_OUT_LSB, 29
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_DONE_EP14_IN
.equ	USB_EP_ABORT_DONE_EP14_IN_RESET, 0x0
.equ	USB_EP_ABORT_DONE_EP14_IN_BITS, 0x10000000
.equ	USB_EP_ABORT_DONE_EP14_IN_MSB, 28
.equ	USB_EP_ABORT_DONE_EP14_IN_LSB, 28
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_DONE_EP13_OUT
.equ	USB_EP_ABORT_DONE_EP13_OUT_RESET, 0x0
.equ	USB_EP_ABORT_DONE_EP13_OUT_BITS, 0x08000000
.equ	USB_EP_ABORT_DONE_EP13_OUT_MSB, 27
.equ	USB_EP_ABORT_DONE_EP13_OUT_LSB, 27
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_DONE_EP13_IN
.equ	USB_EP_ABORT_DONE_EP13_IN_RESET, 0x0
.equ	USB_EP_ABORT_DONE_EP13_IN_BITS, 0x04000000
.equ	USB_EP_ABORT_DONE_EP13_IN_MSB, 26
.equ	USB_EP_ABORT_DONE_EP13_IN_LSB, 26
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_DONE_EP12_OUT
.equ	USB_EP_ABORT_DONE_EP12_OUT_RESET, 0x0
.equ	USB_EP_ABORT_DONE_EP12_OUT_BITS, 0x02000000
.equ	USB_EP_ABORT_DONE_EP12_OUT_MSB, 25
.equ	USB_EP_ABORT_DONE_EP12_OUT_LSB, 25
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_DONE_EP12_IN
.equ	USB_EP_ABORT_DONE_EP12_IN_RESET, 0x0
.equ	USB_EP_ABORT_DONE_EP12_IN_BITS, 0x01000000
.equ	USB_EP_ABORT_DONE_EP12_IN_MSB, 24
.equ	USB_EP_ABORT_DONE_EP12_IN_LSB, 24
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_DONE_EP11_OUT
.equ	USB_EP_ABORT_DONE_EP11_OUT_RESET, 0x0
.equ	USB_EP_ABORT_DONE_EP11_OUT_BITS, 0x00800000
.equ	USB_EP_ABORT_DONE_EP11_OUT_MSB, 23
.equ	USB_EP_ABORT_DONE_EP11_OUT_LSB, 23
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_DONE_EP11_IN
.equ	USB_EP_ABORT_DONE_EP11_IN_RESET, 0x0
.equ	USB_EP_ABORT_DONE_EP11_IN_BITS, 0x00400000
.equ	USB_EP_ABORT_DONE_EP11_IN_MSB, 22
.equ	USB_EP_ABORT_DONE_EP11_IN_LSB, 22
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_DONE_EP10_OUT
.equ	USB_EP_ABORT_DONE_EP10_OUT_RESET, 0x0
.equ	USB_EP_ABORT_DONE_EP10_OUT_BITS, 0x00200000
.equ	USB_EP_ABORT_DONE_EP10_OUT_MSB, 21
.equ	USB_EP_ABORT_DONE_EP10_OUT_LSB, 21
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_DONE_EP10_IN
.equ	USB_EP_ABORT_DONE_EP10_IN_RESET, 0x0
.equ	USB_EP_ABORT_DONE_EP10_IN_BITS, 0x00100000
.equ	USB_EP_ABORT_DONE_EP10_IN_MSB, 20
.equ	USB_EP_ABORT_DONE_EP10_IN_LSB, 20
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_DONE_EP9_OUT
.equ	USB_EP_ABORT_DONE_EP9_OUT_RESET, 0x0
.equ	USB_EP_ABORT_DONE_EP9_OUT_BITS, 0x00080000
.equ	USB_EP_ABORT_DONE_EP9_OUT_MSB, 19
.equ	USB_EP_ABORT_DONE_EP9_OUT_LSB, 19
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_DONE_EP9_IN
.equ	USB_EP_ABORT_DONE_EP9_IN_RESET, 0x0
.equ	USB_EP_ABORT_DONE_EP9_IN_BITS, 0x00040000
.equ	USB_EP_ABORT_DONE_EP9_IN_MSB, 18
.equ	USB_EP_ABORT_DONE_EP9_IN_LSB, 18
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_DONE_EP8_OUT
.equ	USB_EP_ABORT_DONE_EP8_OUT_RESET, 0x0
.equ	USB_EP_ABORT_DONE_EP8_OUT_BITS, 0x00020000
.equ	USB_EP_ABORT_DONE_EP8_OUT_MSB, 17
.equ	USB_EP_ABORT_DONE_EP8_OUT_LSB, 17
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_DONE_EP8_IN
.equ	USB_EP_ABORT_DONE_EP8_IN_RESET, 0x0
.equ	USB_EP_ABORT_DONE_EP8_IN_BITS, 0x00010000
.equ	USB_EP_ABORT_DONE_EP8_IN_MSB, 16
.equ	USB_EP_ABORT_DONE_EP8_IN_LSB, 16
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_DONE_EP7_OUT
.equ	USB_EP_ABORT_DONE_EP7_OUT_RESET, 0x0
.equ	USB_EP_ABORT_DONE_EP7_OUT_BITS, 0x00008000
.equ	USB_EP_ABORT_DONE_EP7_OUT_MSB, 15
.equ	USB_EP_ABORT_DONE_EP7_OUT_LSB, 15
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_DONE_EP7_IN
.equ	USB_EP_ABORT_DONE_EP7_IN_RESET, 0x0
.equ	USB_EP_ABORT_DONE_EP7_IN_BITS, 0x00004000
.equ	USB_EP_ABORT_DONE_EP7_IN_MSB, 14
.equ	USB_EP_ABORT_DONE_EP7_IN_LSB, 14
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_DONE_EP6_OUT
.equ	USB_EP_ABORT_DONE_EP6_OUT_RESET, 0x0
.equ	USB_EP_ABORT_DONE_EP6_OUT_BITS, 0x00002000
.equ	USB_EP_ABORT_DONE_EP6_OUT_MSB, 13
.equ	USB_EP_ABORT_DONE_EP6_OUT_LSB, 13
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_DONE_EP6_IN
.equ	USB_EP_ABORT_DONE_EP6_IN_RESET, 0x0
.equ	USB_EP_ABORT_DONE_EP6_IN_BITS, 0x00001000
.equ	USB_EP_ABORT_DONE_EP6_IN_MSB, 12
.equ	USB_EP_ABORT_DONE_EP6_IN_LSB, 12
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_DONE_EP5_OUT
.equ	USB_EP_ABORT_DONE_EP5_OUT_RESET, 0x0
.equ	USB_EP_ABORT_DONE_EP5_OUT_BITS, 0x00000800
.equ	USB_EP_ABORT_DONE_EP5_OUT_MSB, 11
.equ	USB_EP_ABORT_DONE_EP5_OUT_LSB, 11
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_DONE_EP5_IN
.equ	USB_EP_ABORT_DONE_EP5_IN_RESET, 0x0
.equ	USB_EP_ABORT_DONE_EP5_IN_BITS, 0x00000400
.equ	USB_EP_ABORT_DONE_EP5_IN_MSB, 10
.equ	USB_EP_ABORT_DONE_EP5_IN_LSB, 10
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_DONE_EP4_OUT
.equ	USB_EP_ABORT_DONE_EP4_OUT_RESET, 0x0
.equ	USB_EP_ABORT_DONE_EP4_OUT_BITS, 0x00000200
.equ	USB_EP_ABORT_DONE_EP4_OUT_MSB, 9
.equ	USB_EP_ABORT_DONE_EP4_OUT_LSB, 9
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_DONE_EP4_IN
.equ	USB_EP_ABORT_DONE_EP4_IN_RESET, 0x0
.equ	USB_EP_ABORT_DONE_EP4_IN_BITS, 0x00000100
.equ	USB_EP_ABORT_DONE_EP4_IN_MSB, 8
.equ	USB_EP_ABORT_DONE_EP4_IN_LSB, 8
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_DONE_EP3_OUT
.equ	USB_EP_ABORT_DONE_EP3_OUT_RESET, 0x0
.equ	USB_EP_ABORT_DONE_EP3_OUT_BITS, 0x00000080
.equ	USB_EP_ABORT_DONE_EP3_OUT_MSB, 7
.equ	USB_EP_ABORT_DONE_EP3_OUT_LSB, 7
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_DONE_EP3_IN
.equ	USB_EP_ABORT_DONE_EP3_IN_RESET, 0x0
.equ	USB_EP_ABORT_DONE_EP3_IN_BITS, 0x00000040
.equ	USB_EP_ABORT_DONE_EP3_IN_MSB, 6
.equ	USB_EP_ABORT_DONE_EP3_IN_LSB, 6
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_DONE_EP2_OUT
.equ	USB_EP_ABORT_DONE_EP2_OUT_RESET, 0x0
.equ	USB_EP_ABORT_DONE_EP2_OUT_BITS, 0x00000020
.equ	USB_EP_ABORT_DONE_EP2_OUT_MSB, 5
.equ	USB_EP_ABORT_DONE_EP2_OUT_LSB, 5
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_DONE_EP2_IN
.equ	USB_EP_ABORT_DONE_EP2_IN_RESET, 0x0
.equ	USB_EP_ABORT_DONE_EP2_IN_BITS, 0x00000010
.equ	USB_EP_ABORT_DONE_EP2_IN_MSB, 4
.equ	USB_EP_ABORT_DONE_EP2_IN_LSB, 4
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_DONE_EP1_OUT
.equ	USB_EP_ABORT_DONE_EP1_OUT_RESET, 0x0
.equ	USB_EP_ABORT_DONE_EP1_OUT_BITS, 0x00000008
.equ	USB_EP_ABORT_DONE_EP1_OUT_MSB, 3
.equ	USB_EP_ABORT_DONE_EP1_OUT_LSB, 3
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_DONE_EP1_IN
.equ	USB_EP_ABORT_DONE_EP1_IN_RESET, 0x0
.equ	USB_EP_ABORT_DONE_EP1_IN_BITS, 0x00000004
.equ	USB_EP_ABORT_DONE_EP1_IN_MSB, 2
.equ	USB_EP_ABORT_DONE_EP1_IN_LSB, 2
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_DONE_EP0_OUT
.equ	USB_EP_ABORT_DONE_EP0_OUT_RESET, 0x0
.equ	USB_EP_ABORT_DONE_EP0_OUT_BITS, 0x00000002
.equ	USB_EP_ABORT_DONE_EP0_OUT_MSB, 1
.equ	USB_EP_ABORT_DONE_EP0_OUT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : USB_EP_ABORT_DONE_EP0_IN
.equ	USB_EP_ABORT_DONE_EP0_IN_RESET, 0x0
.equ	USB_EP_ABORT_DONE_EP0_IN_BITS, 0x00000001
.equ	USB_EP_ABORT_DONE_EP0_IN_MSB, 0
.equ	USB_EP_ABORT_DONE_EP0_IN_LSB, 0
# =============================================================================
# Register    : USB_EP_STALL_ARM
# Description : Device: this bit must be set in conjunction with the `STALL`
#               bit in the buffer control register to send a STALL on EP0. The
#               device controller clears these bits when a SETUP packet is
#               received because the USB spec requires that a STALL condition
#               is cleared when a SETUP packet is received.
.equ	USB_EP_STALL_ARM_OFFSET, 0x00000068
.equ	USB_EP_STALL_ARM_BITS, 0x00000003
.equ	USB_EP_STALL_ARM_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_EP_STALL_ARM_EP0_OUT
.equ	USB_EP_STALL_ARM_EP0_OUT_RESET, 0x0
.equ	USB_EP_STALL_ARM_EP0_OUT_BITS, 0x00000002
.equ	USB_EP_STALL_ARM_EP0_OUT_MSB, 1
.equ	USB_EP_STALL_ARM_EP0_OUT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : USB_EP_STALL_ARM_EP0_IN
.equ	USB_EP_STALL_ARM_EP0_IN_RESET, 0x0
.equ	USB_EP_STALL_ARM_EP0_IN_BITS, 0x00000001
.equ	USB_EP_STALL_ARM_EP0_IN_MSB, 0
.equ	USB_EP_STALL_ARM_EP0_IN_LSB, 0
# =============================================================================
# Register    : USB_NAK_POLL
# Description : Used by the host controller. Sets the wait time in microseconds
#               before trying again if the device replies with a NAK.
.equ	USB_NAK_POLL_OFFSET, 0x0000006c
.equ	USB_NAK_POLL_BITS, 0xffffffff
.equ	USB_NAK_POLL_RESET, 0x00100010
# -----------------------------------------------------------------------------
# Field       : USB_NAK_POLL_RETRY_COUNT_HI
# Description : Bits 9:6 of nak_retry count
.equ	USB_NAK_POLL_RETRY_COUNT_HI_RESET, 0x0
.equ	USB_NAK_POLL_RETRY_COUNT_HI_BITS, 0xf0000000
.equ	USB_NAK_POLL_RETRY_COUNT_HI_MSB, 31
.equ	USB_NAK_POLL_RETRY_COUNT_HI_LSB, 28
# -----------------------------------------------------------------------------
# Field       : USB_NAK_POLL_EPX_STOPPED_ON_NAK
# Description : EPX polling has stopped because a nak was received
.equ	USB_NAK_POLL_EPX_STOPPED_ON_NAK_RESET, 0x0
.equ	USB_NAK_POLL_EPX_STOPPED_ON_NAK_BITS, 0x08000000
.equ	USB_NAK_POLL_EPX_STOPPED_ON_NAK_MSB, 27
.equ	USB_NAK_POLL_EPX_STOPPED_ON_NAK_LSB, 27
# -----------------------------------------------------------------------------
# Field       : USB_NAK_POLL_STOP_EPX_ON_NAK
# Description : Stop polling epx when a nak is received
.equ	USB_NAK_POLL_STOP_EPX_ON_NAK_RESET, 0x0
.equ	USB_NAK_POLL_STOP_EPX_ON_NAK_BITS, 0x04000000
.equ	USB_NAK_POLL_STOP_EPX_ON_NAK_MSB, 26
.equ	USB_NAK_POLL_STOP_EPX_ON_NAK_LSB, 26
# -----------------------------------------------------------------------------
# Field       : USB_NAK_POLL_DELAY_FS
# Description : NAK polling interval for a full speed device
.equ	USB_NAK_POLL_DELAY_FS_RESET, 0x010
.equ	USB_NAK_POLL_DELAY_FS_BITS, 0x03ff0000
.equ	USB_NAK_POLL_DELAY_FS_MSB, 25
.equ	USB_NAK_POLL_DELAY_FS_LSB, 16
# -----------------------------------------------------------------------------
# Field       : USB_NAK_POLL_RETRY_COUNT_LO
# Description : Bits 5:0 of nak_retry_count
.equ	USB_NAK_POLL_RETRY_COUNT_LO_RESET, 0x00
.equ	USB_NAK_POLL_RETRY_COUNT_LO_BITS, 0x0000fc00
.equ	USB_NAK_POLL_RETRY_COUNT_LO_MSB, 15
.equ	USB_NAK_POLL_RETRY_COUNT_LO_LSB, 10
# -----------------------------------------------------------------------------
# Field       : USB_NAK_POLL_DELAY_LS
# Description : NAK polling interval for a low speed device
.equ	USB_NAK_POLL_DELAY_LS_RESET, 0x010
.equ	USB_NAK_POLL_DELAY_LS_BITS, 0x000003ff
.equ	USB_NAK_POLL_DELAY_LS_MSB, 9
.equ	USB_NAK_POLL_DELAY_LS_LSB, 0
# =============================================================================
# Register    : USB_EP_STATUS_STALL_NAK
# Description : Device: bits are set when the `IRQ_ON_NAK` or `IRQ_ON_STALL`
#               bits are set. For EP0 this comes from `SIE_CTRL`. For all other
#               endpoints it comes from the endpoint control register.
.equ	USB_EP_STATUS_STALL_NAK_OFFSET, 0x00000070
.equ	USB_EP_STATUS_STALL_NAK_BITS, 0xffffffff
.equ	USB_EP_STATUS_STALL_NAK_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_EP_STATUS_STALL_NAK_EP15_OUT
.equ	USB_EP_STATUS_STALL_NAK_EP15_OUT_RESET, 0x0
.equ	USB_EP_STATUS_STALL_NAK_EP15_OUT_BITS, 0x80000000
.equ	USB_EP_STATUS_STALL_NAK_EP15_OUT_MSB, 31
.equ	USB_EP_STATUS_STALL_NAK_EP15_OUT_LSB, 31
# -----------------------------------------------------------------------------
# Field       : USB_EP_STATUS_STALL_NAK_EP15_IN
.equ	USB_EP_STATUS_STALL_NAK_EP15_IN_RESET, 0x0
.equ	USB_EP_STATUS_STALL_NAK_EP15_IN_BITS, 0x40000000
.equ	USB_EP_STATUS_STALL_NAK_EP15_IN_MSB, 30
.equ	USB_EP_STATUS_STALL_NAK_EP15_IN_LSB, 30
# -----------------------------------------------------------------------------
# Field       : USB_EP_STATUS_STALL_NAK_EP14_OUT
.equ	USB_EP_STATUS_STALL_NAK_EP14_OUT_RESET, 0x0
.equ	USB_EP_STATUS_STALL_NAK_EP14_OUT_BITS, 0x20000000
.equ	USB_EP_STATUS_STALL_NAK_EP14_OUT_MSB, 29
.equ	USB_EP_STATUS_STALL_NAK_EP14_OUT_LSB, 29
# -----------------------------------------------------------------------------
# Field       : USB_EP_STATUS_STALL_NAK_EP14_IN
.equ	USB_EP_STATUS_STALL_NAK_EP14_IN_RESET, 0x0
.equ	USB_EP_STATUS_STALL_NAK_EP14_IN_BITS, 0x10000000
.equ	USB_EP_STATUS_STALL_NAK_EP14_IN_MSB, 28
.equ	USB_EP_STATUS_STALL_NAK_EP14_IN_LSB, 28
# -----------------------------------------------------------------------------
# Field       : USB_EP_STATUS_STALL_NAK_EP13_OUT
.equ	USB_EP_STATUS_STALL_NAK_EP13_OUT_RESET, 0x0
.equ	USB_EP_STATUS_STALL_NAK_EP13_OUT_BITS, 0x08000000
.equ	USB_EP_STATUS_STALL_NAK_EP13_OUT_MSB, 27
.equ	USB_EP_STATUS_STALL_NAK_EP13_OUT_LSB, 27
# -----------------------------------------------------------------------------
# Field       : USB_EP_STATUS_STALL_NAK_EP13_IN
.equ	USB_EP_STATUS_STALL_NAK_EP13_IN_RESET, 0x0
.equ	USB_EP_STATUS_STALL_NAK_EP13_IN_BITS, 0x04000000
.equ	USB_EP_STATUS_STALL_NAK_EP13_IN_MSB, 26
.equ	USB_EP_STATUS_STALL_NAK_EP13_IN_LSB, 26
# -----------------------------------------------------------------------------
# Field       : USB_EP_STATUS_STALL_NAK_EP12_OUT
.equ	USB_EP_STATUS_STALL_NAK_EP12_OUT_RESET, 0x0
.equ	USB_EP_STATUS_STALL_NAK_EP12_OUT_BITS, 0x02000000
.equ	USB_EP_STATUS_STALL_NAK_EP12_OUT_MSB, 25
.equ	USB_EP_STATUS_STALL_NAK_EP12_OUT_LSB, 25
# -----------------------------------------------------------------------------
# Field       : USB_EP_STATUS_STALL_NAK_EP12_IN
.equ	USB_EP_STATUS_STALL_NAK_EP12_IN_RESET, 0x0
.equ	USB_EP_STATUS_STALL_NAK_EP12_IN_BITS, 0x01000000
.equ	USB_EP_STATUS_STALL_NAK_EP12_IN_MSB, 24
.equ	USB_EP_STATUS_STALL_NAK_EP12_IN_LSB, 24
# -----------------------------------------------------------------------------
# Field       : USB_EP_STATUS_STALL_NAK_EP11_OUT
.equ	USB_EP_STATUS_STALL_NAK_EP11_OUT_RESET, 0x0
.equ	USB_EP_STATUS_STALL_NAK_EP11_OUT_BITS, 0x00800000
.equ	USB_EP_STATUS_STALL_NAK_EP11_OUT_MSB, 23
.equ	USB_EP_STATUS_STALL_NAK_EP11_OUT_LSB, 23
# -----------------------------------------------------------------------------
# Field       : USB_EP_STATUS_STALL_NAK_EP11_IN
.equ	USB_EP_STATUS_STALL_NAK_EP11_IN_RESET, 0x0
.equ	USB_EP_STATUS_STALL_NAK_EP11_IN_BITS, 0x00400000
.equ	USB_EP_STATUS_STALL_NAK_EP11_IN_MSB, 22
.equ	USB_EP_STATUS_STALL_NAK_EP11_IN_LSB, 22
# -----------------------------------------------------------------------------
# Field       : USB_EP_STATUS_STALL_NAK_EP10_OUT
.equ	USB_EP_STATUS_STALL_NAK_EP10_OUT_RESET, 0x0
.equ	USB_EP_STATUS_STALL_NAK_EP10_OUT_BITS, 0x00200000
.equ	USB_EP_STATUS_STALL_NAK_EP10_OUT_MSB, 21
.equ	USB_EP_STATUS_STALL_NAK_EP10_OUT_LSB, 21
