konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/usb.inc
# -----------------------------------------------------------------------------
# Field       : USB_EP_STATUS_STALL_NAK_EP10_IN
.equ	USB_EP_STATUS_STALL_NAK_EP10_IN_RESET, 0x0
.equ	USB_EP_STATUS_STALL_NAK_EP10_IN_BITS, 0x00100000
.equ	USB_EP_STATUS_STALL_NAK_EP10_IN_MSB, 20
.equ	USB_EP_STATUS_STALL_NAK_EP10_IN_LSB, 20
# -----------------------------------------------------------------------------
# Field       : USB_EP_STATUS_STALL_NAK_EP9_OUT
.equ	USB_EP_STATUS_STALL_NAK_EP9_OUT_RESET, 0x0
.equ	USB_EP_STATUS_STALL_NAK_EP9_OUT_BITS, 0x00080000
.equ	USB_EP_STATUS_STALL_NAK_EP9_OUT_MSB, 19
.equ	USB_EP_STATUS_STALL_NAK_EP9_OUT_LSB, 19
# -----------------------------------------------------------------------------
# Field       : USB_EP_STATUS_STALL_NAK_EP9_IN
.equ	USB_EP_STATUS_STALL_NAK_EP9_IN_RESET, 0x0
.equ	USB_EP_STATUS_STALL_NAK_EP9_IN_BITS, 0x00040000
.equ	USB_EP_STATUS_STALL_NAK_EP9_IN_MSB, 18
.equ	USB_EP_STATUS_STALL_NAK_EP9_IN_LSB, 18
# -----------------------------------------------------------------------------
# Field       : USB_EP_STATUS_STALL_NAK_EP8_OUT
.equ	USB_EP_STATUS_STALL_NAK_EP8_OUT_RESET, 0x0
.equ	USB_EP_STATUS_STALL_NAK_EP8_OUT_BITS, 0x00020000
.equ	USB_EP_STATUS_STALL_NAK_EP8_OUT_MSB, 17
.equ	USB_EP_STATUS_STALL_NAK_EP8_OUT_LSB, 17
# -----------------------------------------------------------------------------
# Field       : USB_EP_STATUS_STALL_NAK_EP8_IN
.equ	USB_EP_STATUS_STALL_NAK_EP8_IN_RESET, 0x0
.equ	USB_EP_STATUS_STALL_NAK_EP8_IN_BITS, 0x00010000
.equ	USB_EP_STATUS_STALL_NAK_EP8_IN_MSB, 16
.equ	USB_EP_STATUS_STALL_NAK_EP8_IN_LSB, 16
# -----------------------------------------------------------------------------
# Field       : USB_EP_STATUS_STALL_NAK_EP7_OUT
.equ	USB_EP_STATUS_STALL_NAK_EP7_OUT_RESET, 0x0
.equ	USB_EP_STATUS_STALL_NAK_EP7_OUT_BITS, 0x00008000
.equ	USB_EP_STATUS_STALL_NAK_EP7_OUT_MSB, 15
.equ	USB_EP_STATUS_STALL_NAK_EP7_OUT_LSB, 15
# -----------------------------------------------------------------------------
# Field       : USB_EP_STATUS_STALL_NAK_EP7_IN
.equ	USB_EP_STATUS_STALL_NAK_EP7_IN_RESET, 0x0
.equ	USB_EP_STATUS_STALL_NAK_EP7_IN_BITS, 0x00004000
.equ	USB_EP_STATUS_STALL_NAK_EP7_IN_MSB, 14
.equ	USB_EP_STATUS_STALL_NAK_EP7_IN_LSB, 14
# -----------------------------------------------------------------------------
# Field       : USB_EP_STATUS_STALL_NAK_EP6_OUT
.equ	USB_EP_STATUS_STALL_NAK_EP6_OUT_RESET, 0x0
.equ	USB_EP_STATUS_STALL_NAK_EP6_OUT_BITS, 0x00002000
.equ	USB_EP_STATUS_STALL_NAK_EP6_OUT_MSB, 13
.equ	USB_EP_STATUS_STALL_NAK_EP6_OUT_LSB, 13
# -----------------------------------------------------------------------------
# Field       : USB_EP_STATUS_STALL_NAK_EP6_IN
.equ	USB_EP_STATUS_STALL_NAK_EP6_IN_RESET, 0x0
.equ	USB_EP_STATUS_STALL_NAK_EP6_IN_BITS, 0x00001000
.equ	USB_EP_STATUS_STALL_NAK_EP6_IN_MSB, 12
.equ	USB_EP_STATUS_STALL_NAK_EP6_IN_LSB, 12
# -----------------------------------------------------------------------------
# Field       : USB_EP_STATUS_STALL_NAK_EP5_OUT
.equ	USB_EP_STATUS_STALL_NAK_EP5_OUT_RESET, 0x0
.equ	USB_EP_STATUS_STALL_NAK_EP5_OUT_BITS, 0x00000800
.equ	USB_EP_STATUS_STALL_NAK_EP5_OUT_MSB, 11
.equ	USB_EP_STATUS_STALL_NAK_EP5_OUT_LSB, 11
# -----------------------------------------------------------------------------
# Field       : USB_EP_STATUS_STALL_NAK_EP5_IN
.equ	USB_EP_STATUS_STALL_NAK_EP5_IN_RESET, 0x0
.equ	USB_EP_STATUS_STALL_NAK_EP5_IN_BITS, 0x00000400
.equ	USB_EP_STATUS_STALL_NAK_EP5_IN_MSB, 10
.equ	USB_EP_STATUS_STALL_NAK_EP5_IN_LSB, 10
# -----------------------------------------------------------------------------
# Field       : USB_EP_STATUS_STALL_NAK_EP4_OUT
.equ	USB_EP_STATUS_STALL_NAK_EP4_OUT_RESET, 0x0
.equ	USB_EP_STATUS_STALL_NAK_EP4_OUT_BITS, 0x00000200
.equ	USB_EP_STATUS_STALL_NAK_EP4_OUT_MSB, 9
.equ	USB_EP_STATUS_STALL_NAK_EP4_OUT_LSB, 9
# -----------------------------------------------------------------------------
# Field       : USB_EP_STATUS_STALL_NAK_EP4_IN
.equ	USB_EP_STATUS_STALL_NAK_EP4_IN_RESET, 0x0
.equ	USB_EP_STATUS_STALL_NAK_EP4_IN_BITS, 0x00000100
.equ	USB_EP_STATUS_STALL_NAK_EP4_IN_MSB, 8
.equ	USB_EP_STATUS_STALL_NAK_EP4_IN_LSB, 8
# -----------------------------------------------------------------------------
# Field       : USB_EP_STATUS_STALL_NAK_EP3_OUT
.equ	USB_EP_STATUS_STALL_NAK_EP3_OUT_RESET, 0x0
.equ	USB_EP_STATUS_STALL_NAK_EP3_OUT_BITS, 0x00000080
.equ	USB_EP_STATUS_STALL_NAK_EP3_OUT_MSB, 7
.equ	USB_EP_STATUS_STALL_NAK_EP3_OUT_LSB, 7
# -----------------------------------------------------------------------------
# Field       : USB_EP_STATUS_STALL_NAK_EP3_IN
.equ	USB_EP_STATUS_STALL_NAK_EP3_IN_RESET, 0x0
.equ	USB_EP_STATUS_STALL_NAK_EP3_IN_BITS, 0x00000040
.equ	USB_EP_STATUS_STALL_NAK_EP3_IN_MSB, 6
.equ	USB_EP_STATUS_STALL_NAK_EP3_IN_LSB, 6
# -----------------------------------------------------------------------------
# Field       : USB_EP_STATUS_STALL_NAK_EP2_OUT
.equ	USB_EP_STATUS_STALL_NAK_EP2_OUT_RESET, 0x0
.equ	USB_EP_STATUS_STALL_NAK_EP2_OUT_BITS, 0x00000020
.equ	USB_EP_STATUS_STALL_NAK_EP2_OUT_MSB, 5
.equ	USB_EP_STATUS_STALL_NAK_EP2_OUT_LSB, 5
# -----------------------------------------------------------------------------
# Field       : USB_EP_STATUS_STALL_NAK_EP2_IN
.equ	USB_EP_STATUS_STALL_NAK_EP2_IN_RESET, 0x0
.equ	USB_EP_STATUS_STALL_NAK_EP2_IN_BITS, 0x00000010
.equ	USB_EP_STATUS_STALL_NAK_EP2_IN_MSB, 4
.equ	USB_EP_STATUS_STALL_NAK_EP2_IN_LSB, 4
# -----------------------------------------------------------------------------
# Field       : USB_EP_STATUS_STALL_NAK_EP1_OUT
.equ	USB_EP_STATUS_STALL_NAK_EP1_OUT_RESET, 0x0
.equ	USB_EP_STATUS_STALL_NAK_EP1_OUT_BITS, 0x00000008
.equ	USB_EP_STATUS_STALL_NAK_EP1_OUT_MSB, 3
.equ	USB_EP_STATUS_STALL_NAK_EP1_OUT_LSB, 3
# -----------------------------------------------------------------------------
# Field       : USB_EP_STATUS_STALL_NAK_EP1_IN
.equ	USB_EP_STATUS_STALL_NAK_EP1_IN_RESET, 0x0
.equ	USB_EP_STATUS_STALL_NAK_EP1_IN_BITS, 0x00000004
.equ	USB_EP_STATUS_STALL_NAK_EP1_IN_MSB, 2
.equ	USB_EP_STATUS_STALL_NAK_EP1_IN_LSB, 2
# -----------------------------------------------------------------------------
# Field       : USB_EP_STATUS_STALL_NAK_EP0_OUT
.equ	USB_EP_STATUS_STALL_NAK_EP0_OUT_RESET, 0x0
.equ	USB_EP_STATUS_STALL_NAK_EP0_OUT_BITS, 0x00000002
.equ	USB_EP_STATUS_STALL_NAK_EP0_OUT_MSB, 1
.equ	USB_EP_STATUS_STALL_NAK_EP0_OUT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : USB_EP_STATUS_STALL_NAK_EP0_IN
.equ	USB_EP_STATUS_STALL_NAK_EP0_IN_RESET, 0x0
.equ	USB_EP_STATUS_STALL_NAK_EP0_IN_BITS, 0x00000001
.equ	USB_EP_STATUS_STALL_NAK_EP0_IN_MSB, 0
.equ	USB_EP_STATUS_STALL_NAK_EP0_IN_LSB, 0
# =============================================================================
# Register    : USB_USB_MUXING
# Description : Where to connect the USB controller. Should be to_phy by
#               default.
.equ	USB_USB_MUXING_OFFSET, 0x00000074
.equ	USB_USB_MUXING_BITS, 0x8000001f
.equ	USB_USB_MUXING_RESET, 0x00000001
# -----------------------------------------------------------------------------
# Field       : USB_USB_MUXING_SWAP_DPDM
# Description : Swap the USB PHY DP and DM pins and all related controls and
#               flip receive differential data. Can be used to switch USB DP/DP
#               on the PCB.
#               This is done at a low level so overrides all other controls.
.equ	USB_USB_MUXING_SWAP_DPDM_RESET, 0x0
.equ	USB_USB_MUXING_SWAP_DPDM_BITS, 0x80000000
.equ	USB_USB_MUXING_SWAP_DPDM_MSB, 31
.equ	USB_USB_MUXING_SWAP_DPDM_LSB, 31
# -----------------------------------------------------------------------------
# Field       : USB_USB_MUXING_USBPHY_AS_GPIO
# Description : Use the usb DP and DM pins as GPIO pins instead of connecting
#               them to the USB controller.
.equ	USB_USB_MUXING_USBPHY_AS_GPIO_RESET, 0x0
.equ	USB_USB_MUXING_USBPHY_AS_GPIO_BITS, 0x00000010
.equ	USB_USB_MUXING_USBPHY_AS_GPIO_MSB, 4
.equ	USB_USB_MUXING_USBPHY_AS_GPIO_LSB, 4
# -----------------------------------------------------------------------------
# Field       : USB_USB_MUXING_SOFTCON
.equ	USB_USB_MUXING_SOFTCON_RESET, 0x0
.equ	USB_USB_MUXING_SOFTCON_BITS, 0x00000008
.equ	USB_USB_MUXING_SOFTCON_MSB, 3
.equ	USB_USB_MUXING_SOFTCON_LSB, 3
# -----------------------------------------------------------------------------
# Field       : USB_USB_MUXING_TO_DIGITAL_PAD
.equ	USB_USB_MUXING_TO_DIGITAL_PAD_RESET, 0x0
.equ	USB_USB_MUXING_TO_DIGITAL_PAD_BITS, 0x00000004
.equ	USB_USB_MUXING_TO_DIGITAL_PAD_MSB, 2
.equ	USB_USB_MUXING_TO_DIGITAL_PAD_LSB, 2
# -----------------------------------------------------------------------------
# Field       : USB_USB_MUXING_TO_EXTPHY
.equ	USB_USB_MUXING_TO_EXTPHY_RESET, 0x0
.equ	USB_USB_MUXING_TO_EXTPHY_BITS, 0x00000002
.equ	USB_USB_MUXING_TO_EXTPHY_MSB, 1
.equ	USB_USB_MUXING_TO_EXTPHY_LSB, 1
# -----------------------------------------------------------------------------
# Field       : USB_USB_MUXING_TO_PHY
.equ	USB_USB_MUXING_TO_PHY_RESET, 0x1
.equ	USB_USB_MUXING_TO_PHY_BITS, 0x00000001
.equ	USB_USB_MUXING_TO_PHY_MSB, 0
.equ	USB_USB_MUXING_TO_PHY_LSB, 0
# =============================================================================
# Register    : USB_USB_PWR
# Description : Overrides for the power signals in the event that the VBUS
#               signals are not hooked up to GPIO. Set the value of the
#               override and then the override enable to switch over to the
#               override value.
.equ	USB_USB_PWR_OFFSET, 0x00000078
.equ	USB_USB_PWR_BITS, 0x0000003f
.equ	USB_USB_PWR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_USB_PWR_OVERCURR_DETECT_EN
.equ	USB_USB_PWR_OVERCURR_DETECT_EN_RESET, 0x0
.equ	USB_USB_PWR_OVERCURR_DETECT_EN_BITS, 0x00000020
.equ	USB_USB_PWR_OVERCURR_DETECT_EN_MSB, 5
.equ	USB_USB_PWR_OVERCURR_DETECT_EN_LSB, 5
# -----------------------------------------------------------------------------
# Field       : USB_USB_PWR_OVERCURR_DETECT
.equ	USB_USB_PWR_OVERCURR_DETECT_RESET, 0x0
.equ	USB_USB_PWR_OVERCURR_DETECT_BITS, 0x00000010
.equ	USB_USB_PWR_OVERCURR_DETECT_MSB, 4
.equ	USB_USB_PWR_OVERCURR_DETECT_LSB, 4
# -----------------------------------------------------------------------------
# Field       : USB_USB_PWR_VBUS_DETECT_OVERRIDE_EN
.equ	USB_USB_PWR_VBUS_DETECT_OVERRIDE_EN_RESET, 0x0
.equ	USB_USB_PWR_VBUS_DETECT_OVERRIDE_EN_BITS, 0x00000008
.equ	USB_USB_PWR_VBUS_DETECT_OVERRIDE_EN_MSB, 3
.equ	USB_USB_PWR_VBUS_DETECT_OVERRIDE_EN_LSB, 3
# -----------------------------------------------------------------------------
# Field       : USB_USB_PWR_VBUS_DETECT
.equ	USB_USB_PWR_VBUS_DETECT_RESET, 0x0
.equ	USB_USB_PWR_VBUS_DETECT_BITS, 0x00000004
.equ	USB_USB_PWR_VBUS_DETECT_MSB, 2
.equ	USB_USB_PWR_VBUS_DETECT_LSB, 2
# -----------------------------------------------------------------------------
# Field       : USB_USB_PWR_VBUS_EN_OVERRIDE_EN
.equ	USB_USB_PWR_VBUS_EN_OVERRIDE_EN_RESET, 0x0
.equ	USB_USB_PWR_VBUS_EN_OVERRIDE_EN_BITS, 0x00000002
.equ	USB_USB_PWR_VBUS_EN_OVERRIDE_EN_MSB, 1
.equ	USB_USB_PWR_VBUS_EN_OVERRIDE_EN_LSB, 1
# -----------------------------------------------------------------------------
# Field       : USB_USB_PWR_VBUS_EN
.equ	USB_USB_PWR_VBUS_EN_RESET, 0x0
.equ	USB_USB_PWR_VBUS_EN_BITS, 0x00000001
.equ	USB_USB_PWR_VBUS_EN_MSB, 0
.equ	USB_USB_PWR_VBUS_EN_LSB, 0
# =============================================================================
# Register    : USB_USBPHY_DIRECT
# Description : This register allows for direct control of the USB phy. Use in
#               conjunction with usbphy_direct_override register to enable each
#               override bit.
.equ	USB_USBPHY_DIRECT_OFFSET, 0x0000007c
.equ	USB_USBPHY_DIRECT_BITS, 0x03ffff77
.equ	USB_USBPHY_DIRECT_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_USBPHY_DIRECT_RX_DM_OVERRIDE
# Description : Override rx_dm value into controller
.equ	USB_USBPHY_DIRECT_RX_DM_OVERRIDE_RESET, 0x0
.equ	USB_USBPHY_DIRECT_RX_DM_OVERRIDE_BITS, 0x02000000
.equ	USB_USBPHY_DIRECT_RX_DM_OVERRIDE_MSB, 25
.equ	USB_USBPHY_DIRECT_RX_DM_OVERRIDE_LSB, 25
# -----------------------------------------------------------------------------
# Field       : USB_USBPHY_DIRECT_RX_DP_OVERRIDE
# Description : Override rx_dp value into controller
.equ	USB_USBPHY_DIRECT_RX_DP_OVERRIDE_RESET, 0x0
.equ	USB_USBPHY_DIRECT_RX_DP_OVERRIDE_BITS, 0x01000000
.equ	USB_USBPHY_DIRECT_RX_DP_OVERRIDE_MSB, 24
.equ	USB_USBPHY_DIRECT_RX_DP_OVERRIDE_LSB, 24
# -----------------------------------------------------------------------------
# Field       : USB_USBPHY_DIRECT_RX_DD_OVERRIDE
# Description : Override rx_dd value into controller
.equ	USB_USBPHY_DIRECT_RX_DD_OVERRIDE_RESET, 0x0
.equ	USB_USBPHY_DIRECT_RX_DD_OVERRIDE_BITS, 0x00800000
.equ	USB_USBPHY_DIRECT_RX_DD_OVERRIDE_MSB, 23
.equ	USB_USBPHY_DIRECT_RX_DD_OVERRIDE_LSB, 23
# -----------------------------------------------------------------------------
# Field       : USB_USBPHY_DIRECT_DM_OVV
# Description : DM over voltage
.equ	USB_USBPHY_DIRECT_DM_OVV_RESET, 0x0
.equ	USB_USBPHY_DIRECT_DM_OVV_BITS, 0x00400000
.equ	USB_USBPHY_DIRECT_DM_OVV_MSB, 22
.equ	USB_USBPHY_DIRECT_DM_OVV_LSB, 22
# -----------------------------------------------------------------------------
# Field       : USB_USBPHY_DIRECT_DP_OVV
# Description : DP over voltage
.equ	USB_USBPHY_DIRECT_DP_OVV_RESET, 0x0
.equ	USB_USBPHY_DIRECT_DP_OVV_BITS, 0x00200000
.equ	USB_USBPHY_DIRECT_DP_OVV_MSB, 21
.equ	USB_USBPHY_DIRECT_DP_OVV_LSB, 21
# -----------------------------------------------------------------------------
# Field       : USB_USBPHY_DIRECT_DM_OVCN
# Description : DM overcurrent
.equ	USB_USBPHY_DIRECT_DM_OVCN_RESET, 0x0
.equ	USB_USBPHY_DIRECT_DM_OVCN_BITS, 0x00100000
.equ	USB_USBPHY_DIRECT_DM_OVCN_MSB, 20
.equ	USB_USBPHY_DIRECT_DM_OVCN_LSB, 20
# -----------------------------------------------------------------------------
# Field       : USB_USBPHY_DIRECT_DP_OVCN
# Description : DP overcurrent
.equ	USB_USBPHY_DIRECT_DP_OVCN_RESET, 0x0
.equ	USB_USBPHY_DIRECT_DP_OVCN_BITS, 0x00080000
.equ	USB_USBPHY_DIRECT_DP_OVCN_MSB, 19
.equ	USB_USBPHY_DIRECT_DP_OVCN_LSB, 19
# -----------------------------------------------------------------------------
# Field       : USB_USBPHY_DIRECT_RX_DM
# Description : DPM pin state
.equ	USB_USBPHY_DIRECT_RX_DM_RESET, 0x0
.equ	USB_USBPHY_DIRECT_RX_DM_BITS, 0x00040000
.equ	USB_USBPHY_DIRECT_RX_DM_MSB, 18
.equ	USB_USBPHY_DIRECT_RX_DM_LSB, 18
# -----------------------------------------------------------------------------
# Field       : USB_USBPHY_DIRECT_RX_DP
# Description : DPP pin state
.equ	USB_USBPHY_DIRECT_RX_DP_RESET, 0x0
.equ	USB_USBPHY_DIRECT_RX_DP_BITS, 0x00020000
.equ	USB_USBPHY_DIRECT_RX_DP_MSB, 17
.equ	USB_USBPHY_DIRECT_RX_DP_LSB, 17
# -----------------------------------------------------------------------------
# Field       : USB_USBPHY_DIRECT_RX_DD
# Description : Differential RX
.equ	USB_USBPHY_DIRECT_RX_DD_RESET, 0x0
.equ	USB_USBPHY_DIRECT_RX_DD_BITS, 0x00010000
.equ	USB_USBPHY_DIRECT_RX_DD_MSB, 16
.equ	USB_USBPHY_DIRECT_RX_DD_LSB, 16
# -----------------------------------------------------------------------------
# Field       : USB_USBPHY_DIRECT_TX_DIFFMODE
# Description : TX_DIFFMODE=0: Single ended mode
#               TX_DIFFMODE=1: Differential drive mode (TX_DM, TX_DM_OE
#               ignored)
.equ	USB_USBPHY_DIRECT_TX_DIFFMODE_RESET, 0x0
.equ	USB_USBPHY_DIRECT_TX_DIFFMODE_BITS, 0x00008000
.equ	USB_USBPHY_DIRECT_TX_DIFFMODE_MSB, 15
.equ	USB_USBPHY_DIRECT_TX_DIFFMODE_LSB, 15
# -----------------------------------------------------------------------------
# Field       : USB_USBPHY_DIRECT_TX_FSSLEW
# Description : TX_FSSLEW=0: Low speed slew rate
#               TX_FSSLEW=1: Full speed slew rate
.equ	USB_USBPHY_DIRECT_TX_FSSLEW_RESET, 0x0
.equ	USB_USBPHY_DIRECT_TX_FSSLEW_BITS, 0x00004000
.equ	USB_USBPHY_DIRECT_TX_FSSLEW_MSB, 14
.equ	USB_USBPHY_DIRECT_TX_FSSLEW_LSB, 14
# -----------------------------------------------------------------------------
# Field       : USB_USBPHY_DIRECT_TX_PD
# Description : TX power down override (if override enable is set). 1 = powered
#               down.
.equ	USB_USBPHY_DIRECT_TX_PD_RESET, 0x0
.equ	USB_USBPHY_DIRECT_TX_PD_BITS, 0x00002000
.equ	USB_USBPHY_DIRECT_TX_PD_MSB, 13
.equ	USB_USBPHY_DIRECT_TX_PD_LSB, 13
# -----------------------------------------------------------------------------
# Field       : USB_USBPHY_DIRECT_RX_PD
# Description : RX power down override (if override enable is set). 1 = powered
#               down.
.equ	USB_USBPHY_DIRECT_RX_PD_RESET, 0x0
.equ	USB_USBPHY_DIRECT_RX_PD_BITS, 0x00001000
.equ	USB_USBPHY_DIRECT_RX_PD_MSB, 12
.equ	USB_USBPHY_DIRECT_RX_PD_LSB, 12
# -----------------------------------------------------------------------------
# Field       : USB_USBPHY_DIRECT_TX_DM
# Description : Output data. TX_DIFFMODE=1, Ignored
#               TX_DIFFMODE=0, Drives DPM only. TX_DM_OE=1 to enable drive.
#               DPM=TX_DM
.equ	USB_USBPHY_DIRECT_TX_DM_RESET, 0x0
.equ	USB_USBPHY_DIRECT_TX_DM_BITS, 0x00000800
.equ	USB_USBPHY_DIRECT_TX_DM_MSB, 11
.equ	USB_USBPHY_DIRECT_TX_DM_LSB, 11
# -----------------------------------------------------------------------------
# Field       : USB_USBPHY_DIRECT_TX_DP
# Description : Output data. If TX_DIFFMODE=1, Drives DPP/DPM diff pair.
#               TX_DP_OE=1 to enable drive. DPP=TX_DP, DPM=~TX_DP
#               If TX_DIFFMODE=0, Drives DPP only. TX_DP_OE=1 to enable drive.
#               DPP=TX_DP
.equ	USB_USBPHY_DIRECT_TX_DP_RESET, 0x0
.equ	USB_USBPHY_DIRECT_TX_DP_BITS, 0x00000400
.equ	USB_USBPHY_DIRECT_TX_DP_MSB, 10
.equ	USB_USBPHY_DIRECT_TX_DP_LSB, 10
# -----------------------------------------------------------------------------
# Field       : USB_USBPHY_DIRECT_TX_DM_OE
# Description : Output enable. If TX_DIFFMODE=1, Ignored.
#               If TX_DIFFMODE=0, OE for DPM only. 0 - DPM in Hi-Z state; 1 -
#               DPM driving
.equ	USB_USBPHY_DIRECT_TX_DM_OE_RESET, 0x0
.equ	USB_USBPHY_DIRECT_TX_DM_OE_BITS, 0x00000200
.equ	USB_USBPHY_DIRECT_TX_DM_OE_MSB, 9
.equ	USB_USBPHY_DIRECT_TX_DM_OE_LSB, 9
# -----------------------------------------------------------------------------
# Field       : USB_USBPHY_DIRECT_TX_DP_OE
# Description : Output enable. If TX_DIFFMODE=1, OE for DPP/DPM diff pair. 0 -
#               DPP/DPM in Hi-Z state; 1 - DPP/DPM driving
#               If TX_DIFFMODE=0, OE for DPP only. 0 - DPP in Hi-Z state; 1 -
#               DPP driving
.equ	USB_USBPHY_DIRECT_TX_DP_OE_RESET, 0x0
.equ	USB_USBPHY_DIRECT_TX_DP_OE_BITS, 0x00000100
.equ	USB_USBPHY_DIRECT_TX_DP_OE_MSB, 8
.equ	USB_USBPHY_DIRECT_TX_DP_OE_LSB, 8
# -----------------------------------------------------------------------------
# Field       : USB_USBPHY_DIRECT_DM_PULLDN_EN
# Description : DM pull down enable
.equ	USB_USBPHY_DIRECT_DM_PULLDN_EN_RESET, 0x0
.equ	USB_USBPHY_DIRECT_DM_PULLDN_EN_BITS, 0x00000040
.equ	USB_USBPHY_DIRECT_DM_PULLDN_EN_MSB, 6
.equ	USB_USBPHY_DIRECT_DM_PULLDN_EN_LSB, 6
# -----------------------------------------------------------------------------
# Field       : USB_USBPHY_DIRECT_DM_PULLUP_EN
# Description : DM pull up enable
.equ	USB_USBPHY_DIRECT_DM_PULLUP_EN_RESET, 0x0
.equ	USB_USBPHY_DIRECT_DM_PULLUP_EN_BITS, 0x00000020
.equ	USB_USBPHY_DIRECT_DM_PULLUP_EN_MSB, 5
.equ	USB_USBPHY_DIRECT_DM_PULLUP_EN_LSB, 5
# -----------------------------------------------------------------------------
# Field       : USB_USBPHY_DIRECT_DM_PULLUP_HISEL
# Description : Enable the second DM pull up resistor. 0 - Pull = Rpu2; 1 -
#               Pull = Rpu1 + Rpu2
.equ	USB_USBPHY_DIRECT_DM_PULLUP_HISEL_RESET, 0x0
.equ	USB_USBPHY_DIRECT_DM_PULLUP_HISEL_BITS, 0x00000010
.equ	USB_USBPHY_DIRECT_DM_PULLUP_HISEL_MSB, 4
.equ	USB_USBPHY_DIRECT_DM_PULLUP_HISEL_LSB, 4
# -----------------------------------------------------------------------------
# Field       : USB_USBPHY_DIRECT_DP_PULLDN_EN
# Description : DP pull down enable
.equ	USB_USBPHY_DIRECT_DP_PULLDN_EN_RESET, 0x0
.equ	USB_USBPHY_DIRECT_DP_PULLDN_EN_BITS, 0x00000004
.equ	USB_USBPHY_DIRECT_DP_PULLDN_EN_MSB, 2
.equ	USB_USBPHY_DIRECT_DP_PULLDN_EN_LSB, 2
# -----------------------------------------------------------------------------
# Field       : USB_USBPHY_DIRECT_DP_PULLUP_EN
# Description : DP pull up enable
.equ	USB_USBPHY_DIRECT_DP_PULLUP_EN_RESET, 0x0
.equ	USB_USBPHY_DIRECT_DP_PULLUP_EN_BITS, 0x00000002
.equ	USB_USBPHY_DIRECT_DP_PULLUP_EN_MSB, 1
.equ	USB_USBPHY_DIRECT_DP_PULLUP_EN_LSB, 1
# -----------------------------------------------------------------------------
# Field       : USB_USBPHY_DIRECT_DP_PULLUP_HISEL
# Description : Enable the second DP pull up resistor. 0 - Pull = Rpu2; 1 -
#               Pull = Rpu1 + Rpu2
.equ	USB_USBPHY_DIRECT_DP_PULLUP_HISEL_RESET, 0x0
.equ	USB_USBPHY_DIRECT_DP_PULLUP_HISEL_BITS, 0x00000001
.equ	USB_USBPHY_DIRECT_DP_PULLUP_HISEL_MSB, 0
.equ	USB_USBPHY_DIRECT_DP_PULLUP_HISEL_LSB, 0
# =============================================================================
# Register    : USB_USBPHY_DIRECT_OVERRIDE
# Description : Override enable for each control in usbphy_direct
.equ	USB_USBPHY_DIRECT_OVERRIDE_OFFSET, 0x00000080
.equ	USB_USBPHY_DIRECT_OVERRIDE_BITS, 0x00079fff
.equ	USB_USBPHY_DIRECT_OVERRIDE_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_USBPHY_DIRECT_OVERRIDE_RX_DM_OVERRIDE_EN
.equ	USB_USBPHY_DIRECT_OVERRIDE_RX_DM_OVERRIDE_EN_RESET, 0x0
.equ	USB_USBPHY_DIRECT_OVERRIDE_RX_DM_OVERRIDE_EN_BITS, 0x00040000
.equ	USB_USBPHY_DIRECT_OVERRIDE_RX_DM_OVERRIDE_EN_MSB, 18
.equ	USB_USBPHY_DIRECT_OVERRIDE_RX_DM_OVERRIDE_EN_LSB, 18
# -----------------------------------------------------------------------------
# Field       : USB_USBPHY_DIRECT_OVERRIDE_RX_DP_OVERRIDE_EN
.equ	USB_USBPHY_DIRECT_OVERRIDE_RX_DP_OVERRIDE_EN_RESET, 0x0
.equ	USB_USBPHY_DIRECT_OVERRIDE_RX_DP_OVERRIDE_EN_BITS, 0x00020000
.equ	USB_USBPHY_DIRECT_OVERRIDE_RX_DP_OVERRIDE_EN_MSB, 17
.equ	USB_USBPHY_DIRECT_OVERRIDE_RX_DP_OVERRIDE_EN_LSB, 17
# -----------------------------------------------------------------------------
# Field       : USB_USBPHY_DIRECT_OVERRIDE_RX_DD_OVERRIDE_EN
.equ	USB_USBPHY_DIRECT_OVERRIDE_RX_DD_OVERRIDE_EN_RESET, 0x0
.equ	USB_USBPHY_DIRECT_OVERRIDE_RX_DD_OVERRIDE_EN_BITS, 0x00010000
.equ	USB_USBPHY_DIRECT_OVERRIDE_RX_DD_OVERRIDE_EN_MSB, 16
.equ	USB_USBPHY_DIRECT_OVERRIDE_RX_DD_OVERRIDE_EN_LSB, 16
# -----------------------------------------------------------------------------
# Field       : USB_USBPHY_DIRECT_OVERRIDE_TX_DIFFMODE_OVERRIDE_EN
.equ	USB_USBPHY_DIRECT_OVERRIDE_TX_DIFFMODE_OVERRIDE_EN_RESET, 0x0
.equ	USB_USBPHY_DIRECT_OVERRIDE_TX_DIFFMODE_OVERRIDE_EN_BITS, 0x00008000
.equ	USB_USBPHY_DIRECT_OVERRIDE_TX_DIFFMODE_OVERRIDE_EN_MSB, 15
.equ	USB_USBPHY_DIRECT_OVERRIDE_TX_DIFFMODE_OVERRIDE_EN_LSB, 15
# -----------------------------------------------------------------------------
# Field       : USB_USBPHY_DIRECT_OVERRIDE_DM_PULLUP_OVERRIDE_EN
.equ	USB_USBPHY_DIRECT_OVERRIDE_DM_PULLUP_OVERRIDE_EN_RESET, 0x0
.equ	USB_USBPHY_DIRECT_OVERRIDE_DM_PULLUP_OVERRIDE_EN_BITS, 0x00001000
.equ	USB_USBPHY_DIRECT_OVERRIDE_DM_PULLUP_OVERRIDE_EN_MSB, 12
.equ	USB_USBPHY_DIRECT_OVERRIDE_DM_PULLUP_OVERRIDE_EN_LSB, 12
# -----------------------------------------------------------------------------
# Field       : USB_USBPHY_DIRECT_OVERRIDE_TX_FSSLEW_OVERRIDE_EN
.equ	USB_USBPHY_DIRECT_OVERRIDE_TX_FSSLEW_OVERRIDE_EN_RESET, 0x0
.equ	USB_USBPHY_DIRECT_OVERRIDE_TX_FSSLEW_OVERRIDE_EN_BITS, 0x00000800
.equ	USB_USBPHY_DIRECT_OVERRIDE_TX_FSSLEW_OVERRIDE_EN_MSB, 11
.equ	USB_USBPHY_DIRECT_OVERRIDE_TX_FSSLEW_OVERRIDE_EN_LSB, 11
# -----------------------------------------------------------------------------
# Field       : USB_USBPHY_DIRECT_OVERRIDE_TX_PD_OVERRIDE_EN
.equ	USB_USBPHY_DIRECT_OVERRIDE_TX_PD_OVERRIDE_EN_RESET, 0x0
.equ	USB_USBPHY_DIRECT_OVERRIDE_TX_PD_OVERRIDE_EN_BITS, 0x00000400
