konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/usb.inc
.equ	USB_USBPHY_DIRECT_OVERRIDE_TX_PD_OVERRIDE_EN_MSB, 10
.equ	USB_USBPHY_DIRECT_OVERRIDE_TX_PD_OVERRIDE_EN_LSB, 10
# -----------------------------------------------------------------------------
# Field       : USB_USBPHY_DIRECT_OVERRIDE_RX_PD_OVERRIDE_EN
.equ	USB_USBPHY_DIRECT_OVERRIDE_RX_PD_OVERRIDE_EN_RESET, 0x0
.equ	USB_USBPHY_DIRECT_OVERRIDE_RX_PD_OVERRIDE_EN_BITS, 0x00000200
.equ	USB_USBPHY_DIRECT_OVERRIDE_RX_PD_OVERRIDE_EN_MSB, 9
.equ	USB_USBPHY_DIRECT_OVERRIDE_RX_PD_OVERRIDE_EN_LSB, 9
# -----------------------------------------------------------------------------
# Field       : USB_USBPHY_DIRECT_OVERRIDE_TX_DM_OVERRIDE_EN
.equ	USB_USBPHY_DIRECT_OVERRIDE_TX_DM_OVERRIDE_EN_RESET, 0x0
.equ	USB_USBPHY_DIRECT_OVERRIDE_TX_DM_OVERRIDE_EN_BITS, 0x00000100
.equ	USB_USBPHY_DIRECT_OVERRIDE_TX_DM_OVERRIDE_EN_MSB, 8
.equ	USB_USBPHY_DIRECT_OVERRIDE_TX_DM_OVERRIDE_EN_LSB, 8
# -----------------------------------------------------------------------------
# Field       : USB_USBPHY_DIRECT_OVERRIDE_TX_DP_OVERRIDE_EN
.equ	USB_USBPHY_DIRECT_OVERRIDE_TX_DP_OVERRIDE_EN_RESET, 0x0
.equ	USB_USBPHY_DIRECT_OVERRIDE_TX_DP_OVERRIDE_EN_BITS, 0x00000080
.equ	USB_USBPHY_DIRECT_OVERRIDE_TX_DP_OVERRIDE_EN_MSB, 7
.equ	USB_USBPHY_DIRECT_OVERRIDE_TX_DP_OVERRIDE_EN_LSB, 7
# -----------------------------------------------------------------------------
# Field       : USB_USBPHY_DIRECT_OVERRIDE_TX_DM_OE_OVERRIDE_EN
.equ	USB_USBPHY_DIRECT_OVERRIDE_TX_DM_OE_OVERRIDE_EN_RESET, 0x0
.equ	USB_USBPHY_DIRECT_OVERRIDE_TX_DM_OE_OVERRIDE_EN_BITS, 0x00000040
.equ	USB_USBPHY_DIRECT_OVERRIDE_TX_DM_OE_OVERRIDE_EN_MSB, 6
.equ	USB_USBPHY_DIRECT_OVERRIDE_TX_DM_OE_OVERRIDE_EN_LSB, 6
# -----------------------------------------------------------------------------
# Field       : USB_USBPHY_DIRECT_OVERRIDE_TX_DP_OE_OVERRIDE_EN
.equ	USB_USBPHY_DIRECT_OVERRIDE_TX_DP_OE_OVERRIDE_EN_RESET, 0x0
.equ	USB_USBPHY_DIRECT_OVERRIDE_TX_DP_OE_OVERRIDE_EN_BITS, 0x00000020
.equ	USB_USBPHY_DIRECT_OVERRIDE_TX_DP_OE_OVERRIDE_EN_MSB, 5
.equ	USB_USBPHY_DIRECT_OVERRIDE_TX_DP_OE_OVERRIDE_EN_LSB, 5
# -----------------------------------------------------------------------------
# Field       : USB_USBPHY_DIRECT_OVERRIDE_DM_PULLDN_EN_OVERRIDE_EN
.equ	USB_USBPHY_DIRECT_OVERRIDE_DM_PULLDN_EN_OVERRIDE_EN_RESET, 0x0
.equ	USB_USBPHY_DIRECT_OVERRIDE_DM_PULLDN_EN_OVERRIDE_EN_BITS, 0x00000010
.equ	USB_USBPHY_DIRECT_OVERRIDE_DM_PULLDN_EN_OVERRIDE_EN_MSB, 4
.equ	USB_USBPHY_DIRECT_OVERRIDE_DM_PULLDN_EN_OVERRIDE_EN_LSB, 4
# -----------------------------------------------------------------------------
# Field       : USB_USBPHY_DIRECT_OVERRIDE_DP_PULLDN_EN_OVERRIDE_EN
.equ	USB_USBPHY_DIRECT_OVERRIDE_DP_PULLDN_EN_OVERRIDE_EN_RESET, 0x0
.equ	USB_USBPHY_DIRECT_OVERRIDE_DP_PULLDN_EN_OVERRIDE_EN_BITS, 0x00000008
.equ	USB_USBPHY_DIRECT_OVERRIDE_DP_PULLDN_EN_OVERRIDE_EN_MSB, 3
.equ	USB_USBPHY_DIRECT_OVERRIDE_DP_PULLDN_EN_OVERRIDE_EN_LSB, 3
# -----------------------------------------------------------------------------
# Field       : USB_USBPHY_DIRECT_OVERRIDE_DP_PULLUP_EN_OVERRIDE_EN
.equ	USB_USBPHY_DIRECT_OVERRIDE_DP_PULLUP_EN_OVERRIDE_EN_RESET, 0x0
.equ	USB_USBPHY_DIRECT_OVERRIDE_DP_PULLUP_EN_OVERRIDE_EN_BITS, 0x00000004
.equ	USB_USBPHY_DIRECT_OVERRIDE_DP_PULLUP_EN_OVERRIDE_EN_MSB, 2
.equ	USB_USBPHY_DIRECT_OVERRIDE_DP_PULLUP_EN_OVERRIDE_EN_LSB, 2
# -----------------------------------------------------------------------------
# Field       : USB_USBPHY_DIRECT_OVERRIDE_DM_PULLUP_HISEL_OVERRIDE_EN
.equ	USB_USBPHY_DIRECT_OVERRIDE_DM_PULLUP_HISEL_OVERRIDE_EN_RESET, 0x0
.equ	USB_USBPHY_DIRECT_OVERRIDE_DM_PULLUP_HISEL_OVERRIDE_EN_BITS, 0x00000002
.equ	USB_USBPHY_DIRECT_OVERRIDE_DM_PULLUP_HISEL_OVERRIDE_EN_MSB, 1
.equ	USB_USBPHY_DIRECT_OVERRIDE_DM_PULLUP_HISEL_OVERRIDE_EN_LSB, 1
# -----------------------------------------------------------------------------
# Field       : USB_USBPHY_DIRECT_OVERRIDE_DP_PULLUP_HISEL_OVERRIDE_EN
.equ	USB_USBPHY_DIRECT_OVERRIDE_DP_PULLUP_HISEL_OVERRIDE_EN_RESET, 0x0
.equ	USB_USBPHY_DIRECT_OVERRIDE_DP_PULLUP_HISEL_OVERRIDE_EN_BITS, 0x00000001
.equ	USB_USBPHY_DIRECT_OVERRIDE_DP_PULLUP_HISEL_OVERRIDE_EN_MSB, 0
.equ	USB_USBPHY_DIRECT_OVERRIDE_DP_PULLUP_HISEL_OVERRIDE_EN_LSB, 0
# =============================================================================
# Register    : USB_USBPHY_TRIM
# Description : Used to adjust trim values of USB phy pull down resistors.
.equ	USB_USBPHY_TRIM_OFFSET, 0x00000084
.equ	USB_USBPHY_TRIM_BITS, 0x00001f1f
.equ	USB_USBPHY_TRIM_RESET, 0x00001f1f
# -----------------------------------------------------------------------------
# Field       : USB_USBPHY_TRIM_DM_PULLDN_TRIM
# Description : Value to drive to USB PHY
#               DM pulldown resistor trim control
#               Experimental data suggests that the reset value will work, but
#               this register allows adjustment if required
.equ	USB_USBPHY_TRIM_DM_PULLDN_TRIM_RESET, 0x1f
.equ	USB_USBPHY_TRIM_DM_PULLDN_TRIM_BITS, 0x00001f00
.equ	USB_USBPHY_TRIM_DM_PULLDN_TRIM_MSB, 12
.equ	USB_USBPHY_TRIM_DM_PULLDN_TRIM_LSB, 8
# -----------------------------------------------------------------------------
# Field       : USB_USBPHY_TRIM_DP_PULLDN_TRIM
# Description : Value to drive to USB PHY
#               DP pulldown resistor trim control
#               Experimental data suggests that the reset value will work, but
#               this register allows adjustment if required
.equ	USB_USBPHY_TRIM_DP_PULLDN_TRIM_RESET, 0x1f
.equ	USB_USBPHY_TRIM_DP_PULLDN_TRIM_BITS, 0x0000001f
.equ	USB_USBPHY_TRIM_DP_PULLDN_TRIM_MSB, 4
.equ	USB_USBPHY_TRIM_DP_PULLDN_TRIM_LSB, 0
# =============================================================================
# Register    : USB_LINESTATE_TUNING
# Description : Used for debug only.
.equ	USB_LINESTATE_TUNING_OFFSET, 0x00000088
.equ	USB_LINESTATE_TUNING_BITS, 0x00000fff
.equ	USB_LINESTATE_TUNING_RESET, 0x000000f8
# -----------------------------------------------------------------------------
# Field       : USB_LINESTATE_TUNING_SPARE_FIX
.equ	USB_LINESTATE_TUNING_SPARE_FIX_RESET, 0x0
.equ	USB_LINESTATE_TUNING_SPARE_FIX_BITS, 0x00000f00
.equ	USB_LINESTATE_TUNING_SPARE_FIX_MSB, 11
.equ	USB_LINESTATE_TUNING_SPARE_FIX_LSB, 8
# -----------------------------------------------------------------------------
# Field       : USB_LINESTATE_TUNING_DEV_LS_WAKE_FIX
# Description : Device - exit suspend on any non-idle signalling, not qualified
#               with a 1ms timer
.equ	USB_LINESTATE_TUNING_DEV_LS_WAKE_FIX_RESET, 0x1
.equ	USB_LINESTATE_TUNING_DEV_LS_WAKE_FIX_BITS, 0x00000080
.equ	USB_LINESTATE_TUNING_DEV_LS_WAKE_FIX_MSB, 7
.equ	USB_LINESTATE_TUNING_DEV_LS_WAKE_FIX_LSB, 7
# -----------------------------------------------------------------------------
# Field       : USB_LINESTATE_TUNING_DEV_RX_ERR_QUIESCE
# Description : Device - suppress repeated errors until the device FSM is next
#               in the process of decoding an inbound packet.
.equ	USB_LINESTATE_TUNING_DEV_RX_ERR_QUIESCE_RESET, 0x1
.equ	USB_LINESTATE_TUNING_DEV_RX_ERR_QUIESCE_BITS, 0x00000040
.equ	USB_LINESTATE_TUNING_DEV_RX_ERR_QUIESCE_MSB, 6
.equ	USB_LINESTATE_TUNING_DEV_RX_ERR_QUIESCE_LSB, 6
# -----------------------------------------------------------------------------
# Field       : USB_LINESTATE_TUNING_SIE_RX_CHATTER_SE0_FIX
# Description : RX - when recovering from line chatter or bitstuff errors,
#               treat SE0 as the end of chatter as well as
#               8 consecutive idle bits.
.equ	USB_LINESTATE_TUNING_SIE_RX_CHATTER_SE0_FIX_RESET, 0x1
.equ	USB_LINESTATE_TUNING_SIE_RX_CHATTER_SE0_FIX_BITS, 0x00000020
.equ	USB_LINESTATE_TUNING_SIE_RX_CHATTER_SE0_FIX_MSB, 5
.equ	USB_LINESTATE_TUNING_SIE_RX_CHATTER_SE0_FIX_LSB, 5
# -----------------------------------------------------------------------------
# Field       : USB_LINESTATE_TUNING_SIE_RX_BITSTUFF_FIX
# Description : RX - when a bitstuff error is signalled by rx_dasm,
#               unconditionally terminate RX decode to
#               avoid a hang during certain packet phases.
.equ	USB_LINESTATE_TUNING_SIE_RX_BITSTUFF_FIX_RESET, 0x1
.equ	USB_LINESTATE_TUNING_SIE_RX_BITSTUFF_FIX_BITS, 0x00000010
.equ	USB_LINESTATE_TUNING_SIE_RX_BITSTUFF_FIX_MSB, 4
.equ	USB_LINESTATE_TUNING_SIE_RX_BITSTUFF_FIX_LSB, 4
# -----------------------------------------------------------------------------
# Field       : USB_LINESTATE_TUNING_DEV_BUFF_CONTROL_DOUBLE_READ_FIX
# Description : Device - the controller FSM performs two reads of the buffer
#               status memory address to
#               avoid sampling metastable data. An enabled buffer is only used
#               if both reads match.
.equ	USB_LINESTATE_TUNING_DEV_BUFF_CONTROL_DOUBLE_READ_FIX_RESET, 0x1
.equ	USB_LINESTATE_TUNING_DEV_BUFF_CONTROL_DOUBLE_READ_FIX_BITS, 0x00000008
.equ	USB_LINESTATE_TUNING_DEV_BUFF_CONTROL_DOUBLE_READ_FIX_MSB, 3
.equ	USB_LINESTATE_TUNING_DEV_BUFF_CONTROL_DOUBLE_READ_FIX_LSB, 3
# -----------------------------------------------------------------------------
# Field       : USB_LINESTATE_TUNING_MULTI_HUB_FIX
# Description : Host - increase inter-packet and turnaround timeouts to
#               accommodate worst-case hub delays.
.equ	USB_LINESTATE_TUNING_MULTI_HUB_FIX_RESET, 0x0
.equ	USB_LINESTATE_TUNING_MULTI_HUB_FIX_BITS, 0x00000004
.equ	USB_LINESTATE_TUNING_MULTI_HUB_FIX_MSB, 2
.equ	USB_LINESTATE_TUNING_MULTI_HUB_FIX_LSB, 2
# -----------------------------------------------------------------------------
# Field       : USB_LINESTATE_TUNING_LINESTATE_DELAY
# Description : Device/Host - add an extra 1-bit debounce of linestate
#               sampling.
.equ	USB_LINESTATE_TUNING_LINESTATE_DELAY_RESET, 0x0
.equ	USB_LINESTATE_TUNING_LINESTATE_DELAY_BITS, 0x00000002
.equ	USB_LINESTATE_TUNING_LINESTATE_DELAY_MSB, 1
.equ	USB_LINESTATE_TUNING_LINESTATE_DELAY_LSB, 1
# -----------------------------------------------------------------------------
# Field       : USB_LINESTATE_TUNING_RCV_DELAY
# Description : Device - register the received data to account for hub bit
#               dribble before EOP. Only affects certain hubs.
.equ	USB_LINESTATE_TUNING_RCV_DELAY_RESET, 0x0
.equ	USB_LINESTATE_TUNING_RCV_DELAY_BITS, 0x00000001
.equ	USB_LINESTATE_TUNING_RCV_DELAY_MSB, 0
.equ	USB_LINESTATE_TUNING_RCV_DELAY_LSB, 0
# =============================================================================
# Register    : USB_INTR
# Description : Raw Interrupts
.equ	USB_INTR_OFFSET, 0x0000008c
.equ	USB_INTR_BITS, 0x00ffffff
.equ	USB_INTR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_INTR_EPX_STOPPED_ON_NAK
# Description : Source: NAK_POLL.EPX_STOPPED_ON_NAK
.equ	USB_INTR_EPX_STOPPED_ON_NAK_RESET, 0x0
.equ	USB_INTR_EPX_STOPPED_ON_NAK_BITS, 0x00800000
.equ	USB_INTR_EPX_STOPPED_ON_NAK_MSB, 23
.equ	USB_INTR_EPX_STOPPED_ON_NAK_LSB, 23
# -----------------------------------------------------------------------------
# Field       : USB_INTR_DEV_SM_WATCHDOG_FIRED
# Description : Source: DEV_SM_WATCHDOG.FIRED
.equ	USB_INTR_DEV_SM_WATCHDOG_FIRED_RESET, 0x0
.equ	USB_INTR_DEV_SM_WATCHDOG_FIRED_BITS, 0x00400000
.equ	USB_INTR_DEV_SM_WATCHDOG_FIRED_MSB, 22
.equ	USB_INTR_DEV_SM_WATCHDOG_FIRED_LSB, 22
# -----------------------------------------------------------------------------
# Field       : USB_INTR_ENDPOINT_ERROR
# Description : Source: SIE_STATUS.ENDPOINT_ERROR
.equ	USB_INTR_ENDPOINT_ERROR_RESET, 0x0
.equ	USB_INTR_ENDPOINT_ERROR_BITS, 0x00200000
.equ	USB_INTR_ENDPOINT_ERROR_MSB, 21
.equ	USB_INTR_ENDPOINT_ERROR_LSB, 21
# -----------------------------------------------------------------------------
# Field       : USB_INTR_RX_SHORT_PACKET
# Description : Source: SIE_STATUS.RX_SHORT_PACKET
.equ	USB_INTR_RX_SHORT_PACKET_RESET, 0x0
.equ	USB_INTR_RX_SHORT_PACKET_BITS, 0x00100000
.equ	USB_INTR_RX_SHORT_PACKET_MSB, 20
.equ	USB_INTR_RX_SHORT_PACKET_LSB, 20
# -----------------------------------------------------------------------------
# Field       : USB_INTR_EP_STALL_NAK
# Description : Raised when any bit in EP_STATUS_STALL_NAK is set. Clear by
#               clearing all bits in EP_STATUS_STALL_NAK.
.equ	USB_INTR_EP_STALL_NAK_RESET, 0x0
.equ	USB_INTR_EP_STALL_NAK_BITS, 0x00080000
.equ	USB_INTR_EP_STALL_NAK_MSB, 19
.equ	USB_INTR_EP_STALL_NAK_LSB, 19
# -----------------------------------------------------------------------------
# Field       : USB_INTR_ABORT_DONE
# Description : Raised when any bit in ABORT_DONE is set. Clear by clearing all
#               bits in ABORT_DONE.
.equ	USB_INTR_ABORT_DONE_RESET, 0x0
.equ	USB_INTR_ABORT_DONE_BITS, 0x00040000
.equ	USB_INTR_ABORT_DONE_MSB, 18
.equ	USB_INTR_ABORT_DONE_LSB, 18
# -----------------------------------------------------------------------------
# Field       : USB_INTR_DEV_SOF
# Description : Set every time the device receives a SOF (Start of Frame)
#               packet. Cleared by reading SOF_RD
.equ	USB_INTR_DEV_SOF_RESET, 0x0
.equ	USB_INTR_DEV_SOF_BITS, 0x00020000
.equ	USB_INTR_DEV_SOF_MSB, 17
.equ	USB_INTR_DEV_SOF_LSB, 17
# -----------------------------------------------------------------------------
# Field       : USB_INTR_SETUP_REQ
# Description : Device. Source: SIE_STATUS.SETUP_REC
.equ	USB_INTR_SETUP_REQ_RESET, 0x0
.equ	USB_INTR_SETUP_REQ_BITS, 0x00010000
.equ	USB_INTR_SETUP_REQ_MSB, 16
.equ	USB_INTR_SETUP_REQ_LSB, 16
# -----------------------------------------------------------------------------
# Field       : USB_INTR_DEV_RESUME_FROM_HOST
# Description : Set when the device receives a resume from the host. Cleared by
#               writing to SIE_STATUS.RESUME
.equ	USB_INTR_DEV_RESUME_FROM_HOST_RESET, 0x0
.equ	USB_INTR_DEV_RESUME_FROM_HOST_BITS, 0x00008000
.equ	USB_INTR_DEV_RESUME_FROM_HOST_MSB, 15
.equ	USB_INTR_DEV_RESUME_FROM_HOST_LSB, 15
# -----------------------------------------------------------------------------
# Field       : USB_INTR_DEV_SUSPEND
# Description : Set when the device suspend state changes. Cleared by writing
#               to SIE_STATUS.SUSPENDED
.equ	USB_INTR_DEV_SUSPEND_RESET, 0x0
.equ	USB_INTR_DEV_SUSPEND_BITS, 0x00004000
.equ	USB_INTR_DEV_SUSPEND_MSB, 14
.equ	USB_INTR_DEV_SUSPEND_LSB, 14
# -----------------------------------------------------------------------------
# Field       : USB_INTR_DEV_CONN_DIS
# Description : Set when the device connection state changes. Cleared by
#               writing to SIE_STATUS.CONNECTED
.equ	USB_INTR_DEV_CONN_DIS_RESET, 0x0
.equ	USB_INTR_DEV_CONN_DIS_BITS, 0x00002000
.equ	USB_INTR_DEV_CONN_DIS_MSB, 13
.equ	USB_INTR_DEV_CONN_DIS_LSB, 13
# -----------------------------------------------------------------------------
# Field       : USB_INTR_BUS_RESET
# Description : Source: SIE_STATUS.BUS_RESET
.equ	USB_INTR_BUS_RESET_RESET, 0x0
.equ	USB_INTR_BUS_RESET_BITS, 0x00001000
.equ	USB_INTR_BUS_RESET_MSB, 12
.equ	USB_INTR_BUS_RESET_LSB, 12
# -----------------------------------------------------------------------------
# Field       : USB_INTR_VBUS_DETECT
# Description : Source: SIE_STATUS.VBUS_DETECTED
.equ	USB_INTR_VBUS_DETECT_RESET, 0x0
.equ	USB_INTR_VBUS_DETECT_BITS, 0x00000800
.equ	USB_INTR_VBUS_DETECT_MSB, 11
.equ	USB_INTR_VBUS_DETECT_LSB, 11
# -----------------------------------------------------------------------------
# Field       : USB_INTR_STALL
# Description : Source: SIE_STATUS.STALL_REC
.equ	USB_INTR_STALL_RESET, 0x0
.equ	USB_INTR_STALL_BITS, 0x00000400
.equ	USB_INTR_STALL_MSB, 10
.equ	USB_INTR_STALL_LSB, 10
# -----------------------------------------------------------------------------
# Field       : USB_INTR_ERROR_CRC
# Description : Source: SIE_STATUS.CRC_ERROR
.equ	USB_INTR_ERROR_CRC_RESET, 0x0
.equ	USB_INTR_ERROR_CRC_BITS, 0x00000200
.equ	USB_INTR_ERROR_CRC_MSB, 9
.equ	USB_INTR_ERROR_CRC_LSB, 9
# -----------------------------------------------------------------------------
# Field       : USB_INTR_ERROR_BIT_STUFF
# Description : Source: SIE_STATUS.BIT_STUFF_ERROR
.equ	USB_INTR_ERROR_BIT_STUFF_RESET, 0x0
.equ	USB_INTR_ERROR_BIT_STUFF_BITS, 0x00000100
.equ	USB_INTR_ERROR_BIT_STUFF_MSB, 8
.equ	USB_INTR_ERROR_BIT_STUFF_LSB, 8
# -----------------------------------------------------------------------------
# Field       : USB_INTR_ERROR_RX_OVERFLOW
# Description : Source: SIE_STATUS.RX_OVERFLOW
.equ	USB_INTR_ERROR_RX_OVERFLOW_RESET, 0x0
.equ	USB_INTR_ERROR_RX_OVERFLOW_BITS, 0x00000080
.equ	USB_INTR_ERROR_RX_OVERFLOW_MSB, 7
.equ	USB_INTR_ERROR_RX_OVERFLOW_LSB, 7
# -----------------------------------------------------------------------------
# Field       : USB_INTR_ERROR_RX_TIMEOUT
# Description : Source: SIE_STATUS.RX_TIMEOUT
.equ	USB_INTR_ERROR_RX_TIMEOUT_RESET, 0x0
.equ	USB_INTR_ERROR_RX_TIMEOUT_BITS, 0x00000040
.equ	USB_INTR_ERROR_RX_TIMEOUT_MSB, 6
.equ	USB_INTR_ERROR_RX_TIMEOUT_LSB, 6
# -----------------------------------------------------------------------------
# Field       : USB_INTR_ERROR_DATA_SEQ
# Description : Source: SIE_STATUS.DATA_SEQ_ERROR
.equ	USB_INTR_ERROR_DATA_SEQ_RESET, 0x0
.equ	USB_INTR_ERROR_DATA_SEQ_BITS, 0x00000020
.equ	USB_INTR_ERROR_DATA_SEQ_MSB, 5
.equ	USB_INTR_ERROR_DATA_SEQ_LSB, 5
# -----------------------------------------------------------------------------
# Field       : USB_INTR_BUFF_STATUS
# Description : Raised when any bit in BUFF_STATUS is set. Clear by clearing
#               all bits in BUFF_STATUS.
.equ	USB_INTR_BUFF_STATUS_RESET, 0x0
.equ	USB_INTR_BUFF_STATUS_BITS, 0x00000010
.equ	USB_INTR_BUFF_STATUS_MSB, 4
.equ	USB_INTR_BUFF_STATUS_LSB, 4
# -----------------------------------------------------------------------------
# Field       : USB_INTR_TRANS_COMPLETE
# Description : Raised every time SIE_STATUS.TRANS_COMPLETE is set. Clear by
#               writing to this bit.
.equ	USB_INTR_TRANS_COMPLETE_RESET, 0x0
.equ	USB_INTR_TRANS_COMPLETE_BITS, 0x00000008
.equ	USB_INTR_TRANS_COMPLETE_MSB, 3
.equ	USB_INTR_TRANS_COMPLETE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : USB_INTR_HOST_SOF
# Description : Host: raised every time the host sends a SOF (Start of Frame).
#               Cleared by reading SOF_RD
.equ	USB_INTR_HOST_SOF_RESET, 0x0
.equ	USB_INTR_HOST_SOF_BITS, 0x00000004
.equ	USB_INTR_HOST_SOF_MSB, 2
.equ	USB_INTR_HOST_SOF_LSB, 2
# -----------------------------------------------------------------------------
# Field       : USB_INTR_HOST_RESUME
# Description : Host: raised when a device wakes up the host. Cleared by
#               writing to SIE_STATUS.RESUME
.equ	USB_INTR_HOST_RESUME_RESET, 0x0
.equ	USB_INTR_HOST_RESUME_BITS, 0x00000002
.equ	USB_INTR_HOST_RESUME_MSB, 1
.equ	USB_INTR_HOST_RESUME_LSB, 1
# -----------------------------------------------------------------------------
# Field       : USB_INTR_HOST_CONN_DIS
# Description : Host: raised when a device is connected or disconnected (i.e.
#               when SIE_STATUS.SPEED changes). Cleared by writing to
#               SIE_STATUS.SPEED
.equ	USB_INTR_HOST_CONN_DIS_RESET, 0x0
.equ	USB_INTR_HOST_CONN_DIS_BITS, 0x00000001
.equ	USB_INTR_HOST_CONN_DIS_MSB, 0
.equ	USB_INTR_HOST_CONN_DIS_LSB, 0
# =============================================================================
# Register    : USB_INTE
# Description : Interrupt Enable
.equ	USB_INTE_OFFSET, 0x00000090
.equ	USB_INTE_BITS, 0x00ffffff
.equ	USB_INTE_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_INTE_EPX_STOPPED_ON_NAK
# Description : Source: NAK_POLL.EPX_STOPPED_ON_NAK
.equ	USB_INTE_EPX_STOPPED_ON_NAK_RESET, 0x0
.equ	USB_INTE_EPX_STOPPED_ON_NAK_BITS, 0x00800000
.equ	USB_INTE_EPX_STOPPED_ON_NAK_MSB, 23
.equ	USB_INTE_EPX_STOPPED_ON_NAK_LSB, 23
# -----------------------------------------------------------------------------
# Field       : USB_INTE_DEV_SM_WATCHDOG_FIRED
# Description : Source: DEV_SM_WATCHDOG.FIRED
.equ	USB_INTE_DEV_SM_WATCHDOG_FIRED_RESET, 0x0
.equ	USB_INTE_DEV_SM_WATCHDOG_FIRED_BITS, 0x00400000
.equ	USB_INTE_DEV_SM_WATCHDOG_FIRED_MSB, 22
.equ	USB_INTE_DEV_SM_WATCHDOG_FIRED_LSB, 22
# -----------------------------------------------------------------------------
# Field       : USB_INTE_ENDPOINT_ERROR
# Description : Source: SIE_STATUS.ENDPOINT_ERROR
.equ	USB_INTE_ENDPOINT_ERROR_RESET, 0x0
.equ	USB_INTE_ENDPOINT_ERROR_BITS, 0x00200000
.equ	USB_INTE_ENDPOINT_ERROR_MSB, 21
.equ	USB_INTE_ENDPOINT_ERROR_LSB, 21
# -----------------------------------------------------------------------------
# Field       : USB_INTE_RX_SHORT_PACKET
# Description : Source: SIE_STATUS.RX_SHORT_PACKET
.equ	USB_INTE_RX_SHORT_PACKET_RESET, 0x0
.equ	USB_INTE_RX_SHORT_PACKET_BITS, 0x00100000
.equ	USB_INTE_RX_SHORT_PACKET_MSB, 20
.equ	USB_INTE_RX_SHORT_PACKET_LSB, 20
# -----------------------------------------------------------------------------
# Field       : USB_INTE_EP_STALL_NAK
# Description : Raised when any bit in EP_STATUS_STALL_NAK is set. Clear by
#               clearing all bits in EP_STATUS_STALL_NAK.
.equ	USB_INTE_EP_STALL_NAK_RESET, 0x0
.equ	USB_INTE_EP_STALL_NAK_BITS, 0x00080000
.equ	USB_INTE_EP_STALL_NAK_MSB, 19
.equ	USB_INTE_EP_STALL_NAK_LSB, 19
# -----------------------------------------------------------------------------
# Field       : USB_INTE_ABORT_DONE
# Description : Raised when any bit in ABORT_DONE is set. Clear by clearing all
#               bits in ABORT_DONE.
.equ	USB_INTE_ABORT_DONE_RESET, 0x0
.equ	USB_INTE_ABORT_DONE_BITS, 0x00040000
.equ	USB_INTE_ABORT_DONE_MSB, 18
.equ	USB_INTE_ABORT_DONE_LSB, 18
# -----------------------------------------------------------------------------
# Field       : USB_INTE_DEV_SOF
# Description : Set every time the device receives a SOF (Start of Frame)
#               packet. Cleared by reading SOF_RD
.equ	USB_INTE_DEV_SOF_RESET, 0x0
.equ	USB_INTE_DEV_SOF_BITS, 0x00020000
.equ	USB_INTE_DEV_SOF_MSB, 17
.equ	USB_INTE_DEV_SOF_LSB, 17
# -----------------------------------------------------------------------------
# Field       : USB_INTE_SETUP_REQ
# Description : Device. Source: SIE_STATUS.SETUP_REC
.equ	USB_INTE_SETUP_REQ_RESET, 0x0
.equ	USB_INTE_SETUP_REQ_BITS, 0x00010000
.equ	USB_INTE_SETUP_REQ_MSB, 16
.equ	USB_INTE_SETUP_REQ_LSB, 16
# -----------------------------------------------------------------------------
# Field       : USB_INTE_DEV_RESUME_FROM_HOST
# Description : Set when the device receives a resume from the host. Cleared by
#               writing to SIE_STATUS.RESUME
.equ	USB_INTE_DEV_RESUME_FROM_HOST_RESET, 0x0
.equ	USB_INTE_DEV_RESUME_FROM_HOST_BITS, 0x00008000
.equ	USB_INTE_DEV_RESUME_FROM_HOST_MSB, 15
.equ	USB_INTE_DEV_RESUME_FROM_HOST_LSB, 15
# -----------------------------------------------------------------------------
# Field       : USB_INTE_DEV_SUSPEND
# Description : Set when the device suspend state changes. Cleared by writing
#               to SIE_STATUS.SUSPENDED
.equ	USB_INTE_DEV_SUSPEND_RESET, 0x0
.equ	USB_INTE_DEV_SUSPEND_BITS, 0x00004000
.equ	USB_INTE_DEV_SUSPEND_MSB, 14
.equ	USB_INTE_DEV_SUSPEND_LSB, 14
# -----------------------------------------------------------------------------
# Field       : USB_INTE_DEV_CONN_DIS
# Description : Set when the device connection state changes. Cleared by
#               writing to SIE_STATUS.CONNECTED
.equ	USB_INTE_DEV_CONN_DIS_RESET, 0x0
.equ	USB_INTE_DEV_CONN_DIS_BITS, 0x00002000
.equ	USB_INTE_DEV_CONN_DIS_MSB, 13
.equ	USB_INTE_DEV_CONN_DIS_LSB, 13
# -----------------------------------------------------------------------------
# Field       : USB_INTE_BUS_RESET
# Description : Source: SIE_STATUS.BUS_RESET
.equ	USB_INTE_BUS_RESET_RESET, 0x0
.equ	USB_INTE_BUS_RESET_BITS, 0x00001000
.equ	USB_INTE_BUS_RESET_MSB, 12
.equ	USB_INTE_BUS_RESET_LSB, 12
# -----------------------------------------------------------------------------
# Field       : USB_INTE_VBUS_DETECT
# Description : Source: SIE_STATUS.VBUS_DETECTED
.equ	USB_INTE_VBUS_DETECT_RESET, 0x0
.equ	USB_INTE_VBUS_DETECT_BITS, 0x00000800
.equ	USB_INTE_VBUS_DETECT_MSB, 11
.equ	USB_INTE_VBUS_DETECT_LSB, 11
# -----------------------------------------------------------------------------
