konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/usb.inc
# Field       : USB_INTE_STALL
# Description : Source: SIE_STATUS.STALL_REC
.equ	USB_INTE_STALL_RESET, 0x0
.equ	USB_INTE_STALL_BITS, 0x00000400
.equ	USB_INTE_STALL_MSB, 10
.equ	USB_INTE_STALL_LSB, 10
# -----------------------------------------------------------------------------
# Field       : USB_INTE_ERROR_CRC
# Description : Source: SIE_STATUS.CRC_ERROR
.equ	USB_INTE_ERROR_CRC_RESET, 0x0
.equ	USB_INTE_ERROR_CRC_BITS, 0x00000200
.equ	USB_INTE_ERROR_CRC_MSB, 9
.equ	USB_INTE_ERROR_CRC_LSB, 9
# -----------------------------------------------------------------------------
# Field       : USB_INTE_ERROR_BIT_STUFF
# Description : Source: SIE_STATUS.BIT_STUFF_ERROR
.equ	USB_INTE_ERROR_BIT_STUFF_RESET, 0x0
.equ	USB_INTE_ERROR_BIT_STUFF_BITS, 0x00000100
.equ	USB_INTE_ERROR_BIT_STUFF_MSB, 8
.equ	USB_INTE_ERROR_BIT_STUFF_LSB, 8
# -----------------------------------------------------------------------------
# Field       : USB_INTE_ERROR_RX_OVERFLOW
# Description : Source: SIE_STATUS.RX_OVERFLOW
.equ	USB_INTE_ERROR_RX_OVERFLOW_RESET, 0x0
.equ	USB_INTE_ERROR_RX_OVERFLOW_BITS, 0x00000080
.equ	USB_INTE_ERROR_RX_OVERFLOW_MSB, 7
.equ	USB_INTE_ERROR_RX_OVERFLOW_LSB, 7
# -----------------------------------------------------------------------------
# Field       : USB_INTE_ERROR_RX_TIMEOUT
# Description : Source: SIE_STATUS.RX_TIMEOUT
.equ	USB_INTE_ERROR_RX_TIMEOUT_RESET, 0x0
.equ	USB_INTE_ERROR_RX_TIMEOUT_BITS, 0x00000040
.equ	USB_INTE_ERROR_RX_TIMEOUT_MSB, 6
.equ	USB_INTE_ERROR_RX_TIMEOUT_LSB, 6
# -----------------------------------------------------------------------------
# Field       : USB_INTE_ERROR_DATA_SEQ
# Description : Source: SIE_STATUS.DATA_SEQ_ERROR
.equ	USB_INTE_ERROR_DATA_SEQ_RESET, 0x0
.equ	USB_INTE_ERROR_DATA_SEQ_BITS, 0x00000020
.equ	USB_INTE_ERROR_DATA_SEQ_MSB, 5
.equ	USB_INTE_ERROR_DATA_SEQ_LSB, 5
# -----------------------------------------------------------------------------
# Field       : USB_INTE_BUFF_STATUS
# Description : Raised when any bit in BUFF_STATUS is set. Clear by clearing
#               all bits in BUFF_STATUS.
.equ	USB_INTE_BUFF_STATUS_RESET, 0x0
.equ	USB_INTE_BUFF_STATUS_BITS, 0x00000010
.equ	USB_INTE_BUFF_STATUS_MSB, 4
.equ	USB_INTE_BUFF_STATUS_LSB, 4
# -----------------------------------------------------------------------------
# Field       : USB_INTE_TRANS_COMPLETE
# Description : Raised every time SIE_STATUS.TRANS_COMPLETE is set. Clear by
#               writing to this bit.
.equ	USB_INTE_TRANS_COMPLETE_RESET, 0x0
.equ	USB_INTE_TRANS_COMPLETE_BITS, 0x00000008
.equ	USB_INTE_TRANS_COMPLETE_MSB, 3
.equ	USB_INTE_TRANS_COMPLETE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : USB_INTE_HOST_SOF
# Description : Host: raised every time the host sends a SOF (Start of Frame).
#               Cleared by reading SOF_RD
.equ	USB_INTE_HOST_SOF_RESET, 0x0
.equ	USB_INTE_HOST_SOF_BITS, 0x00000004
.equ	USB_INTE_HOST_SOF_MSB, 2
.equ	USB_INTE_HOST_SOF_LSB, 2
# -----------------------------------------------------------------------------
# Field       : USB_INTE_HOST_RESUME
# Description : Host: raised when a device wakes up the host. Cleared by
#               writing to SIE_STATUS.RESUME
.equ	USB_INTE_HOST_RESUME_RESET, 0x0
.equ	USB_INTE_HOST_RESUME_BITS, 0x00000002
.equ	USB_INTE_HOST_RESUME_MSB, 1
.equ	USB_INTE_HOST_RESUME_LSB, 1
# -----------------------------------------------------------------------------
# Field       : USB_INTE_HOST_CONN_DIS
# Description : Host: raised when a device is connected or disconnected (i.e.
#               when SIE_STATUS.SPEED changes). Cleared by writing to
#               SIE_STATUS.SPEED
.equ	USB_INTE_HOST_CONN_DIS_RESET, 0x0
.equ	USB_INTE_HOST_CONN_DIS_BITS, 0x00000001
.equ	USB_INTE_HOST_CONN_DIS_MSB, 0
.equ	USB_INTE_HOST_CONN_DIS_LSB, 0
# =============================================================================
# Register    : USB_INTF
# Description : Interrupt Force
.equ	USB_INTF_OFFSET, 0x00000094
.equ	USB_INTF_BITS, 0x00ffffff
.equ	USB_INTF_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_INTF_EPX_STOPPED_ON_NAK
# Description : Source: NAK_POLL.EPX_STOPPED_ON_NAK
.equ	USB_INTF_EPX_STOPPED_ON_NAK_RESET, 0x0
.equ	USB_INTF_EPX_STOPPED_ON_NAK_BITS, 0x00800000
.equ	USB_INTF_EPX_STOPPED_ON_NAK_MSB, 23
.equ	USB_INTF_EPX_STOPPED_ON_NAK_LSB, 23
# -----------------------------------------------------------------------------
# Field       : USB_INTF_DEV_SM_WATCHDOG_FIRED
# Description : Source: DEV_SM_WATCHDOG.FIRED
.equ	USB_INTF_DEV_SM_WATCHDOG_FIRED_RESET, 0x0
.equ	USB_INTF_DEV_SM_WATCHDOG_FIRED_BITS, 0x00400000
.equ	USB_INTF_DEV_SM_WATCHDOG_FIRED_MSB, 22
.equ	USB_INTF_DEV_SM_WATCHDOG_FIRED_LSB, 22
# -----------------------------------------------------------------------------
# Field       : USB_INTF_ENDPOINT_ERROR
# Description : Source: SIE_STATUS.ENDPOINT_ERROR
.equ	USB_INTF_ENDPOINT_ERROR_RESET, 0x0
.equ	USB_INTF_ENDPOINT_ERROR_BITS, 0x00200000
.equ	USB_INTF_ENDPOINT_ERROR_MSB, 21
.equ	USB_INTF_ENDPOINT_ERROR_LSB, 21
# -----------------------------------------------------------------------------
# Field       : USB_INTF_RX_SHORT_PACKET
# Description : Source: SIE_STATUS.RX_SHORT_PACKET
.equ	USB_INTF_RX_SHORT_PACKET_RESET, 0x0
.equ	USB_INTF_RX_SHORT_PACKET_BITS, 0x00100000
.equ	USB_INTF_RX_SHORT_PACKET_MSB, 20
.equ	USB_INTF_RX_SHORT_PACKET_LSB, 20
# -----------------------------------------------------------------------------
# Field       : USB_INTF_EP_STALL_NAK
# Description : Raised when any bit in EP_STATUS_STALL_NAK is set. Clear by
#               clearing all bits in EP_STATUS_STALL_NAK.
.equ	USB_INTF_EP_STALL_NAK_RESET, 0x0
.equ	USB_INTF_EP_STALL_NAK_BITS, 0x00080000
.equ	USB_INTF_EP_STALL_NAK_MSB, 19
.equ	USB_INTF_EP_STALL_NAK_LSB, 19
# -----------------------------------------------------------------------------
# Field       : USB_INTF_ABORT_DONE
# Description : Raised when any bit in ABORT_DONE is set. Clear by clearing all
#               bits in ABORT_DONE.
.equ	USB_INTF_ABORT_DONE_RESET, 0x0
.equ	USB_INTF_ABORT_DONE_BITS, 0x00040000
.equ	USB_INTF_ABORT_DONE_MSB, 18
.equ	USB_INTF_ABORT_DONE_LSB, 18
# -----------------------------------------------------------------------------
# Field       : USB_INTF_DEV_SOF
# Description : Set every time the device receives a SOF (Start of Frame)
#               packet. Cleared by reading SOF_RD
.equ	USB_INTF_DEV_SOF_RESET, 0x0
.equ	USB_INTF_DEV_SOF_BITS, 0x00020000
.equ	USB_INTF_DEV_SOF_MSB, 17
.equ	USB_INTF_DEV_SOF_LSB, 17
# -----------------------------------------------------------------------------
# Field       : USB_INTF_SETUP_REQ
# Description : Device. Source: SIE_STATUS.SETUP_REC
.equ	USB_INTF_SETUP_REQ_RESET, 0x0
.equ	USB_INTF_SETUP_REQ_BITS, 0x00010000
.equ	USB_INTF_SETUP_REQ_MSB, 16
.equ	USB_INTF_SETUP_REQ_LSB, 16
# -----------------------------------------------------------------------------
# Field       : USB_INTF_DEV_RESUME_FROM_HOST
# Description : Set when the device receives a resume from the host. Cleared by
#               writing to SIE_STATUS.RESUME
.equ	USB_INTF_DEV_RESUME_FROM_HOST_RESET, 0x0
.equ	USB_INTF_DEV_RESUME_FROM_HOST_BITS, 0x00008000
.equ	USB_INTF_DEV_RESUME_FROM_HOST_MSB, 15
.equ	USB_INTF_DEV_RESUME_FROM_HOST_LSB, 15
# -----------------------------------------------------------------------------
# Field       : USB_INTF_DEV_SUSPEND
# Description : Set when the device suspend state changes. Cleared by writing
#               to SIE_STATUS.SUSPENDED
.equ	USB_INTF_DEV_SUSPEND_RESET, 0x0
.equ	USB_INTF_DEV_SUSPEND_BITS, 0x00004000
.equ	USB_INTF_DEV_SUSPEND_MSB, 14
.equ	USB_INTF_DEV_SUSPEND_LSB, 14
# -----------------------------------------------------------------------------
# Field       : USB_INTF_DEV_CONN_DIS
# Description : Set when the device connection state changes. Cleared by
#               writing to SIE_STATUS.CONNECTED
.equ	USB_INTF_DEV_CONN_DIS_RESET, 0x0
.equ	USB_INTF_DEV_CONN_DIS_BITS, 0x00002000
.equ	USB_INTF_DEV_CONN_DIS_MSB, 13
.equ	USB_INTF_DEV_CONN_DIS_LSB, 13
# -----------------------------------------------------------------------------
# Field       : USB_INTF_BUS_RESET
# Description : Source: SIE_STATUS.BUS_RESET
.equ	USB_INTF_BUS_RESET_RESET, 0x0
.equ	USB_INTF_BUS_RESET_BITS, 0x00001000
.equ	USB_INTF_BUS_RESET_MSB, 12
.equ	USB_INTF_BUS_RESET_LSB, 12
# -----------------------------------------------------------------------------
# Field       : USB_INTF_VBUS_DETECT
# Description : Source: SIE_STATUS.VBUS_DETECTED
.equ	USB_INTF_VBUS_DETECT_RESET, 0x0
.equ	USB_INTF_VBUS_DETECT_BITS, 0x00000800
.equ	USB_INTF_VBUS_DETECT_MSB, 11
.equ	USB_INTF_VBUS_DETECT_LSB, 11
# -----------------------------------------------------------------------------
# Field       : USB_INTF_STALL
# Description : Source: SIE_STATUS.STALL_REC
.equ	USB_INTF_STALL_RESET, 0x0
.equ	USB_INTF_STALL_BITS, 0x00000400
.equ	USB_INTF_STALL_MSB, 10
.equ	USB_INTF_STALL_LSB, 10
# -----------------------------------------------------------------------------
# Field       : USB_INTF_ERROR_CRC
# Description : Source: SIE_STATUS.CRC_ERROR
.equ	USB_INTF_ERROR_CRC_RESET, 0x0
.equ	USB_INTF_ERROR_CRC_BITS, 0x00000200
.equ	USB_INTF_ERROR_CRC_MSB, 9
.equ	USB_INTF_ERROR_CRC_LSB, 9
# -----------------------------------------------------------------------------
# Field       : USB_INTF_ERROR_BIT_STUFF
# Description : Source: SIE_STATUS.BIT_STUFF_ERROR
.equ	USB_INTF_ERROR_BIT_STUFF_RESET, 0x0
.equ	USB_INTF_ERROR_BIT_STUFF_BITS, 0x00000100
.equ	USB_INTF_ERROR_BIT_STUFF_MSB, 8
.equ	USB_INTF_ERROR_BIT_STUFF_LSB, 8
# -----------------------------------------------------------------------------
# Field       : USB_INTF_ERROR_RX_OVERFLOW
# Description : Source: SIE_STATUS.RX_OVERFLOW
.equ	USB_INTF_ERROR_RX_OVERFLOW_RESET, 0x0
.equ	USB_INTF_ERROR_RX_OVERFLOW_BITS, 0x00000080
.equ	USB_INTF_ERROR_RX_OVERFLOW_MSB, 7
.equ	USB_INTF_ERROR_RX_OVERFLOW_LSB, 7
# -----------------------------------------------------------------------------
# Field       : USB_INTF_ERROR_RX_TIMEOUT
# Description : Source: SIE_STATUS.RX_TIMEOUT
.equ	USB_INTF_ERROR_RX_TIMEOUT_RESET, 0x0
.equ	USB_INTF_ERROR_RX_TIMEOUT_BITS, 0x00000040
.equ	USB_INTF_ERROR_RX_TIMEOUT_MSB, 6
.equ	USB_INTF_ERROR_RX_TIMEOUT_LSB, 6
# -----------------------------------------------------------------------------
# Field       : USB_INTF_ERROR_DATA_SEQ
# Description : Source: SIE_STATUS.DATA_SEQ_ERROR
.equ	USB_INTF_ERROR_DATA_SEQ_RESET, 0x0
.equ	USB_INTF_ERROR_DATA_SEQ_BITS, 0x00000020
.equ	USB_INTF_ERROR_DATA_SEQ_MSB, 5
.equ	USB_INTF_ERROR_DATA_SEQ_LSB, 5
# -----------------------------------------------------------------------------
# Field       : USB_INTF_BUFF_STATUS
# Description : Raised when any bit in BUFF_STATUS is set. Clear by clearing
#               all bits in BUFF_STATUS.
.equ	USB_INTF_BUFF_STATUS_RESET, 0x0
.equ	USB_INTF_BUFF_STATUS_BITS, 0x00000010
.equ	USB_INTF_BUFF_STATUS_MSB, 4
.equ	USB_INTF_BUFF_STATUS_LSB, 4
# -----------------------------------------------------------------------------
# Field       : USB_INTF_TRANS_COMPLETE
# Description : Raised every time SIE_STATUS.TRANS_COMPLETE is set. Clear by
#               writing to this bit.
.equ	USB_INTF_TRANS_COMPLETE_RESET, 0x0
.equ	USB_INTF_TRANS_COMPLETE_BITS, 0x00000008
.equ	USB_INTF_TRANS_COMPLETE_MSB, 3
.equ	USB_INTF_TRANS_COMPLETE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : USB_INTF_HOST_SOF
# Description : Host: raised every time the host sends a SOF (Start of Frame).
#               Cleared by reading SOF_RD
.equ	USB_INTF_HOST_SOF_RESET, 0x0
.equ	USB_INTF_HOST_SOF_BITS, 0x00000004
.equ	USB_INTF_HOST_SOF_MSB, 2
.equ	USB_INTF_HOST_SOF_LSB, 2
# -----------------------------------------------------------------------------
# Field       : USB_INTF_HOST_RESUME
# Description : Host: raised when a device wakes up the host. Cleared by
#               writing to SIE_STATUS.RESUME
.equ	USB_INTF_HOST_RESUME_RESET, 0x0
.equ	USB_INTF_HOST_RESUME_BITS, 0x00000002
.equ	USB_INTF_HOST_RESUME_MSB, 1
.equ	USB_INTF_HOST_RESUME_LSB, 1
# -----------------------------------------------------------------------------
# Field       : USB_INTF_HOST_CONN_DIS
# Description : Host: raised when a device is connected or disconnected (i.e.
#               when SIE_STATUS.SPEED changes). Cleared by writing to
#               SIE_STATUS.SPEED
.equ	USB_INTF_HOST_CONN_DIS_RESET, 0x0
.equ	USB_INTF_HOST_CONN_DIS_BITS, 0x00000001
.equ	USB_INTF_HOST_CONN_DIS_MSB, 0
.equ	USB_INTF_HOST_CONN_DIS_LSB, 0
# =============================================================================
# Register    : USB_INTS
# Description : Interrupt status after masking & forcing
.equ	USB_INTS_OFFSET, 0x00000098
.equ	USB_INTS_BITS, 0x00ffffff
.equ	USB_INTS_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_INTS_EPX_STOPPED_ON_NAK
# Description : Source: NAK_POLL.EPX_STOPPED_ON_NAK
.equ	USB_INTS_EPX_STOPPED_ON_NAK_RESET, 0x0
.equ	USB_INTS_EPX_STOPPED_ON_NAK_BITS, 0x00800000
.equ	USB_INTS_EPX_STOPPED_ON_NAK_MSB, 23
.equ	USB_INTS_EPX_STOPPED_ON_NAK_LSB, 23
# -----------------------------------------------------------------------------
# Field       : USB_INTS_DEV_SM_WATCHDOG_FIRED
# Description : Source: DEV_SM_WATCHDOG.FIRED
.equ	USB_INTS_DEV_SM_WATCHDOG_FIRED_RESET, 0x0
.equ	USB_INTS_DEV_SM_WATCHDOG_FIRED_BITS, 0x00400000
.equ	USB_INTS_DEV_SM_WATCHDOG_FIRED_MSB, 22
.equ	USB_INTS_DEV_SM_WATCHDOG_FIRED_LSB, 22
# -----------------------------------------------------------------------------
# Field       : USB_INTS_ENDPOINT_ERROR
# Description : Source: SIE_STATUS.ENDPOINT_ERROR
.equ	USB_INTS_ENDPOINT_ERROR_RESET, 0x0
.equ	USB_INTS_ENDPOINT_ERROR_BITS, 0x00200000
.equ	USB_INTS_ENDPOINT_ERROR_MSB, 21
.equ	USB_INTS_ENDPOINT_ERROR_LSB, 21
# -----------------------------------------------------------------------------
# Field       : USB_INTS_RX_SHORT_PACKET
# Description : Source: SIE_STATUS.RX_SHORT_PACKET
.equ	USB_INTS_RX_SHORT_PACKET_RESET, 0x0
.equ	USB_INTS_RX_SHORT_PACKET_BITS, 0x00100000
.equ	USB_INTS_RX_SHORT_PACKET_MSB, 20
.equ	USB_INTS_RX_SHORT_PACKET_LSB, 20
# -----------------------------------------------------------------------------
# Field       : USB_INTS_EP_STALL_NAK
# Description : Raised when any bit in EP_STATUS_STALL_NAK is set. Clear by
#               clearing all bits in EP_STATUS_STALL_NAK.
.equ	USB_INTS_EP_STALL_NAK_RESET, 0x0
.equ	USB_INTS_EP_STALL_NAK_BITS, 0x00080000
.equ	USB_INTS_EP_STALL_NAK_MSB, 19
.equ	USB_INTS_EP_STALL_NAK_LSB, 19
# -----------------------------------------------------------------------------
# Field       : USB_INTS_ABORT_DONE
# Description : Raised when any bit in ABORT_DONE is set. Clear by clearing all
#               bits in ABORT_DONE.
.equ	USB_INTS_ABORT_DONE_RESET, 0x0
.equ	USB_INTS_ABORT_DONE_BITS, 0x00040000
.equ	USB_INTS_ABORT_DONE_MSB, 18
.equ	USB_INTS_ABORT_DONE_LSB, 18
# -----------------------------------------------------------------------------
# Field       : USB_INTS_DEV_SOF
# Description : Set every time the device receives a SOF (Start of Frame)
#               packet. Cleared by reading SOF_RD
.equ	USB_INTS_DEV_SOF_RESET, 0x0
.equ	USB_INTS_DEV_SOF_BITS, 0x00020000
.equ	USB_INTS_DEV_SOF_MSB, 17
.equ	USB_INTS_DEV_SOF_LSB, 17
# -----------------------------------------------------------------------------
# Field       : USB_INTS_SETUP_REQ
# Description : Device. Source: SIE_STATUS.SETUP_REC
.equ	USB_INTS_SETUP_REQ_RESET, 0x0
.equ	USB_INTS_SETUP_REQ_BITS, 0x00010000
.equ	USB_INTS_SETUP_REQ_MSB, 16
.equ	USB_INTS_SETUP_REQ_LSB, 16
# -----------------------------------------------------------------------------
# Field       : USB_INTS_DEV_RESUME_FROM_HOST
# Description : Set when the device receives a resume from the host. Cleared by
#               writing to SIE_STATUS.RESUME
.equ	USB_INTS_DEV_RESUME_FROM_HOST_RESET, 0x0
.equ	USB_INTS_DEV_RESUME_FROM_HOST_BITS, 0x00008000
.equ	USB_INTS_DEV_RESUME_FROM_HOST_MSB, 15
.equ	USB_INTS_DEV_RESUME_FROM_HOST_LSB, 15
# -----------------------------------------------------------------------------
# Field       : USB_INTS_DEV_SUSPEND
# Description : Set when the device suspend state changes. Cleared by writing
#               to SIE_STATUS.SUSPENDED
.equ	USB_INTS_DEV_SUSPEND_RESET, 0x0
.equ	USB_INTS_DEV_SUSPEND_BITS, 0x00004000
.equ	USB_INTS_DEV_SUSPEND_MSB, 14
.equ	USB_INTS_DEV_SUSPEND_LSB, 14
# -----------------------------------------------------------------------------
# Field       : USB_INTS_DEV_CONN_DIS
# Description : Set when the device connection state changes. Cleared by
#               writing to SIE_STATUS.CONNECTED
.equ	USB_INTS_DEV_CONN_DIS_RESET, 0x0
.equ	USB_INTS_DEV_CONN_DIS_BITS, 0x00002000
.equ	USB_INTS_DEV_CONN_DIS_MSB, 13
.equ	USB_INTS_DEV_CONN_DIS_LSB, 13
# -----------------------------------------------------------------------------
# Field       : USB_INTS_BUS_RESET
# Description : Source: SIE_STATUS.BUS_RESET
.equ	USB_INTS_BUS_RESET_RESET, 0x0
.equ	USB_INTS_BUS_RESET_BITS, 0x00001000
.equ	USB_INTS_BUS_RESET_MSB, 12
.equ	USB_INTS_BUS_RESET_LSB, 12
# -----------------------------------------------------------------------------
# Field       : USB_INTS_VBUS_DETECT
# Description : Source: SIE_STATUS.VBUS_DETECTED
.equ	USB_INTS_VBUS_DETECT_RESET, 0x0
.equ	USB_INTS_VBUS_DETECT_BITS, 0x00000800
.equ	USB_INTS_VBUS_DETECT_MSB, 11
.equ	USB_INTS_VBUS_DETECT_LSB, 11
# -----------------------------------------------------------------------------
# Field       : USB_INTS_STALL
# Description : Source: SIE_STATUS.STALL_REC
.equ	USB_INTS_STALL_RESET, 0x0
.equ	USB_INTS_STALL_BITS, 0x00000400
.equ	USB_INTS_STALL_MSB, 10
.equ	USB_INTS_STALL_LSB, 10
# -----------------------------------------------------------------------------
# Field       : USB_INTS_ERROR_CRC
# Description : Source: SIE_STATUS.CRC_ERROR
.equ	USB_INTS_ERROR_CRC_RESET, 0x0
.equ	USB_INTS_ERROR_CRC_BITS, 0x00000200
.equ	USB_INTS_ERROR_CRC_MSB, 9
.equ	USB_INTS_ERROR_CRC_LSB, 9
# -----------------------------------------------------------------------------
# Field       : USB_INTS_ERROR_BIT_STUFF
# Description : Source: SIE_STATUS.BIT_STUFF_ERROR
.equ	USB_INTS_ERROR_BIT_STUFF_RESET, 0x0
.equ	USB_INTS_ERROR_BIT_STUFF_BITS, 0x00000100
.equ	USB_INTS_ERROR_BIT_STUFF_MSB, 8
.equ	USB_INTS_ERROR_BIT_STUFF_LSB, 8
# -----------------------------------------------------------------------------
# Field       : USB_INTS_ERROR_RX_OVERFLOW
# Description : Source: SIE_STATUS.RX_OVERFLOW
.equ	USB_INTS_ERROR_RX_OVERFLOW_RESET, 0x0
.equ	USB_INTS_ERROR_RX_OVERFLOW_BITS, 0x00000080
.equ	USB_INTS_ERROR_RX_OVERFLOW_MSB, 7
.equ	USB_INTS_ERROR_RX_OVERFLOW_LSB, 7
# -----------------------------------------------------------------------------
# Field       : USB_INTS_ERROR_RX_TIMEOUT
# Description : Source: SIE_STATUS.RX_TIMEOUT
.equ	USB_INTS_ERROR_RX_TIMEOUT_RESET, 0x0
.equ	USB_INTS_ERROR_RX_TIMEOUT_BITS, 0x00000040
.equ	USB_INTS_ERROR_RX_TIMEOUT_MSB, 6
.equ	USB_INTS_ERROR_RX_TIMEOUT_LSB, 6
# -----------------------------------------------------------------------------
# Field       : USB_INTS_ERROR_DATA_SEQ
# Description : Source: SIE_STATUS.DATA_SEQ_ERROR
.equ	USB_INTS_ERROR_DATA_SEQ_RESET, 0x0
.equ	USB_INTS_ERROR_DATA_SEQ_BITS, 0x00000020
.equ	USB_INTS_ERROR_DATA_SEQ_MSB, 5
.equ	USB_INTS_ERROR_DATA_SEQ_LSB, 5
# -----------------------------------------------------------------------------
# Field       : USB_INTS_BUFF_STATUS
# Description : Raised when any bit in BUFF_STATUS is set. Clear by clearing
#               all bits in BUFF_STATUS.
.equ	USB_INTS_BUFF_STATUS_RESET, 0x0
.equ	USB_INTS_BUFF_STATUS_BITS, 0x00000010
.equ	USB_INTS_BUFF_STATUS_MSB, 4
.equ	USB_INTS_BUFF_STATUS_LSB, 4
# -----------------------------------------------------------------------------
# Field       : USB_INTS_TRANS_COMPLETE
# Description : Raised every time SIE_STATUS.TRANS_COMPLETE is set. Clear by
#               writing to this bit.
.equ	USB_INTS_TRANS_COMPLETE_RESET, 0x0
.equ	USB_INTS_TRANS_COMPLETE_BITS, 0x00000008
.equ	USB_INTS_TRANS_COMPLETE_MSB, 3
.equ	USB_INTS_TRANS_COMPLETE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : USB_INTS_HOST_SOF
# Description : Host: raised every time the host sends a SOF (Start of Frame).
#               Cleared by reading SOF_RD
.equ	USB_INTS_HOST_SOF_RESET, 0x0
.equ	USB_INTS_HOST_SOF_BITS, 0x00000004
.equ	USB_INTS_HOST_SOF_MSB, 2
.equ	USB_INTS_HOST_SOF_LSB, 2
# -----------------------------------------------------------------------------
# Field       : USB_INTS_HOST_RESUME
# Description : Host: raised when a device wakes up the host. Cleared by
#               writing to SIE_STATUS.RESUME
.equ	USB_INTS_HOST_RESUME_RESET, 0x0
.equ	USB_INTS_HOST_RESUME_BITS, 0x00000002
.equ	USB_INTS_HOST_RESUME_MSB, 1
.equ	USB_INTS_HOST_RESUME_LSB, 1
# -----------------------------------------------------------------------------
# Field       : USB_INTS_HOST_CONN_DIS
# Description : Host: raised when a device is connected or disconnected (i.e.
#               when SIE_STATUS.SPEED changes). Cleared by writing to
#               SIE_STATUS.SPEED
.equ	USB_INTS_HOST_CONN_DIS_RESET, 0x0
.equ	USB_INTS_HOST_CONN_DIS_BITS, 0x00000001
.equ	USB_INTS_HOST_CONN_DIS_MSB, 0
.equ	USB_INTS_HOST_CONN_DIS_LSB, 0
# =============================================================================
# Register    : USB_SOF_TIMESTAMP_RAW
# Description : Device only. Raw value of free-running PHY clock counter
#               @48MHz. Used to calculate time between SOF events.
.equ	USB_SOF_TIMESTAMP_RAW_OFFSET, 0x00000100
.equ	USB_SOF_TIMESTAMP_RAW_BITS, 0x001fffff
.equ	USB_SOF_TIMESTAMP_RAW_RESET, 0x00000000
.equ	USB_SOF_TIMESTAMP_RAW_MSB, 20
.equ	USB_SOF_TIMESTAMP_RAW_LSB, 0
# =============================================================================
# Register    : USB_SOF_TIMESTAMP_LAST
# Description : Device only. Value of free-running PHY clock counter @48MHz
#               when last SOF event occurred.
.equ	USB_SOF_TIMESTAMP_LAST_OFFSET, 0x00000104
.equ	USB_SOF_TIMESTAMP_LAST_BITS, 0x001fffff
.equ	USB_SOF_TIMESTAMP_LAST_RESET, 0x00000000
.equ	USB_SOF_TIMESTAMP_LAST_MSB, 20
.equ	USB_SOF_TIMESTAMP_LAST_LSB, 0
# =============================================================================
# Register    : USB_SM_STATE
.equ	USB_SM_STATE_OFFSET, 0x00000108
.equ	USB_SM_STATE_BITS, 0x00000fff
.equ	USB_SM_STATE_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_SM_STATE_RX_DASM
.equ	USB_SM_STATE_RX_DASM_RESET, 0x0
.equ	USB_SM_STATE_RX_DASM_BITS, 0x00000f00
.equ	USB_SM_STATE_RX_DASM_MSB, 11
.equ	USB_SM_STATE_RX_DASM_LSB, 8
# -----------------------------------------------------------------------------
# Field       : USB_SM_STATE_BC_STATE
.equ	USB_SM_STATE_BC_STATE_RESET, 0x0
.equ	USB_SM_STATE_BC_STATE_BITS, 0x000000e0
.equ	USB_SM_STATE_BC_STATE_MSB, 7
.equ	USB_SM_STATE_BC_STATE_LSB, 5
# -----------------------------------------------------------------------------
# Field       : USB_SM_STATE_STATE
.equ	USB_SM_STATE_STATE_RESET, 0x00
.equ	USB_SM_STATE_STATE_BITS, 0x0000001f
.equ	USB_SM_STATE_STATE_MSB, 4
.equ	USB_SM_STATE_STATE_LSB, 0
# =============================================================================
# Register    : USB_EP_TX_ERROR
# Description : TX error count for each endpoint. Write to each field to reset
#               the counter to 0.
.equ	USB_EP_TX_ERROR_OFFSET, 0x0000010c
.equ	USB_EP_TX_ERROR_BITS, 0xffffffff
.equ	USB_EP_TX_ERROR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_EP_TX_ERROR_EP15
.equ	USB_EP_TX_ERROR_EP15_RESET, 0x0
.equ	USB_EP_TX_ERROR_EP15_BITS, 0xc0000000
.equ	USB_EP_TX_ERROR_EP15_MSB, 31
.equ	USB_EP_TX_ERROR_EP15_LSB, 30
