konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/usb.inc
# -----------------------------------------------------------------------------
# Field       : USB_EP_TX_ERROR_EP14
.equ	USB_EP_TX_ERROR_EP14_RESET, 0x0
.equ	USB_EP_TX_ERROR_EP14_BITS, 0x30000000
.equ	USB_EP_TX_ERROR_EP14_MSB, 29
.equ	USB_EP_TX_ERROR_EP14_LSB, 28
# -----------------------------------------------------------------------------
# Field       : USB_EP_TX_ERROR_EP13
.equ	USB_EP_TX_ERROR_EP13_RESET, 0x0
.equ	USB_EP_TX_ERROR_EP13_BITS, 0x0c000000
.equ	USB_EP_TX_ERROR_EP13_MSB, 27
.equ	USB_EP_TX_ERROR_EP13_LSB, 26
# -----------------------------------------------------------------------------
# Field       : USB_EP_TX_ERROR_EP12
.equ	USB_EP_TX_ERROR_EP12_RESET, 0x0
.equ	USB_EP_TX_ERROR_EP12_BITS, 0x03000000
.equ	USB_EP_TX_ERROR_EP12_MSB, 25
.equ	USB_EP_TX_ERROR_EP12_LSB, 24
# -----------------------------------------------------------------------------
# Field       : USB_EP_TX_ERROR_EP11
.equ	USB_EP_TX_ERROR_EP11_RESET, 0x0
.equ	USB_EP_TX_ERROR_EP11_BITS, 0x00c00000
.equ	USB_EP_TX_ERROR_EP11_MSB, 23
.equ	USB_EP_TX_ERROR_EP11_LSB, 22
# -----------------------------------------------------------------------------
# Field       : USB_EP_TX_ERROR_EP10
.equ	USB_EP_TX_ERROR_EP10_RESET, 0x0
.equ	USB_EP_TX_ERROR_EP10_BITS, 0x00300000
.equ	USB_EP_TX_ERROR_EP10_MSB, 21
.equ	USB_EP_TX_ERROR_EP10_LSB, 20
# -----------------------------------------------------------------------------
# Field       : USB_EP_TX_ERROR_EP9
.equ	USB_EP_TX_ERROR_EP9_RESET, 0x0
.equ	USB_EP_TX_ERROR_EP9_BITS, 0x000c0000
.equ	USB_EP_TX_ERROR_EP9_MSB, 19
.equ	USB_EP_TX_ERROR_EP9_LSB, 18
# -----------------------------------------------------------------------------
# Field       : USB_EP_TX_ERROR_EP8
.equ	USB_EP_TX_ERROR_EP8_RESET, 0x0
.equ	USB_EP_TX_ERROR_EP8_BITS, 0x00030000
.equ	USB_EP_TX_ERROR_EP8_MSB, 17
.equ	USB_EP_TX_ERROR_EP8_LSB, 16
# -----------------------------------------------------------------------------
# Field       : USB_EP_TX_ERROR_EP7
.equ	USB_EP_TX_ERROR_EP7_RESET, 0x0
.equ	USB_EP_TX_ERROR_EP7_BITS, 0x0000c000
.equ	USB_EP_TX_ERROR_EP7_MSB, 15
.equ	USB_EP_TX_ERROR_EP7_LSB, 14
# -----------------------------------------------------------------------------
# Field       : USB_EP_TX_ERROR_EP6
.equ	USB_EP_TX_ERROR_EP6_RESET, 0x0
.equ	USB_EP_TX_ERROR_EP6_BITS, 0x00003000
.equ	USB_EP_TX_ERROR_EP6_MSB, 13
.equ	USB_EP_TX_ERROR_EP6_LSB, 12
# -----------------------------------------------------------------------------
# Field       : USB_EP_TX_ERROR_EP5
.equ	USB_EP_TX_ERROR_EP5_RESET, 0x0
.equ	USB_EP_TX_ERROR_EP5_BITS, 0x00000c00
.equ	USB_EP_TX_ERROR_EP5_MSB, 11
.equ	USB_EP_TX_ERROR_EP5_LSB, 10
# -----------------------------------------------------------------------------
# Field       : USB_EP_TX_ERROR_EP4
.equ	USB_EP_TX_ERROR_EP4_RESET, 0x0
.equ	USB_EP_TX_ERROR_EP4_BITS, 0x00000300
.equ	USB_EP_TX_ERROR_EP4_MSB, 9
.equ	USB_EP_TX_ERROR_EP4_LSB, 8
# -----------------------------------------------------------------------------
# Field       : USB_EP_TX_ERROR_EP3
.equ	USB_EP_TX_ERROR_EP3_RESET, 0x0
.equ	USB_EP_TX_ERROR_EP3_BITS, 0x000000c0
.equ	USB_EP_TX_ERROR_EP3_MSB, 7
.equ	USB_EP_TX_ERROR_EP3_LSB, 6
# -----------------------------------------------------------------------------
# Field       : USB_EP_TX_ERROR_EP2
.equ	USB_EP_TX_ERROR_EP2_RESET, 0x0
.equ	USB_EP_TX_ERROR_EP2_BITS, 0x00000030
.equ	USB_EP_TX_ERROR_EP2_MSB, 5
.equ	USB_EP_TX_ERROR_EP2_LSB, 4
# -----------------------------------------------------------------------------
# Field       : USB_EP_TX_ERROR_EP1
.equ	USB_EP_TX_ERROR_EP1_RESET, 0x0
.equ	USB_EP_TX_ERROR_EP1_BITS, 0x0000000c
.equ	USB_EP_TX_ERROR_EP1_MSB, 3
.equ	USB_EP_TX_ERROR_EP1_LSB, 2
# -----------------------------------------------------------------------------
# Field       : USB_EP_TX_ERROR_EP0
.equ	USB_EP_TX_ERROR_EP0_RESET, 0x0
.equ	USB_EP_TX_ERROR_EP0_BITS, 0x00000003
.equ	USB_EP_TX_ERROR_EP0_MSB, 1
.equ	USB_EP_TX_ERROR_EP0_LSB, 0
# =============================================================================
# Register    : USB_EP_RX_ERROR
# Description : RX error count for each endpoint. Write to each field to reset
#               the counter to 0.
.equ	USB_EP_RX_ERROR_OFFSET, 0x00000110
.equ	USB_EP_RX_ERROR_BITS, 0xffffffff
.equ	USB_EP_RX_ERROR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_EP_RX_ERROR_EP15_SEQ
.equ	USB_EP_RX_ERROR_EP15_SEQ_RESET, 0x0
.equ	USB_EP_RX_ERROR_EP15_SEQ_BITS, 0x80000000
.equ	USB_EP_RX_ERROR_EP15_SEQ_MSB, 31
.equ	USB_EP_RX_ERROR_EP15_SEQ_LSB, 31
# -----------------------------------------------------------------------------
# Field       : USB_EP_RX_ERROR_EP15_TRANSACTION
.equ	USB_EP_RX_ERROR_EP15_TRANSACTION_RESET, 0x0
.equ	USB_EP_RX_ERROR_EP15_TRANSACTION_BITS, 0x40000000
.equ	USB_EP_RX_ERROR_EP15_TRANSACTION_MSB, 30
.equ	USB_EP_RX_ERROR_EP15_TRANSACTION_LSB, 30
# -----------------------------------------------------------------------------
# Field       : USB_EP_RX_ERROR_EP14_SEQ
.equ	USB_EP_RX_ERROR_EP14_SEQ_RESET, 0x0
.equ	USB_EP_RX_ERROR_EP14_SEQ_BITS, 0x20000000
.equ	USB_EP_RX_ERROR_EP14_SEQ_MSB, 29
.equ	USB_EP_RX_ERROR_EP14_SEQ_LSB, 29
# -----------------------------------------------------------------------------
# Field       : USB_EP_RX_ERROR_EP14_TRANSACTION
.equ	USB_EP_RX_ERROR_EP14_TRANSACTION_RESET, 0x0
.equ	USB_EP_RX_ERROR_EP14_TRANSACTION_BITS, 0x10000000
.equ	USB_EP_RX_ERROR_EP14_TRANSACTION_MSB, 28
.equ	USB_EP_RX_ERROR_EP14_TRANSACTION_LSB, 28
# -----------------------------------------------------------------------------
# Field       : USB_EP_RX_ERROR_EP13_SEQ
.equ	USB_EP_RX_ERROR_EP13_SEQ_RESET, 0x0
.equ	USB_EP_RX_ERROR_EP13_SEQ_BITS, 0x08000000
.equ	USB_EP_RX_ERROR_EP13_SEQ_MSB, 27
.equ	USB_EP_RX_ERROR_EP13_SEQ_LSB, 27
# -----------------------------------------------------------------------------
# Field       : USB_EP_RX_ERROR_EP13_TRANSACTION
.equ	USB_EP_RX_ERROR_EP13_TRANSACTION_RESET, 0x0
.equ	USB_EP_RX_ERROR_EP13_TRANSACTION_BITS, 0x04000000
.equ	USB_EP_RX_ERROR_EP13_TRANSACTION_MSB, 26
.equ	USB_EP_RX_ERROR_EP13_TRANSACTION_LSB, 26
# -----------------------------------------------------------------------------
# Field       : USB_EP_RX_ERROR_EP12_SEQ
.equ	USB_EP_RX_ERROR_EP12_SEQ_RESET, 0x0
.equ	USB_EP_RX_ERROR_EP12_SEQ_BITS, 0x02000000
.equ	USB_EP_RX_ERROR_EP12_SEQ_MSB, 25
.equ	USB_EP_RX_ERROR_EP12_SEQ_LSB, 25
# -----------------------------------------------------------------------------
# Field       : USB_EP_RX_ERROR_EP12_TRANSACTION
.equ	USB_EP_RX_ERROR_EP12_TRANSACTION_RESET, 0x0
.equ	USB_EP_RX_ERROR_EP12_TRANSACTION_BITS, 0x01000000
.equ	USB_EP_RX_ERROR_EP12_TRANSACTION_MSB, 24
.equ	USB_EP_RX_ERROR_EP12_TRANSACTION_LSB, 24
# -----------------------------------------------------------------------------
# Field       : USB_EP_RX_ERROR_EP11_SEQ
.equ	USB_EP_RX_ERROR_EP11_SEQ_RESET, 0x0
.equ	USB_EP_RX_ERROR_EP11_SEQ_BITS, 0x00800000
.equ	USB_EP_RX_ERROR_EP11_SEQ_MSB, 23
.equ	USB_EP_RX_ERROR_EP11_SEQ_LSB, 23
# -----------------------------------------------------------------------------
# Field       : USB_EP_RX_ERROR_EP11_TRANSACTION
.equ	USB_EP_RX_ERROR_EP11_TRANSACTION_RESET, 0x0
.equ	USB_EP_RX_ERROR_EP11_TRANSACTION_BITS, 0x00400000
.equ	USB_EP_RX_ERROR_EP11_TRANSACTION_MSB, 22
.equ	USB_EP_RX_ERROR_EP11_TRANSACTION_LSB, 22
# -----------------------------------------------------------------------------
# Field       : USB_EP_RX_ERROR_EP10_SEQ
.equ	USB_EP_RX_ERROR_EP10_SEQ_RESET, 0x0
.equ	USB_EP_RX_ERROR_EP10_SEQ_BITS, 0x00200000
.equ	USB_EP_RX_ERROR_EP10_SEQ_MSB, 21
.equ	USB_EP_RX_ERROR_EP10_SEQ_LSB, 21
# -----------------------------------------------------------------------------
# Field       : USB_EP_RX_ERROR_EP10_TRANSACTION
.equ	USB_EP_RX_ERROR_EP10_TRANSACTION_RESET, 0x0
.equ	USB_EP_RX_ERROR_EP10_TRANSACTION_BITS, 0x00100000
.equ	USB_EP_RX_ERROR_EP10_TRANSACTION_MSB, 20
.equ	USB_EP_RX_ERROR_EP10_TRANSACTION_LSB, 20
# -----------------------------------------------------------------------------
# Field       : USB_EP_RX_ERROR_EP9_SEQ
.equ	USB_EP_RX_ERROR_EP9_SEQ_RESET, 0x0
.equ	USB_EP_RX_ERROR_EP9_SEQ_BITS, 0x00080000
.equ	USB_EP_RX_ERROR_EP9_SEQ_MSB, 19
.equ	USB_EP_RX_ERROR_EP9_SEQ_LSB, 19
# -----------------------------------------------------------------------------
# Field       : USB_EP_RX_ERROR_EP9_TRANSACTION
.equ	USB_EP_RX_ERROR_EP9_TRANSACTION_RESET, 0x0
.equ	USB_EP_RX_ERROR_EP9_TRANSACTION_BITS, 0x00040000
.equ	USB_EP_RX_ERROR_EP9_TRANSACTION_MSB, 18
.equ	USB_EP_RX_ERROR_EP9_TRANSACTION_LSB, 18
# -----------------------------------------------------------------------------
# Field       : USB_EP_RX_ERROR_EP8_SEQ
.equ	USB_EP_RX_ERROR_EP8_SEQ_RESET, 0x0
.equ	USB_EP_RX_ERROR_EP8_SEQ_BITS, 0x00020000
.equ	USB_EP_RX_ERROR_EP8_SEQ_MSB, 17
.equ	USB_EP_RX_ERROR_EP8_SEQ_LSB, 17
# -----------------------------------------------------------------------------
# Field       : USB_EP_RX_ERROR_EP8_TRANSACTION
.equ	USB_EP_RX_ERROR_EP8_TRANSACTION_RESET, 0x0
.equ	USB_EP_RX_ERROR_EP8_TRANSACTION_BITS, 0x00010000
.equ	USB_EP_RX_ERROR_EP8_TRANSACTION_MSB, 16
.equ	USB_EP_RX_ERROR_EP8_TRANSACTION_LSB, 16
# -----------------------------------------------------------------------------
# Field       : USB_EP_RX_ERROR_EP7_SEQ
.equ	USB_EP_RX_ERROR_EP7_SEQ_RESET, 0x0
.equ	USB_EP_RX_ERROR_EP7_SEQ_BITS, 0x00008000
.equ	USB_EP_RX_ERROR_EP7_SEQ_MSB, 15
.equ	USB_EP_RX_ERROR_EP7_SEQ_LSB, 15
# -----------------------------------------------------------------------------
# Field       : USB_EP_RX_ERROR_EP7_TRANSACTION
.equ	USB_EP_RX_ERROR_EP7_TRANSACTION_RESET, 0x0
.equ	USB_EP_RX_ERROR_EP7_TRANSACTION_BITS, 0x00004000
.equ	USB_EP_RX_ERROR_EP7_TRANSACTION_MSB, 14
.equ	USB_EP_RX_ERROR_EP7_TRANSACTION_LSB, 14
# -----------------------------------------------------------------------------
# Field       : USB_EP_RX_ERROR_EP6_SEQ
.equ	USB_EP_RX_ERROR_EP6_SEQ_RESET, 0x0
.equ	USB_EP_RX_ERROR_EP6_SEQ_BITS, 0x00002000
.equ	USB_EP_RX_ERROR_EP6_SEQ_MSB, 13
.equ	USB_EP_RX_ERROR_EP6_SEQ_LSB, 13
# -----------------------------------------------------------------------------
# Field       : USB_EP_RX_ERROR_EP6_TRANSACTION
.equ	USB_EP_RX_ERROR_EP6_TRANSACTION_RESET, 0x0
.equ	USB_EP_RX_ERROR_EP6_TRANSACTION_BITS, 0x00001000
.equ	USB_EP_RX_ERROR_EP6_TRANSACTION_MSB, 12
.equ	USB_EP_RX_ERROR_EP6_TRANSACTION_LSB, 12
# -----------------------------------------------------------------------------
# Field       : USB_EP_RX_ERROR_EP5_SEQ
.equ	USB_EP_RX_ERROR_EP5_SEQ_RESET, 0x0
.equ	USB_EP_RX_ERROR_EP5_SEQ_BITS, 0x00000800
.equ	USB_EP_RX_ERROR_EP5_SEQ_MSB, 11
.equ	USB_EP_RX_ERROR_EP5_SEQ_LSB, 11
# -----------------------------------------------------------------------------
# Field       : USB_EP_RX_ERROR_EP5_TRANSACTION
.equ	USB_EP_RX_ERROR_EP5_TRANSACTION_RESET, 0x0
.equ	USB_EP_RX_ERROR_EP5_TRANSACTION_BITS, 0x00000400
.equ	USB_EP_RX_ERROR_EP5_TRANSACTION_MSB, 10
.equ	USB_EP_RX_ERROR_EP5_TRANSACTION_LSB, 10
# -----------------------------------------------------------------------------
# Field       : USB_EP_RX_ERROR_EP4_SEQ
.equ	USB_EP_RX_ERROR_EP4_SEQ_RESET, 0x0
.equ	USB_EP_RX_ERROR_EP4_SEQ_BITS, 0x00000200
.equ	USB_EP_RX_ERROR_EP4_SEQ_MSB, 9
.equ	USB_EP_RX_ERROR_EP4_SEQ_LSB, 9
# -----------------------------------------------------------------------------
# Field       : USB_EP_RX_ERROR_EP4_TRANSACTION
.equ	USB_EP_RX_ERROR_EP4_TRANSACTION_RESET, 0x0
.equ	USB_EP_RX_ERROR_EP4_TRANSACTION_BITS, 0x00000100
.equ	USB_EP_RX_ERROR_EP4_TRANSACTION_MSB, 8
.equ	USB_EP_RX_ERROR_EP4_TRANSACTION_LSB, 8
# -----------------------------------------------------------------------------
# Field       : USB_EP_RX_ERROR_EP3_SEQ
.equ	USB_EP_RX_ERROR_EP3_SEQ_RESET, 0x0
.equ	USB_EP_RX_ERROR_EP3_SEQ_BITS, 0x00000080
.equ	USB_EP_RX_ERROR_EP3_SEQ_MSB, 7
.equ	USB_EP_RX_ERROR_EP3_SEQ_LSB, 7
# -----------------------------------------------------------------------------
# Field       : USB_EP_RX_ERROR_EP3_TRANSACTION
.equ	USB_EP_RX_ERROR_EP3_TRANSACTION_RESET, 0x0
.equ	USB_EP_RX_ERROR_EP3_TRANSACTION_BITS, 0x00000040
.equ	USB_EP_RX_ERROR_EP3_TRANSACTION_MSB, 6
.equ	USB_EP_RX_ERROR_EP3_TRANSACTION_LSB, 6
# -----------------------------------------------------------------------------
# Field       : USB_EP_RX_ERROR_EP2_SEQ
.equ	USB_EP_RX_ERROR_EP2_SEQ_RESET, 0x0
.equ	USB_EP_RX_ERROR_EP2_SEQ_BITS, 0x00000020
.equ	USB_EP_RX_ERROR_EP2_SEQ_MSB, 5
.equ	USB_EP_RX_ERROR_EP2_SEQ_LSB, 5
# -----------------------------------------------------------------------------
# Field       : USB_EP_RX_ERROR_EP2_TRANSACTION
.equ	USB_EP_RX_ERROR_EP2_TRANSACTION_RESET, 0x0
.equ	USB_EP_RX_ERROR_EP2_TRANSACTION_BITS, 0x00000010
.equ	USB_EP_RX_ERROR_EP2_TRANSACTION_MSB, 4
.equ	USB_EP_RX_ERROR_EP2_TRANSACTION_LSB, 4
# -----------------------------------------------------------------------------
# Field       : USB_EP_RX_ERROR_EP1_SEQ
.equ	USB_EP_RX_ERROR_EP1_SEQ_RESET, 0x0
.equ	USB_EP_RX_ERROR_EP1_SEQ_BITS, 0x00000008
.equ	USB_EP_RX_ERROR_EP1_SEQ_MSB, 3
.equ	USB_EP_RX_ERROR_EP1_SEQ_LSB, 3
# -----------------------------------------------------------------------------
# Field       : USB_EP_RX_ERROR_EP1_TRANSACTION
.equ	USB_EP_RX_ERROR_EP1_TRANSACTION_RESET, 0x0
.equ	USB_EP_RX_ERROR_EP1_TRANSACTION_BITS, 0x00000004
.equ	USB_EP_RX_ERROR_EP1_TRANSACTION_MSB, 2
.equ	USB_EP_RX_ERROR_EP1_TRANSACTION_LSB, 2
# -----------------------------------------------------------------------------
# Field       : USB_EP_RX_ERROR_EP0_SEQ
.equ	USB_EP_RX_ERROR_EP0_SEQ_RESET, 0x0
.equ	USB_EP_RX_ERROR_EP0_SEQ_BITS, 0x00000002
.equ	USB_EP_RX_ERROR_EP0_SEQ_MSB, 1
.equ	USB_EP_RX_ERROR_EP0_SEQ_LSB, 1
# -----------------------------------------------------------------------------
# Field       : USB_EP_RX_ERROR_EP0_TRANSACTION
.equ	USB_EP_RX_ERROR_EP0_TRANSACTION_RESET, 0x0
.equ	USB_EP_RX_ERROR_EP0_TRANSACTION_BITS, 0x00000001
.equ	USB_EP_RX_ERROR_EP0_TRANSACTION_MSB, 0
.equ	USB_EP_RX_ERROR_EP0_TRANSACTION_LSB, 0
# =============================================================================
# Register    : USB_DEV_SM_WATCHDOG
# Description : Watchdog that forces the device state machine to idle and
#               raises an interrupt if the device stays in a state that isn't
#               idle for the configured limit. The counter is reset on every
#               state transition.
#               Set limit while enable is low and then set the enable.
.equ	USB_DEV_SM_WATCHDOG_OFFSET, 0x00000114
.equ	USB_DEV_SM_WATCHDOG_BITS, 0x001fffff
.equ	USB_DEV_SM_WATCHDOG_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_DEV_SM_WATCHDOG_FIRED
.equ	USB_DEV_SM_WATCHDOG_FIRED_RESET, 0x0
.equ	USB_DEV_SM_WATCHDOG_FIRED_BITS, 0x00100000
.equ	USB_DEV_SM_WATCHDOG_FIRED_MSB, 20
.equ	USB_DEV_SM_WATCHDOG_FIRED_LSB, 20
# -----------------------------------------------------------------------------
# Field       : USB_DEV_SM_WATCHDOG_RESET
# Description : Set to 1 to forcibly reset the device state machine on watchdog
#               expiry
.equ	USB_DEV_SM_WATCHDOG_RESET_RESET, 0x0
.equ	USB_DEV_SM_WATCHDOG_RESET_BITS, 0x00080000
.equ	USB_DEV_SM_WATCHDOG_RESET_MSB, 19
.equ	USB_DEV_SM_WATCHDOG_RESET_LSB, 19
# -----------------------------------------------------------------------------
# Field       : USB_DEV_SM_WATCHDOG_ENABLE
.equ	USB_DEV_SM_WATCHDOG_ENABLE_RESET, 0x0
.equ	USB_DEV_SM_WATCHDOG_ENABLE_BITS, 0x00040000
.equ	USB_DEV_SM_WATCHDOG_ENABLE_MSB, 18
.equ	USB_DEV_SM_WATCHDOG_ENABLE_LSB, 18
# -----------------------------------------------------------------------------
# Field       : USB_DEV_SM_WATCHDOG_LIMIT
.equ	USB_DEV_SM_WATCHDOG_LIMIT_RESET, 0x00000
.equ	USB_DEV_SM_WATCHDOG_LIMIT_BITS, 0x0003ffff
.equ	USB_DEV_SM_WATCHDOG_LIMIT_MSB, 17
.equ	USB_DEV_SM_WATCHDOG_LIMIT_LSB, 0
# =============================================================================
.endif # _HARDWARE_REGS_USB_H
